[
  {
    "symbol": "CFLT",
    "period": "Q2",
    "year": 2023,
    "date": "2023-08-02",
    "content": "Operator: Hi, everyone. Welcome to the Confluent Q2 2023 Earnings Conference Call. I'm Shane Xie from Investor Relations, and I'm joined by Jay Kreps, Co-Founder and CEO; Steffan Tomlinson, CFO and Rohan Sivaram, our incoming CFO. During today's call, management will make forward-looking statements regarding our business, operations, financial performance and future prospects. These include statements regarding our financial guidance for the fiscal second quarter of 2023 and fiscal year 2023 and growth in our market opportunity and market share. These forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from those anticipated by these statements. Further information on risk factors that could cause actual results to differ is included in our most recent Form 10-Q filed with the SEC. We assume no obligation to update these statements after today's call, except as required by law. Unless stated otherwise, certain financial measures used on today's call are expressed on a non-GAAP basis and all comparisons are made on a year-over-year basis. We use these non-GAAP financials measures internally to facilitate analysis of our financial and business trends and for internal planning and forecasting purposes. These non-GAAP financial measures have limitations and should not be considered in isolation from or as a substitute for financial information prepared in accordance with GAAP. A reconciliation between these GAAP and non-GAAP financial measures is included in our earnings press release and supplemental financials, which can be found on our Investor Relations website at investors.confluent.io. And with that, I'll hand the call over to Jay.\nJay Kreps: Thanks, Shane. Good afternoon, everyone and welcome to our second quarter earnings call. We delivered a great quarter, for the ninth time in a row we exceeded the high end of all guided metrics. Before going into further detail in the quarter, I'd like to share some organizational news. Steffan Tomlinson will be stepping down from his role as Confluent’s CFO and will be joining Stripe as their CFO. Rohan Sivaram has been named Confluent’s next Chief Financial Officer. Rohan is a seasoned finance and operations leader with nearly two decades of experience at leading companies across financial services, cybersecurity and data infrastructure. Rohan joined Confluent pre-IPO in 2020. He's been instrumental to the success of our organization across corporate finance, investor relations, treasury and business operations. Over the last three years, I've had the opportunity to work very closely with Rohan and could not be more excited to see him assuming this new role as our CFO. And Steffan, I wanted to take a moment to thank you for everything you've done for us. You've had an impact on every aspect of Confluent, including growing and scaling our operations, building a world class team and taking us through all nine quarters of earnings as a public company. Thank you and best of luck with your new role.\nSteffan Tomlinson: Thank you, Jay. It's been an amazing experience and career milestone to work with you and the talented team at Confluent. We've built a deeply differentiated platform that's powered our robust growth, which positions the company very well for the future. I couldn't think of a better leader than Rohan to help guide the company to the next level as Confluent’s new CFO. Rohan is truly an exceptional leader. We've known each other for nearly a decade and worked closely at both Confluent and Palo Alto Networks. Congratulations, Rohan, you'll do great in your new role.\nRohan Sivaram: Thank you, Steffan. Congratulations to you as well. It's been a pleasure working with you over the years and I'd like to wish you the very best in your next role. We have a world class innovation engine and an amazing team at Confluent. We are a market leader in a $60 billion TAM and we're just getting started. I very much look forward to driving efficient growth in the years ahead. Now back to you, Jay.\nJay Kreps: Thanks Rohan. Turning now to our Q2 results, total revenue grew 36% to $189 million. Confluent cloud revenue grew 78% to $84 million and non-GAAP operating margin improved 24 points. We have driven more than 30 points of margin improvements in the last 18 months and are well on our way to breakeven in Q4 this year. Achieving this sustained level of high growth despite ongoing market challenges underscores the mission critical nature of data streaming and reinforces our product leadership. In May, we hosted Kafka Summit London 2023. This year more than 1500 members of the community from over 50 countries joined us in person with greater than 2300 tuning in virtually. On our Q1 earnings call, we talked about the opportunity for monetizing Kafka and Confluent Cloud. This was emphasized at Kafka Summit with the unveiling of Kora, the next generation engine that powers Confluent Cloud. We shared with the audience some of the architectural elements that enable our cloud to drive a 10x advantage in performance while delivering a 60% TCO improvement. Our Kafka business has phenomenal growth ahead of it. Modern data architecture is increasingly centered around streaming and this has driven Kafka to be adopted by hundreds of thousands of organizations, including over 75% of the Fortune 500. This open source user base is growing rapidly and we are still in the early days of monetizing it. The inherent TCO and performance advantages of our cloud offering mean that in addition to the natural growth of this user base, we believe we can dramatically improve the proportion that is monetized as usage shifts to the cloud and can be captured by a managed service. If that were the extent of Confluent’s opportunity, that would be a very exciting prospect and enough to sustain our growth for many years but Kafka is just the start. In this call, I want to outline the evolution Confluent is driving in the streaming space and how we stand to benefit from it. This evolution is the rise of the data streaming platform. Kafka is the foundational layer in this platform but I outlined today the five key areas of capability that significantly extend the reach and value of streaming infrastructure and that we think are essential elements to the rise of data streaming platforms. The key capabilities of a DSP are the ability to stream, connect, govern, process and share. These capabilities capture the full life cycle of streaming data, how to get it, process it, use it, manage it and share it between systems. Kafka is the stream of data. It allows companies to produce and consume real time streams of data at any scale with strong guarantees on the delivery of data. It is the foundational hub of data exchange in a modern data architecture and today it comprises the substantial majority of our Confluent cloud revenue. But these other capabilities are not mere add-ons. They are essential components of the emerging platform and represent significant opportunities for monetization for Confluent that are still early in their realization. I'll walk through each of these capabilities. Discuss the evidence that each is growing into a broadly adopted portion of the DSP and talk about how Confluent is adding these capabilities to Confluent Cloud. Our Kafka business and Confluent Cloud is growing very fast, but even today these non-Kafka components are growing even faster. Over time, we expect these capabilities to drive the majority of our cloud revenue even as they help to accelerate the use of Kafka as the underlying strength. Let's start with connectors. Connectors may seem mundane, but they are in fact a key capability. Indeed, many ETL and integration products differentiate in large part on their pool of connectors. They are central to our vision as well. To build a central nervous system for your business you have to be able to connect all of your systems to capture the real time streams of data. Confluent Cloud makes it possible to run any Kafka connector in a cloud native way, making them serverless, elastically scalable and fault tolerant. This has driven the development of over 120 connectors created and owned by Confluent to some of the most common enterprise systems. However, the ecosystem of connectors is far larger than just these. There are many hundreds of open source connectors to less common systems that are available. We are still early in monetizing this area in Confluent Cloud as fully unlocking it requires ease of use across cloud networking layers and disparate data and SAS systems. We took a major step towards this in Q2 with the release of our custom connectors offering, which allows running any open source connector inside Confluent Cloud, expanding our reach beyond the set of connectors we ship with out-of-the-box. We believe this is still in the early phases of full unlock. On premise in our Confluent platform product Connect has approximately an 80% adoption rate. But we are still in the early days of ramping that level of usage in our fully managed offering Confluent Cloud. As data streaming use cases grow and real time data flows across internal systems and applications it's critical that users can discover, monitor and reason about the security and integrity of that data. You need to control who has access to the data to find how that data is allowed to evolve and visualize and monitor where it ultimately goes. Creating a central nervous system for data is only possible if you can stream data safely. What do these governance concerns have to do with streaming, you might ask? Well, it turns out that governance concerns come into play precisely when data moves between systems, when it's exchanged between teams or is transported between Regents, or as processed from one form to another. In other words, data governance needs arise directly from the primary use of data streaming. Because Confluent handles this movement and processing, we are uniquely positioned to directly integrate governance of that movement automatically and seamlessly in a way that no other vendor can with a bolt on product. This is the role of stream governance, one of our first moves up the stack and a large product opportunity for Confluent. Stream Governance is our fully managed governance suite that delivers a simple self-service experience for customers to discover, trust and understand how data flows across their business. We have taken a freemium approach to stream governance giving basic functionalities to every customer and more recently, starting to monetize with our Stream Governance Advanced offering. Two thirds of our Confluent Cloud customers are using Stream Governance today and revenue growth from Stream Governance Advanced is the fastest of any product we've launched today. The next area of the DSP is Stream Processing. This is an easy one to understand. Data processing is a key component of any major data platform and SQL and other processing layers are a key component of modern databases. Stream Processing extends these processing capabilities to real time data streams. We believe that Apache Flink is emerging as the de facto standard for stream processing. Flink has the most powerful implementation of stream processing of any technology, open source or proprietary, fully realizing streaming as a generalization of batch processing and making it available across a rich ecosystem of programming languages and interfaces. It is widely popular in the open source community and is used by some of the most technically sophisticated companies in the world, including Apple, Capital One, Netflix, Stripe, and Uber. We've discussed the criticality of Stream Processing to our strategy in the past. The easiest way to understand the potential in this area is to understand that for each stream in Confluent Cloud today, there's likely to be some application code processing or reacting to that stream of data.  That application code represents complex software engineering and the opportunity for Flink from the customer's point of view is to simplify that development effort, from Confluence point of view this allows us to monetize not just the data, but the application itself while helping the customer to realize efficiencies in both the development and operational costs that are possible with the cloud native stream processing layer. We took a major step forward on our Flink strategy this last quarter when we announced the early access program at Kafka Summit, opening up this offering to the first customers who are now actively using the platform. Early feedback is very encouraging with particular enthusiasm for the direct integration into the other capabilities of Confluent Cloud. For customers, this means their streams of data in Kafka are automatically available for processing in Flink’s SQL and that everything works together with the shared model of governance and security. We're incredibly excited about this product and look forward to its broad availability later this year. The final capability is about making it easy to share data streams. Sharing within a company has been a mainstay of our platform for some time. However, now we have extended that between companies with a feature we just launched at Kafka Summit, Stream Sharing. This intercompany sharing is a pattern we noticed was gaining startling traction in our customer base in recent years. Customers in financial services and insurance needed to integrate and provide key financial data streams with a complex set of providers. Customers in travel needed to exchange real time data on flights between airports, airlines, bookings companies and baggage handling companies. Retailers and manufacturers had to ingest real time streams from suppliers to manage an end-to-end view of their inventory or supply chain. Oftentimes these companies would have teams working out complex systems to mediate this sharing, only to realize on further discussion that on both sides the foundational layer that they were opening up was the same. It was Kafka. Stream Sharing allows these companies to enable this inter organizational sharing for any of their existing streams and to do so in a way that enables the same governance and security capabilities that they'd use internally with added capabilities to address the additional concerns of allowing access from external parties. This means extending our central nervous system vision for something that spans a company to something that spans large portions of the digital economy. By doing this the natural network effect of streaming where streams attract apps which in turn attract more Streams is extended beyond a single company, helping to drive the acquisition of new customers as well as the growth within existing customers. It's essential to understand that these five capabilities stream, connect, govern, process share, are not only additional things to sell, they are all part of a unified platform and the success of each drives additional success in the others. The connectors make it easier to get data streams into Kafka, which accelerates not just our core Kafka business, but also opens up more data for processing in Flink, adds to the set of streams governed by Stream Governance where they're shareable by Stream Sharing. Applications built with Flink drive use of connectors for data acquisition and read and write their inputs from Kafka. Governance and sharing add to the value proposition for each stream added to the DSP. Each of these capabilities strengthens the other four. The full value of this will not be realized overnight. Cloud infrastructure takes time to mature and reach completion. Each of these areas is earlier in the S curve of maturity and adoption than Kafka, but over time, we think these will directly contribute revenue larger than Kafka itself in addition to driving further consumption of Kafka. Most importantly is what these capabilities let our customers do. As these parts come together, they comprise a data platform that is as complete as data warehouses, data lakes or databases have grown to be over the years. We think this data streaming platform will be of equal size and importance to these other platforms serving as the fundamental nervous system for a modern company. This complete platform resonates with companies of all sizes, industries and geographies serving an endless number of use cases. One segment of our customer base that has been under particular pressure in this macro environment is digital native tech companies who are under increasing pressure to drive new efficiencies. But this is also a high performing segment of our business, a testament to our execution and the TCL advantages of our platform. This includes customers like Instacart, Netflix, Plat and Square. We are seeing particularly strong traction in this segment in India, including customers like Meesho. Meesho is a high growth Indian e-commerce company who last year was one of the most downloaded shopping apps in the world. It was the fastest shopping app to cross 500 million downloads and regularly sees huge traffic spikes that see over 1,000,000 requests per second. Kafka is used broadly across Meesho's business including its real time recommendation engine to deliver great user experience for customers and sellers. But manually configuring and tuning open source Kafka wasn't aligned with their overall push for sustainable solutions and driving business efficiencies. So they migrated to Confluent Cloud. Confluent now processes its shopping transactions and is a key part of the architecture that delivers exceptional experiences for its buyers and sellers. Policy Genius is an online insurance marketplace that covers more than 30 million customers and their life, disability, home and auto insurance needs. Today's customers demand real time in all aspects of their life, even when shopping for insurance. By combining modern tech with real agents, Policy Genius delivers quotes from leading insurance companies side by side in minutes and helps customers through the selection and purchasing process. Initially, they relied on the competitors Kafka compatible data streaming technology to stream policy information to their agents, but they found themselves spending too much supporting the platform and were caught off guard by surprise costs. And as they look to expand use cases, they needed a more complete data streaming platform they could grow alongside them. After two months trialing Confluent as a pay-as-you-go customer, they went all in on Confluent Cloud in Q2. With Confluent Cloud, Policy Genius can save money while helping their customers feel good about finding the right insurance online. Recursion Pharmaceuticals is a leading biotech company that uses advancements in AI and biology to accelerate and industrialize the discovery of new drugs. Traditional drug discovery is often slow and expensive, relying on manual bespoke processes and experiments influenced by human bias. Recursion, on the other hand, runs over 2 million experiments per week to generate a massive biological and chemical data set to train machine learning models that discover new insights beyond what is known in scientific literature. Confluent is the backbone stream infrastructure for experimental data that feeds their AI models, with more than 23 petabytes of real time biological and chemical data improving the predictions of the models. This approach rapidly accelerates the time it takes to discover and develop drugs, and ultimately as how they improve the lives of patients all around the world. In closing, I'm pleased with our strong second quarter results. Our results show that data streaming has emerged as a mission critical component of the modern data stack and our rapid pace of product innovation puts us in an excellent position to continue capturing more of this $60 billion market opportunity. With that, I'll turn the call over to Steffan to walk through our financials one last time.\nSteffan Tomlinson: Thanks, Jay. We delivered another strong quarter beating our guidance on all metrics. Key highlights for the second quarter include robust top line growth, strong customer expansion and substantial margin improvements. These results underscore our leadership position in a $60 billion data streaming market and our team's track record of driving durable and efficient growth. Turning now to the results, RPO for the second quarter was $791.4 million, up 34%. Current RPO, estimated to be 65% of RPO, was $514.8 million, up 41%. Our growth rates in RPO, while healthy were impacted by a continuation of lower average deal sizes, a result of customer scrutinizing their budgets in the current environment. Despite the budget scrutiny, we remain encouraged that customers continue to derive value from using Confluent and consume more than their commitments, which is reflected in our revenue but not in our RPO results. In Q2, we added 140 net new customers, ending the quarter with approximately 4830 customers, up 17%. The growth in our large customer base remained robust, driven by continued expansion of use cases. We added 69 customers with 100K or more in ARR, bringing the total to 1144 customers up 33%. These large customers contributed more than 85% of total revenue in the quarter. We also added 12 customers with $1,000,000 or more in ARR, bringing the total to 147 customers, up 48%. And our $5 million plus cohort continued to grow. Our expansion momentum shows that Confluent is the platform of choice for data streaming from early stage adoption to cross company standardization and ultimately the central nervous system of our customers’ modern tech stack. For Q2 and NRR was above 130% in GRR was above 90%, NRR for Cloud was above 140%, reflecting the power of the industry's only cloud native platform made possible with Quora. Turning to the P&L, total revenue grew 36% to $189.3 million. Subscription revenue was very strong and grew 39% to $176.5 million and accounted for 93% of total revenue. Within subscription, Confluent platform grew 16% to $92.9 million, exceeding our expectations and accounted for 49% of total revenue. Q2 marks the second quarter this year in which Confluent Platform overperformed relative to expectations. It was driven by strength in regulated industries such as public sector and financial services. These industries are still in the early stages of moving workloads to the cloud, but have a high demand for on-prem data streaming. Confluent Cloud revenue grew 78% to $83.6 million. We guided sequential revenue growth of $7.5 million to $8 million for Q2. The actual sequential increase came in at $9.9 million, exceeding the midpoint of our guidance range by $2.2 million and it was driven primarily by higher than expected consumption from select customers. From a product mix standpoint, cloud revenue accounted for 44% of revenue compared to 34% of revenue a year ago and cloud as a percentage of new ACV, bookings exceeded 50% for the 7th consecutive quarter. Turning to the geographic mix of revenue, revenue from the U.S. grew 30% to $113.9 million, revenue from outside the U.S. grew 45% to $75.4 million. Moving to the rest of the income statement, I'll be referring to non-GAAP results unless stated otherwise. Total gross margin was 75%, up 440 basis points and above our FY23 target range of 72% to 73%. Subscription gross margin was 79.1%, up 230 basis points, gross margin outperformance was driven by our strong Confluent platform margin that continued improvement in efficiency, optimization of underlying hardware profile and increase multi tenancy and Quora, our core Kafka engine and Confluent Cloud. Turning to profitability and cash flow, operating margin improved 24 percentage points and negative 9.2%, representing our 4th consecutive quarter of more than 10 points in improvement. Q2 operating margin was driven by subscription revenue outperformance and our continued focus on driving efficiency across the company. We drove improvement in every category of our operating expenses with the most pronounced progress made again in sales and marketing improving 14 percentage points and we're pleased to achieve $0.00 net income per share in Q2.  We've included all related shares, outstanding amounts used to calculate historical and guided net loss or income per share and our earnings presentation on our website. Free cash flow margin improved 8 percentage points to negative 18.6%. We ended the second quarter with $1.85 billion in cash, cash equivalents and marketable securities. Now turning to our outlook, I'd like to provide context on how our approach to guidance continues to evolve in response to what we're seeing in the business environment. At the beginning of the year, we prudently took into consideration and have been navigating the tough selling environment and the macro related factors of additional budget scrutiny and changes in customer buying behavior, both of which have led to sales cycle elongation. We've learned through the first half of this year that customers are more inclined to sign shorter duration contracts, start with smaller initial deal sizes and are okay consuming more than their committed contracts, which has been reflected in our results. Our point of view is the choppy macro environment we've seen will continue throughout the remainder of the year. Even with these macro dynamics at play, our data streaming platform continues to grow at outsized rates. Our subscription revenue growth of 39% in Q2 tells the story. From a product mix standpoint, Confluent platform, which is prevalent and regulated industries has overperformed relative to our expectations. We expect Confluent Platform to continue to perform well in the second-half, trending above the expectations we had at the beginning of the year. Our cloud business continues to be a bright spot given the high net retention rates, product market fit, strong TCO and ROI it delivers to customers. We expect cloud to continue to grow at a substantially higher rate than the rest of the business in the second-half. We'll continue to monitor the signals of our business and proactively manage the rate and pace of investments. If the macro sentiment improves, we'd expect to benefit from that, but it's too soon to call. Moving on to our guidance, I'm pleased to share that we're raising total revenue, gross margin, operating margin and EPS for both the quarter and the year. For the third quarter of 2023, we expect revenue to be in the range of $193.5 million to $195.5 million, representing growth of 28% to 29%. Cloud revenue to be approximately $92.2 million, representing growth of 62% and accounting for approximately 47% of total revenue based on the midpoint of our guide. Implied in that is a sequential revenue add of approximately $8.5 million which is above our prior quarter guidance range of $7.5 million to $8 million for Q2 23. Non-GAAP operating margin to be approximately negative 10% and non-GAAP net loss or income per share to be in the range of negative $0.1 to $0.00. For the full year 2023, we expect revenue to be in the range of $767 million to $772 million representing growth of 31% to 32%. Non-GAAP operating margin to be approximately negative 10% and non-GAAPp net loss per share in the range of negative $0.5 to negative $0.2 cents. Additionally, we're raising our FY23 target range for non-GAAP gross margin to approximately 74% for Q 4 2024 targets we continue to expect to land within the range of 48% to 50% for cloud as percentage of total revenue, but likely at the lower end due to the factors we called out before and the strength in our Confluent platform business impacting product mix shift. And we continue to expect to achieve break even for non-GAAP operating margin. The timing of free cash flow margin break even will roughly mirror that of our operating margin. In closing, I'm pleased with the continued momentum we see across Confluent Platform and Confluent Cloud. Our market leading data streaming platform is winning and we're continuing to execute well in a choppy macro environment. Looking forward, we're well positioned to drive durable and efficient growth. Now Jay, Rohan and I will take your questions.\nOperator: Thanks, Steffan. To join the Q&A, please raise your hand. And today, our first question will come from Jason Ader with William Blair, followed by Wells Fargo. Jason, please go ahead.\nJason Ader: Yes. Thanks Shane and good luck to you Steffan. You really do have the Midas touch, with your job choices, but my question is on the consumption side. Confluent Cloud has been out for a few years now. Are you seeing a trend where customers are over consuming more than they previously had and you talked about kind of the annual commitments that they're making, are they tending to make lower annual commitments because of the economy and therefore overconsume more and then how does that manifest in the numbers?\nSteffan Tomlinson: Yes that's a great question and that dynamic is present. I would attribute it to two facts, internally we have been really shifting our go-to market to emphasize driving consumption, more use cases coming on to the platform as quickly as possible even outside of the term of new commitments. And then externally, yes, there's real market pressure and so companies are being very thoughtful about how, what they commit to up front, how much they pay ahead et cetera, and so, both those dynamics are present and that is reflected in a really strong consumption results. I think it's ultimately healthy. This is kind of the intention of these consumption models that's certainly how we treat consumption vendors internally. But it does show up you know when you look at the kind of RPO, CRPO split and RPO versus kind of revenue performance for Confluent Cloud.\nJason Ader: All right and one quick follow up just on Fed ramp, when are you guys expecting to get Fed ramp authorized for Confluent Cloud?\nSteffan Tomlinson: Yeah, we haven't given any you know public timeline for that. It's obviously a big focus for us and we've seen really strong results in the public sector even though we're effectively kind of fighting with one hand tied behind our back. So we're very excited about that coming online.\nJason Ader: Thanks very much and Congrats to you, Rohan.\nRohan Sivaram: Alright, thanks Jason. We'll take our next question from Michael Turrin with Wells Fargo followed by Goldman. Michael, please go ahead.\nMichael Turrin: Hi, thanks. Appreciate you taking the question. I apologize the video operator seems to be not too kind on my side, but quick question just on Cloud, obviously a big point of focus came in strong in Q2, just wondering if you can add commentary on the progression you saw during the quarter, visibility you have into rest of the year as a result and then it looked like 3Q guidance is now sequentially down a touch as of starting point versus where Q2 came in. Was there anything unexpected that came through in Q2 or maybe just help us think through the progression of what you're expecting to see on Cloud from here? Thanks.\nJay Kreps: Yes, we saw really great results on consumption. I would say particularly set a larger customers drove kind of over performance there. We didn't think that that indicated necessarily equal over performance on each subsequent quarter. But overall the trajectory for Cloud consumption is very strong and we feel really good about it. So I don't know if you want to add anything to that Steffan?\nSteffan Tomlinson: Yes. The only other thing I'd add is at the beginning of the year we had called for sequential increases in Cloud revenue and we've been delivering that in Q1 and Q2. We had guided $7.5 million to $8 million for Q2 and we came in $2.2 million above the midpoint of the range and so when you when you take out a little bit of that over performance and you look at our guide for Q3 that will, that is a sequential increase relative to our original guide in Q2. So the underlying strength and drivers of the cloud business very strong and we are seeing adoption across cohorts and we're seeing very good adoption in the marketplace.\nMichael Turrin: That's helpful. Just a follow up if I may on the subscription gross margin, you continue to drive ramp, you're now 79%. Can you just help us think through any further potential leverage there in the in the trade-offs on total gross margin between the Cloud mix and what you're seeing there?\nJay Kreps: Yes, there's a number of factors that contribute. I mean, there there's kind of two things going on under the covers. On one hand, is the percentage that is Confluent Cloud has gone up and of course Confluent Cloud being you know a managed service has a lower gross margin than Confluent platform which is pure software. At the same time Confluent Cloud gross margin has been rapidly improving and that's due to a number of factors, but in particular the improvements in Kora, more emphasis on the multi tenancy and the system, improvements in the underlying hardware profile that we use, improvements in the software stack really top to bottoms [indiscernible] drive efficiency. And so we're very excited by the progress there. I don't know if you want to add anything to that Steffan?\nSteffan Tomlinson: I’ll just say it's been a real bright spot, our progression in gross margin it's a demonstration of the value that we're delivering to our customers and it's also a reflection of the fine engineering work, engineering optimization work and also the discipline we have on pricing. So, it's been a real positive and we've been able to drive that gross margin higher both on the Confluent Cloud side and the Confluent Platform side.\nMichael Turrin: Thanks. Congrats to both of you, Rohan and Steffan.\nSteffan Tomlinson: Thank you.\nRohan Sivaram: Thank you.\nOperator: Thanks, Michael. We'll take our next question from Kash Rangan with Goldman Sachs, followed by Barclays.\nKash Rangan: Hi, thank you very much. Jay, nice quarter. Steffan will definitely miss you and Rohan, huge congratulations. Great to watch your career trajectory over the past several years. So one for you Jay, when you look at-- we thought we're going to have a recession this year and looks like we've dodged one. If the economic conditions do stabilize, how do you see Confluent Cloud versus Platform, not to make it one versus the other, both the great products, but when customers start to get back to priorities, do you think we'll get back to a more platform upside or rather a Cloud upside because in this downturn I think the on-prem component of many software companies that have hybrid business models has taken a little bit more precedence, I don't know why and the Cloud adoption generally has slowed a bit. Do you think that- we go back to clouded option if the economic conditions do stabilize and one for you Steffan if I could, when we look at the cloud business the use cases, are you getting basically identical use cases as to the on Prem or are you seeing a new set of use cases that really is pulling away the Cloud momentum in a different direction? Maybe it's a different set of customers and a different set of industries, some set of use cases or different geographies? I'll take this opportunity to ask you a bit of a technical question because we're going to miss you in a couple of months. So, anyway, I'll throw that out.\nJay Kreps: Yes put them to the test on the way out. I think that's fair. Yes it's a, it's a great question, Kash. So yes, I mean it's a little bit speculative. I do think that you're on to something there though. What we have seen is two behaviors, one I already alluded to which is this very strong consumption relative to commit. So people just being thoughtful about commits, but then actually using more than more than they had committed to. I do think there's also a set of customers that are being a bit, little bit more thoughtful about the pace of their cloud migration. So I've heard of people pulling back entirely. We haven't seen that in our customer base like people are moving to the cloud, but they're kind of trying to get the last dollar out of their on premise environments, thoughtful about which workload moves in when, a little bit more hesitant to have parallel spend. And you know the result of that has, I think has driven some of the success of Confluent Platform in addition to the public sector thing which we alluded to. It's not a bad thing for us. You know it is our strategy to be able to span all these environments and connect them and we think that strength in OneDrive, strengthen the other and so we're happy to serve the customers in the environment that they're using. That’s very much our approach on the product side. But I do suspect that yes, were we to see kind of an acceleration and a little bit of a loosening of the purse strings and the IT budgets. I do think you'd see a little bit faster push in the Cloud and if that speculation were correct then that would probably drive our Cloud business further.\nSteffan Tomlinson: Yes. And as it relates to the second question, just around use cases, there's the traditional set of use cases that we've talked about a lot, but I'd like to just focus a moment on some of the Gen AI, AI and ML use cases that we're seeing. Customers are really starting to do and have been doing a number of things. First is, they're building real time context data and using that to power chat interfaces with their customers. You've seen them also provide product recommendations based off of demographics and buying patterns. And then we've also seen technology that deploys AI assistance to drivers and helping with fleet logistics. And then finally, I would say customers are also building a real time ML and data science pipeline to power their new fraud detection platform. So there are lots of use cases that companies have already been using our technology for, but then with the all the advances that are being made, they're going to be using our technology even more so in the future.\nKash Rangan: Good luck with the next venture. Thank you so much. Great working with you, Steffan\nSteffan Tomlinson: Thank you very much. Appreciate it.\nOperator: Thanks, Kash. We'll take our next question from Raimo Lenschow with Barclays followed by Deutsche.\nRaimo Lenschow: Hi, thank you. And all the best for me as well Steffan and Rohan. And two quick questions. First, if you think about the Cloud momentum that you have at the moment, what are you seeing in terms of pipeline here, in terms of what's going to drive the growth going forward? Is that going to be more like existing use cases with heavier consumption or do you see like early signs of more people going back to Kash's questions of people just thinking about like, okay, I need to next use case, the next use case, next use case, what are you seeing there? That's first question. The second one is with the recent changes at New Relic, is there any update you have there in terms of the how that's going, because that's obviously a big reference customer for you and it's important for you? Thank you.\nJay Kreps: Yes. You know, to the first question, I want to make sure I understand it right. You're saying what's kind of the pattern of consumption that we're seeing? Is it more use case driven or is it more, something else? Help me understand the kind of nuance that you're drawing.\nRaimo Lenschow: Yes, so it's more like are they -- is it more use cases are the streams getting bigger or is it just like a whole new project in different departments of the different -- of the customers?\nJay Kreps: Yes, yes, that's a great question. So yes, I would say generally our expansion is driven by, either new use cases or conversion of existing use cases that are using the open source. There obviously there's some expansion of existing use cases like there's more data, but of course there could be less data in some other use case. On net, I don't know the businesses are just getting bigger at a large rate year-over-year. The other area of expansion is the new product capabilities that we're adding. We have a consumption model as those layers on customers can kind of in a very frictionless way use more of that. For Confluent Cloud thus far it has been kind of largely driven by Kafka, but we are expecting over time some of those other components to drive. So those are those are kind of the three vectors expansion in the use of capabilities, expansion in the kind of raw volume of data and expansion and use cases today the spread of use cases is definitely the one that drives is.\nSteffan Tomlinson: And then to the New Relic question, yes, you know they they've progressed in their deployment and we're seeing what we would expect out of their adoption.\nRaimo Lenschow: Okay, fair enough. Thank you.\nOperator: Alright, thanks Raimo. We'll take our next question from Brad Zelnik with Deutsche Bank followed by Piper Sandler. Brad?\nBrad Zelnik: Thanks very much. Nice quarter and Congrats Steffan, we'll miss you at Confluent, but I couldn't think of a better, more capable successor than Rohan. So Congrats to you Rohan, really excited to see you in the new role. Jay, on stream processing. It's good to hear the encouraging early feedback and in particular around the integration points with the rest of your platform you talked about still being in the early stages of S curve adoption. I want to make sure nothing's changed in terms of the timeline and impact that you initially expected when you did the deal. And if you can remind us of any milestones we should look for in the years ahead to appraise your progress, with Flink?\nJay Kreps: Yes, yes. So yes, we are very pleased with the progress. To go from kind of a standing start to having you know a real like Cloud stream processing layer that customers can use is a big deal. It's currently in early access, meaning it's being used by a handful of customers, we're working with them, getting feedback. It'll go into you know kind of open availability and then GA and those are kind of the milestones to expect from us. In GA is when it will start to take on production workloads. But to be clear, you know with any cloud infrastructure there is a longer ramp as you kind of reach the full completion of feature sets are available across every cloud with every networking type that will continue. And then of course customers have to ramp their spend to the point where it moves Confluent’s numbers overall and that will happen use case at a time. And so, a certain amount of patience is important in these areas. This is what we saw with our Kafka business where at first it was a small thing in the cloud and then as we really hit that kind of the right point on that maturity curve, it ramped much faster. I think we can do that a little bit quicker with some of these additional components because they are a natural attached to Kafka, but there still is a curve that ramps and so, yes, to your question, we're exactly on the schedule that we originally intended which is kind of amazing for such a complicated software project. We're really pleased with how the team is integrated and I think the product we built is even better than I imagine. So I'm very excited about it, but yes, it will ramp you know over the course of next year and really kind of contribute most meaningfully in 25.\nBrad Zelnik: Thanks for that. And if I could just ask a follow up and something that I get asked about from investors. One of your smaller private competitors completed a Series C capital raise recently and I've just seen many markets where you have a venture backed player that can come, can enter and maybe more easily afford to operate at a loss and pressure price. Any thoughts or updates competitively and is this something that you worry about and that you face in the market? Thanks.\nJay Kreps: Yeah, you're probably talking about Red, Red Panda. Yes we pay attention to any of the earlier competitors. We've had a sequence of those almost since the company started, Pulsar was the thing for a while and then kind of went away. There's been other systems before that, so we pay attention to all of them. We compete very effectively with them even one of the customer stories today was actually a customer of theirs that was one of their reference customers that’s now customer of ours. And so, we feel good about that setup. Overall, if you look at what's happening in the space that we're in, there's two big trends that I think actually make it hard for really any competitor, but particularly a smaller competitor. The first is this movement to the cloud and the expectation on a true cloud native service, right, which is a really serious investment to build something like that. The second is the broadening of this space from kind of just Kafka to a full data streaming platform, like the full set of capabilities, kind of think of it as going from word versus word perfect to Microsoft Office, right? And you know if you look at those two trends, they're just very strongly prevalent in the world and they're actually hard for competitors to do, hard for some of the cloud players to do for a whole set of reasons, particularly hard for a smaller startup to do. You know I think we're actually lucky to be at the scale to be able to sustain the investment to do both of those things right and kind of drive that progress forward and I think it's exactly where this space is going and so that's the bet that we've got and I think that sets us up well against the full spectrum of the competitive landscape.\nBrad Zelnik: Excellent. Congrats all around. Thank you.\nOperator: Thanks, Brad. We'll take our next question from Rob Owens with Piper Sandler followed by Mizuho.\nRob Owens: Thanks, Shane and thanks guys for taking my question. Jay, appreciate the commentary around patience with regard to stream processing and budgets. But we're curious if you could provide color around early adoption, just how long it takes some of these companies to migrate existing operations over to your service as we think about potentially that adoption curve?\nJay Kreps: Yes. Yes, there there's kind of two patterns for adoption for US1 is. The net new use case of which there's plenty happening even in a tighter economy. You know, Kafka open source adoption continues at pace and many, many use cases for that are actually just coming and directly starting on our cloud. That will be true for Flink and some of these other components as well. And then the conversions and the conversion, you know, it depends, you know the kind of bigger the setup that a company has, the more complicated that is, but they often move it a bit at a time. And so you know, we don't have to kind of eat the apple all in one bite. And so yes, that that time frame depends there. There's companies that are very disciplined. That can move actually a very large setup, you know in a couple months even though there may be hundreds of applications, there's other you know, areas where that will take longer. It really depends on the setup with customers. The nice thing about these additional DSP components the rest of the data streaming platforms is it has a very strong attach to Kafka And so the initial adoption need not be you know, new customers coming from the streets. It need not even be new use cases. It can kind of drive direct attach off what you're doing already with Kafka. And so it kind of pulls in and starts with our existing customers and the nature of these consumption models. You know this is their biggest strength, right there's obviously a ton of complexity with consumption.  You know it's very friendly to the customers and customers like it especially in this kind of environment. But one of the superpowers that I think AWS really proved is that ability to expand in a low friction way to other components. And particularly in the streaming space where the core stream of data is the thing that everything else hooks on to, it's the thing you need governance for, it's the thing that connectors produce, it's the thing that the Flink is processing that kind of draws in those other components. And so that's the first target for us is get that attach rate with the existing customer base up before we're kind of going out and trying to convert existing Flink users.\nRob Owens: Great, thanks. And then for Steffan, I appreciate the commentary around where we're at in the economy and some of the challenges that are out there. But maybe you could speak to us just about top of funnel and what you guys are seeing from that perspective, from a velocity perspective? Thanks.\nSteffan Tomlinson: Sure, thanks. Our pipeline, we had a really strong pipeline quarter last quarter, which is a good leading indicator. And we also are measuring a number of sign-ups that we have for our pay-as-you-go business. And those continue to be robust. But as we've mentioned over the last three or four earnings calls, the progression of stages from top of funnel, all the way through committed contracts and then ultimately through expansion, et cetera. just some of that business has just slowed down, and we've been factoring that into how we not only forecast our business on the top line, but we've also been making operational changes around how we're investing in the business. And we come at this from the lens of ensuring that we're driving that top line growth as high as we can, but also delivering the profitability that we've communicated in the street, and we've been able to do that. So, the top of funnel metrics actually looked pretty good, but it's -- we're trying to increase the deal velocity and the conversion rates and those are the things that our team has been working on. And I think about it like what Erica and Stephanie and Jay and other folks in the organization are spending their time on it, it's the conversion rates, it's the deal velocity, and we're making progress there. And as I also mentioned in the prepared remarks, to the extent that the economy improves, we should benefit from that just like other companies would. But in the meantime, it's like we're navigating through and ensuring that we're delivering on our commitments.\nRob Owens: All right, thank you.\nSteffan Tomlinson: Thank you.\nShane Xie: All right. We take our next question from Gregg Moskowitz with Mizuho followed by Needham.\nGregg Moskowitz: All right. Thanks Shane, and Steffan we’ll certainly miss you being a part of Confluent, but congrats to Rohan on a very well deserved promotion. Jay, can you speak to the monetization opportunity for screen sharing, both in terms of landing more customers and driving more interconnect between organizations. How are you expecting that this is going to evolve?\nJay Kreps: Yes. That's probably the hardest one to forecast. What was shocking to me was how prevalent this pattern had become and how much work it was for customers to do it. So despite the fact they were doing a lot of this by hand with kind of custom code, they were writing, they- just across every industry that seems to be popping up. And that was what made us really feel strongly enough that we needed to invest in productizing it, even in a time period where we're operating relatively leanly. The opportunity is really to drive the spread. And so if you see what happens in a lot of these industries is there's a whole ecosystem of data flow. And once the mechanism for that gets set up, it really doesn't change and tends to drive any new entrant or provider or spire that taps into that to also adopt the same layer. And that kind of network effect, that's certainly something we would see within a company as we spin up and get to scale. At a certain point of time, you have to ask for permission not to use Confluent instead of two years Confluent. That's obviously a really good point to get to. Being able to do that within an industry or within a sector is even better because that can drive the acquisition of new customers. And that to me is the thing I'm most excited about, more so than the kind of direct monetization, which is obviously an opportunity as well but that ability to kind of become a standard for the exchange of data in different sectors and industries.\nGregg Moskowitz: All right. Makes a lot of sense, thanks Jay. And then a bit earlier in answer to another question, Steffan talked about some of the AI-oriented use cases that are occurring for Confluent. Along with this, are you also seeing an uptick in GenAI POCs is that something that's really building or is it a little too early for that yet?\nJay Kreps: Yes. Yes, we've definitely started to see that come up a lot more in our customers, kind of more traditional machine learning was there as one of the driving use cases for a long time. And now this has become a very significant topic of interest for customers, a lot of experiments happening. So yes, I think that's very promising for us.\nGregg Moskowitz: Perfect. Thank you very much.\nShane Xie: All right, we'll go to Mike Cikos with Needham next, followed by Bank of America.\nMichael Cikos: Hi, thanks to the team for getting me on here. And I'll pass on my comments, too, Steffan, we'll miss working with you, but congratulations to Rohan in stepping up to the CFO role here. Two questions, first, on the cloud guidance that we have today for Q3, I think in the prepared remarks, management alluded to maybe a smaller set of customers who drove some of that 2Q outperformance and that's why we're seeing the incremental revenue growth in Confluent Cloud declining in Q3 versus Q2. Again, the incremental growth it’s still growing, but it's at a lower pace versus what we saw in 2Q. So my question is really, can you help us think about the volume of those customers that drove that Q2 outperformance and anything else that you can allude to, whether it's a particular vertical or what a specific use case or maybe more onetime in scope that drove that sizable beat that we're looking at in Q2 here, just for context, when we think about how it's flowing through in Q3?\nJay Kreps: Yes. There was a set of customers that drove a portion of that we alluded to different events in each case, but yes, some streaming services that we’re kind of ramping up large sporting event in the Asia Pacific that was bringing stuff online. So there's a bunch of different factors that kind of led to a ramp-up that we didn't think necessarily made sense to project forward an alternative, but we thought it was a great uptick in the business.\nMichael Cikos: Got it, got it. And then one, if I could ask over to Steffan here. But on the guidance, for the negative 10% operating margin guidance that we have for Q3, the slight erosion versus what we just saw in Q2. And I'm just trying to sanity check that. Were there any delays in expenses that may be pushed from Q2 to Q3 or can you help us think through why we are looking at a wider operating loss when thinking about that margin in Q3 versus what we just saw out of the June quarter?\nSteffan Tomlinson: Yes. I mean there's -- what we're talking about is effectively roughly flat quarter-on-quarter and way better than what we had originally thought for in Q3. So what we have going on is there's some -- we look at the top line growth, we look at margin and we look at the key drivers as we construct the overall guidance. And there was nothing that was pulled forward or pushed out in Q2. We are just forecasting where our head counts is going to land, timing of head count, and so it's effectively flat quarter-on-quarter. And way better than what we thought at the beginning of the year relative to where we thought operating margin would be in Q3. And we also raised numbers for Q4 profit as well. So overall -- or for the full year, I should say, so we’ll always feel good about that.\nMichael Cikos: Great. Thank you very much guys.\nShane Xie: Thanks, Mike. We'll take our next question from Bradley Sills with Bank of America, followed by [indiscernible].\nBradley Sills: Wonderful. Thanks Shane. Congratulations Rohan, and Steffan, you'll be missed, I enjoyed working with you. I wanted to ask a question about the partner channel. It was a key theme at your Analyst Day so any progress there? Anything incremental here, seems like it's kind of a newer -- not a new focus, but an incremental focus, if you will, on some of the ISVs and SIs. So any update there, please?\nJay Kreps: Yes. That has been an area of investment and kind of increased focus for us maybe in the last six-nine months. And it's actually manifested in some pretty positive early signs a couple of ways. So, a couple of the SIs where we've seen really strong traction and we think if that continues, that can be a substantial tailwind over time. We've seen this actually reflected in the uptick in pipeline that Steffan called out, that was an area that was a little behind our expectations, maybe a year ago. It is now performing above plan now, which has been really a kind of strong turnaround in the area and so we were really happy to see. So yes, I think both of those are positive signs and of course, kind of key discussions in the technology landscape. We announced a program around the technology partners, and this is an area that I think it's particularly strategic, making sure that we have the integrations into all these different systems, either upstream or downstream that want to plug in, deliver streams of data out to everything else in an organization or pull it in and do some kind of analytics or AI or machine learning on top of it, that's a program that we've launched that has really seen strong demand, and I think is very exciting.\nBradley Sills: Wonderful. Thanks Jay. One more, if I may, please, when we think of the success you've had over the years, a lot of this is driven by need for real-time streaming in next-generation applications. But I know there's also a good mix of deals here that involve modernization of existing data platforms and providing that real-time capability to a lot of legacy applications. So, just curious, any observation there on that mix of deal activity coming from net new activity versus replacement and refresh modernization of existing infrastructure? Thank you.\nJay Kreps: Yes. There's -- that's exactly right, that our business has always been a mixture of connecting into the old and connecting into the new. And I actually think it's kind of one of the secrets of our success. When you think about a lot of new technologies, the message behind it is ultimately like, hey, if you delete all the things that you built over the years and rebuild it with us, it will be better, right? And the reality is it's just not that practical for a large organization that's running some major part of the economy on software they built over 30 years to delete it, rebuild it. And so the really cool thing about data streaming and complement is it's about how do you connect into all the old things, the mainframes and relational databases and on-premise systems. But then also how do you open that up and really create the backbone for the architecture that you want to have, the new applications, the new systems, the things that are driving customer interaction, and the things that are helping you run the business more effectively and that's kind of proven out. You would see that in our adoption, the kind of digital native customers repeated some of them. They're starting from scratch. There's no mainframe offload project there, this is the architecture that they want to have. But you would also see in our customers, these very traditional organizations that have been around for decades or more and have built up software estates over that time. And so yes, I think with a little pressure on the economy, you probably see somewhat fewer of the kind of net new applications. But in many ways, that’s kind of hook into the systems that you have, the push on modernization for the sake of efficiency becomes more important. And those are all use cases that be feed.\nBradley Sills: Great to hear. Thanks so much Jay.\nJay Kreps: Yes, thanks Brad.\nShane Xie: Thanks, Brad. I guess we'll take a last question from Sterling Auty with MoffettNathanson.\nBilly Fitzsimmons: This is Billy Fitzsimmons on for Sterling Auty. It was talked about in the prepared remarks that there's still some macro choppiness out there. Two questions and you can tackle them however you like. First, maybe expanding on some of the things that were already said, what changes have you made from a go-to-market standpoint over the last couple of quarters and adjusting to macro? And how has that impacted the pipeline and top funnel today? And then separately, when you look across your customer verticals and customers by geography, are there any material changes you've seen, either positive or negative in terms of consumption over the last quarter?\nJay Kreps: Yes. To the first question in terms of what changes have we made, it's probably too long of a list to go through. I mean, just in great detail, I think we went through virtually every aspect of the go-to-market and looked at, hey, what's the efficiency of marketing spend?, what are the customer targets that are most likely to convert?, what's holding up in this market? How are we presenting TCO analysis and showing the value of our offering? And how are we doing that not just for new deals? But for customers we already have to make sure that they feel very confident in the investment that they've made and that they're comfortable with future expansion. That list goes on and on and on. So that's been a very significant effort. I think, any kind of economic pressure shows in really clear relief where there's gaps. And in a way, that's good. It actually lets us improve and get better. To some extent, you're kind of learning to swim faster because you're swimming against the stream. And so I think that has been a healthy thing for the company versus an environment a few years back where there was a certain tailwind and all kinds of things worked that maybe shouldn't. Looking at sectors and parts of the economy we've seen, which is interesting, pretty strong trends in EMEA and APAC. That's been positive. One of the things we touched on in this call was our commercial business has done really well through this. They've had to adapt, they have a pretty strong chunk of the tech companies, both maybe kind of newly public, private, that are under pressure. And so they've really adjusted kind of how they serve that market, but they've continued to show success, which I think is really promising. So those are a few of the things that we've noticed. There's always some kind of shift industry to industry, but we're kind of very broadly across the industry. So most of that doesn't show up in something that we can move the business overall. But yes, those are a few of the highlights.\nBilly Fitzsimmons: Perfect. Thank you.\nShane Xie: All right. Thank you, everyone. That concludes today's earnings call. Thanks again for joining us. Have a good, everyone. Bye. Thank you.\nSteffan Tomlinson: Thank you.\nJay Kreps: Thanks, all."
  }
]