[
  {
    "symbol": "CFLT",
    "period": "Q2",
    "year": 2024,
    "date": "2024-07-31",
    "content": "Shane Xie: Hello, everyone. Welcome to the Confluent Second Quarter 2024 Earnings Conference Call. I'm Shane Xie from Investor Relations, and I'm joined by Jay Kreps, Co-Founder and CEO; and Rohan Sivaram, CFO. During today's call, management will make forward-looking statements regarding our business, operations, sales strategy, market and product positioning, financial performance and future prospects, including statements regarding our financial guidance for the fiscal third quarter of 2024, and fiscal year 2024. These forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from those anticipated by these statements. Further information on risk factors that could cause actual results to differ is included in our most recent Form 10-Q filed with the SEC. We assume no obligation to update these statements after today's call, except as required by law. Unless stated otherwise, certain financial measures used on today's call are expressed a non-GAAP basis, and all comparisons are made on a year-over-year basis. We use these non-GAAP financial measures internally to facilitate the analysis of our financial and business trends and for internal planning and forecasting purposes. These non-GAAP financial measures have limitations and should not be considered in isolation from or as a substitute for financial information prepared in accordance with GAAP. A reconciliation between these GAAP and non-GAAP financial measures is included in our earnings press release and supplemental financials, which can be found on our IR website at investors.confluent.io. And finally, once we've concluded our prepared remarks, we will post the Confluent earnings report to our IR website. And with that, I'll turn the call over to Jay.\nJay Kreps: Thanks, Shane. Good afternoon, everyone, and welcome to our second quarter earnings call. I'm pleased to report a solid second quarter, once again exceeding our revenue and margin guidance despite a continuing volatile macro environment. Subscription revenue grew 27% to $225 million, Confluent Cloud revenue grew 40% to $117 million, and non-GAAP operating margin was positive, representing approximately 10 percentage points of improvement. These results underscore the power of our data streaming platform and our relentless focus on delivering success for our customers. Today, I'll start with providing an update on our consumption transformation. Overall, the vast majority of rollout towards our transformation to becoming consumption-oriented is complete, a step change in how we run our Cloud business. One success indicator for our transformation is new logo growth. I'm pleased to share that we increased our total customer count by 320 in Q2, double from the previous quarter and representing our largest sequential increase in two years. In addition to landing a higher volume of customers, we believe we have increased the quality. A strong focus on our target accounts has increased the percentage of high propensity customer lands. Though this new consumption motion lands them earlier in their journey, we believe over time, many of these customers will represent the next wave of high consumption accounts for us. We remain as confident as ever in the strategic position of the company and the prospects for durable long-term growth. We have the industry-leading technology in an increasingly critical and relevant category that we believe will be as important databases. Over the past year, we've made a series of innovations to build out the full set of capabilities of a data streaming platform, enabling us to capture the full life cycle data in motion. And as we progress along our consumption transformation, we will be better equipped than ever to rapidly acquire new customers, win new workloads and fuel the adoption of our full set of product capabilities. Our rapid pace of innovation and ability to land high-quality customers who have the potential to consume more of our product leaves me more excited than ever about the long-term opportunity to capture the lion's share of the data streaming market. Vimeo, a leading SaaS video platform with over 260 million users, is a great example of a customer using our complete data streaming platform. Success for video platforms like Vimeo largely depend on delivering stellar user experiences, but traditional data warehousing and batch ETL processes limited their ability to see real-time customer usage, hindering timely decisions, quick pivots on products and campaigns and adaptive user experiences without buffering. So they tuned to Confluent to enable real-time data flows that provided the visibility they lacked. Fully managed connectors to Snowflake, S3 and others make it easy to instantly connect data through their business without the hassle of building and self-managing connectors. Stream Governance ensures data quality and security and allows Vimeo to safely scale and share data streams. And the team is looking towards Flink to enhance their streaming use cases while freeing up bandwidth across the team. With Confluent and real-time data flows, Vimeo can make quick decisions and deliver top quality personalized experiences that drive growth and profitability. Next, I'd like to discuss the critical role our partners play in our business and some exciting announcements in this area. Partners are essential to our strategy to expand our reach into new markets, improve sales efficiency and complement our data streaming platform. We're pleased to share a number of notable achievements and milestones across all three pillars of our partner ecosystem. In Q2, we announced Build with Confluent and Accelerate with Confluent, which makes it easier for our global SI partners like KPMG, Accenture and EY to build specialized offerings as they embed data streaming into their core business. A wide range of use cases have already been established through the Build with Confluent program, including a gen AI bot for airline customer support, fraud detection against AI-powered voice phishing, automated limit increases for credit card users and real-time telemetry analysis for freight optimization. We're also seeing great traction with Connect Confluent, a technology partner program that makes it easier for partners to build data integrations with Confluent Cloud. In Q2, we crossed more than 40 technology and partner built integrations, including SAP, MongoDB, Imply and services at Google Cloud and AWS, giving us coverage across the major segments of the modern data and AI stack to help us drive consumption of Confluent. The success of Connect with Confluent has tripled the amount of data traffic from our partner integration since the start of the year. And finally, on the CSP front, we were pleased to be recognized as Partners of the Year by both Google and Microsoft. This marks the third year in a row that Confluent won this award from Microsoft and the fifth year that we've been recognized by Google. Together, these recognitions underscore our highly valuable and symbiotic relationship with our cloud partners. As we discussed last quarter, data streaming plays a critical role in fueling gen AI applications with contextual and trustworthy streams of real-time data. This was underscored by our 2024 data streaming report. 90% of the 4,000-plus IT leaders we surveyed said data streaming platforms can lead to more product and service innovation in AI and ML development, with 63% saying data streaming platforms significantly fuel AI progress by building a real-time data foundation. I'm pleased to share couple of examples of this. A top five mortgage lender in the United States is turning to Confluent and gen AI to reimagine home buying experience. This company uses generative AI to listen to client calls, transcribe them, analyze sentiment and record client patterns and preferences to create personalized experiences for millions of customers and prospects. They turn to Confluent as a key part of their RAG-enabled architecture to quickly build and scale gen AI use cases by tapping into readily usable trustworthy data streams. Connectors allow them to connect data and systems from across lines of business, while Stream Governance and Stream Processing enabled the team to create reusable data products that are easy to find, understand and use. As a result of their gen AI initiatives, approximately 70% of servicing calls can be fully self-served without the need for full team member intervention. By saving the client servicing team 40,000 hours annually, team members can concentrate on cultivating strong, meaningful client relationships, while AI manages the mundane tasks. But this is just the start. In the future, their gen AI platform will earn homeowners' preferences and communication habits, so that team members can anticipate and solve clients' needs. An international e-commerce company in n Germany with €16 billion annual sales is another example of companies turning to Confluent to play a key role in their Gen AI stack. When e-commerce products from this company's iconic brands are promoted, their call centers received massive spikes in call volume. But with only 100 call center reps, customers are often left in long wait queues, leading to failed convergence and unhappy customers. So they turn to Confluent to help power Gen AI applications like voice bots that can scale up in seconds and answer 1,000 calls in parallel. As customers interact with these voice bots, an AI order entry bot enables the order completion process and communicates with ERP systems in real time via Confluent, streaming transactional data such as product, order, customer, payment and billing information. A key part of this workflow is Confluent's streaming KPIs from bots in the operational domain to their analytical systems, capturing data like real-time orders, call metrics, sentiment analysis, and how many AI tokens were used to analyze and measure the efficacy of calls to continuously make their bots smarter and more effective. Powered by enriched trusted data streams from Confluent, this e-commerce company can now handle unexpected traffic spikes to increase call center capacity on demand to reduce customer wait times and improve order completion rate. In closing, we're excited about the trajectory we're on. With our complete data streaming platform and our transition to a consumption-oriented business, we’re well positioned to attract more customers who can drive even more value from Confluent, as they capture the full life cycle of streaming data from our platform. The future of Confluent is incredibly bright. With that, I'll turn it over to Rohan.\nRohan Sivaram: Thanks, Jay. Good afternoon, everyone. In Q2, we delivered solid subscription revenue growth and substantial margin expansions, ending the quarter with positive non-GAAP operating margin and free cash flow margin. These results, coupled with continued adoption of our data streaming platform, demonstrate our relentless focus on driving long-term efficient growth in a volatile macro environment. Turning to the Q2 results. Subscription revenue grew 27% to $224.7 million, exceeding the high end of our guidance and representing 96% of total revenue. Confluent Platform revenue growth accelerated to 16%, ending the quarter at $107.3 million and accounting for 48% of subscription revenue. We closed two 8-figure multiyear deals consisting of renewal and expansion with existing customers in the financial services industry. This underscores Confluent as the platform of choice for data streaming among the world's most established enterprises. Confluent Cloud revenue grew 40% to $117.4 million and accounted for 52% of subscription revenue compared to 47% in the year ago quarter. We are pleased with delivering high growth at scale and continuing to improve the margin profile for our cloud business. Turning to the geographic mix of total revenue. Revenue from the US grew 26% to $143.2 million. Revenue from outside the US grew 22% to $91.7 million. Moving on to rest of the income statement. I'll be referring to non-GAAP results, unless stated otherwise. Subscription gross margin was 80.8%, up 170 basis points. Gross margin performance was driven by strong Confluent platform and improving unit economics of our Confluent Cloud offering. Turning to profitability and cash flow. Operating margin expanded 9.7 percentage points to 0.6%, representing our eighth consecutive quarter of 9 points or more in margin improvement. Operating margin performance was driven by our gross margin performance and our continued focus on driving efficient growth across the company. Net income per share was $0.06 for Q2 using 354.2 million diluted weighted average shares outstanding. Fully diluted share count under the treasury stock method was approximately 362.9 million. Free cash flow margin turned positive and improved approximately 20 percentage points to 1.2% and we ended second quarter with $1.93 billion in cash, cash equivalents, and marketable securities. Turning now to other business metrics. Total customer count was approximately 5,440, up 320 customers sequentially, our largest sequential growth in growth in two years. We are pleased with accelerating total customer count and the quality of customers we have acquired. Additionally, we added 46 customers with 100,000 plus in ARR and nine customers in 1 million plus in ARR, bringing the total to 1,306 and 177, respectively. Our 100,000-plus ARR customers continue to contribute greater than 85% of our revenue. Our new $1 million-plus ARR customers include customers from a variety of industries, including energy, financial services, manufacturing, retail, transportation and more. Turning to NRR. Q2 NRR was 118%, below our target range of 120% to 125% for this year. This was due to continuing consumption volatility within our large digital-native customer base. After the stabilization in Q1 and a healthy start in Q2, we saw increased short-term cloud cost controls and focus on driving efficiencies in this customer cohort in the month of June, which impacted expansion of new use cases. While the green shoots we saw earlier this year haven't yet translated to the level of consumption we had expected, we are pleased to see continued strength in our gross retention rate. GRR remained above 90% at a level consistent with the last two quarters, reflecting the sticky nature of our data streaming platform and our continued focus on delivering strong value and ROI to our customers. As we frame our guidance for the second half of 2024, there are two points I would like to call out before getting into the numbers. First, growth of our Confluent Platform business remains lumpy, driven by the timing of large renewal and expansion deals. As a reminder, approximately 20% of our Confluent Platform TCV is recognized as upfront license revenue. This could create short-term variability for growth in Confluent Platform. Q2 was a good example where we benefited from this dynamic, which creates a tough compare for growth for rest of 2024. Second, consumption in our digital-native customer base remains volatile. As mentioned, while the green shoots we saw over the last few months continue to take hold, they have not yet translated to the level of consumption we had expected. We have incorporated this consumption dynamic from our large digital-native customers into our second half outlook. Now, let's turn to guidance. For the third quarter of 2024, we expect subscription revenue to be in the range of $233 million to $234 million, representing growth of approximately 23% to 24%; non-GAAP operating margin to break even, representing improvement of approximately 5 percentage points; and non-GAAP net income per diluted share to be $0.05. For the full year 2024, we expect subscription revenue to be approximately $910 million, representing growth of approximately 25%; non-GAAP operating margin to breakeven, representing improvement of approximately seven percentage points, non-GAAP net income per diluted share to be $0.20; and free cash flow margin to break even, representing improvement of approximately 16 percentage points. Looking out longer term, we remain well-positioned to address our market opportunity. As Jay pointed out earlier, we're going after a highly strategic and mission-critical data streaming market, which we believe will be as important as databases. Over the last few decades, history in software has repeated itself many times that platform approach wins. Our industry-leading data streaming platform is the only complete platform spanning stream, connect, process and govern, enabling us to capture the full life cycle of data in motion at a lower TCO and delivering strong ROI to our customers. In Q2, we saw continued adoption of our data streaming platform. Connect, process and govern of our DSP portfolio accounted for a larger portion of cloud revenue and grew substantially faster than our overall cloud business. Multi-product customers remained our fastest-growing customer cohort with NRR substantially higher than 130%. We believe DSP will continue to outgrow our core business for the foreseeable future. And as it continues to scale, DSP is expected to be a strong growth tailwind to our business over a long period of time. Additionally, the rise of GenAI makes it clear that a modern organization success is significantly influenced by its data strategy, particularly around data and motion. With a complete cloud native and ubiquitous platform and secular tailwinds for data in motion, we have never been more confident in our ability to sustain durable and efficient growth over the long-term. In closing, we are pleased with our solid second quarter results. As we continue to execute on our consumption transformation, we remain focused on driving efficient growth and delivering breakeven for non-GAAP operating margin and free cash flow margin for 2024. Now Jay and I will take your questions.\nA - Shane Xie: Thanks, Rohan. To join the Q&A, please raise your hand. And today, we will take our first question from Matt Hedberg with RBC, followed by Morgan Stanley.\nMatt Hedberg: Great. Thanks for taking my question. Guys, I'm in the airport. So hopefully the background noise is okay. Jay, I noticed the strong customer logo adds stood out to me. I think you noted in your prepared remarks, the quality was also higher. I guess, does that imply that you could see faster expansion from this cohort as they continue to advance with the platform?\nJay Kreps: Yeah, over time. So one of the measures we -- first of all, I would say, as we undertook this consumption transformation, one of our key goals was to accelerate customer acquisition. So that's played out as we desired. The second thing that we were aiming for was a little more targeted in which customers we're landing in. And so we built a model to try to predict the opportunity in these customers and tagged a set of accounts we felt were high propensity. So the measure we use internally is what percentage of these new customer lands are in that high propensity segment. And so obviously, it's on us to go drive the growth in the accounts. But one of the things we think is promising is that that percentage has gone up substantially when we look at the first half of this year versus last year in the customers we're landing in.\nMatt Hedberg: Got it. Thank you. And then maybe one for you, Rohan. You noted some of the NRR pressure and the potential for lumpy Confluent Platform business in the second half. It seems like that's contemplated in your guidance. I guess, I'm curious, after you saw -- it sounds like a little bit of slowness in June. How do things trend in July? I mean have you seen things kind of stabilized a bit? Or just maybe a little bit more on the linearity on the cloud side. Thanks.\nRohan Sivaram: Yeah. Thanks for your question, Matt. Yeah. I mean, from an overall guidance perspective, as you rightly pointed out, we've considered two factors: our Confluent Platform business tends to be lumpy, primarily because of how the rev rec is and the timing of some of the larger deals. So that's incorporated in the guide. And the second 1 that you mentioned was around the digital native customers. So for digital native customers, Q1, we saw stabilization. And as we entered Q2, we did see a continuation of that stabilization. However, I would say towards the latter half of the quarter, we did see cost efficiencies and focus on just driving some cost efficiencies from some of these customers, which actually continued into the month of July. So as we think of the back half of the year, we think taking a thoughtful and prudent approach to guidance would be the right thing to do.\nMatt Hedberg: Thanks a lot guys.\nShane Xie: Thanks, Matt. We'll take our next question from Sanjit Singh with Morgan Stanley, followed by Barclays.\nSanjit Singh: Thank you for the taking the question. I want to turn back to the sort of go-to-market transformation. I think there was an approach to utilize similar sales motions like MongoDB, who've done monitoring cloud sales. One of the things that they have been seeing is that as they try and incent for more volume and higher volumes of workloads, the quality 12 months down the road wasn't what they expected. I was wondering, Jay -- I'm happy to see the new customer logos really accelerate. But if you look at it on a workload basis, how are you guys thinking about ensuring quality of the workloads and not just seeing that increased volume?\nJay Kreps: Yeah. That's obviously on us to ensure that we're kind of getting the growth and expansion out of this customer set. The first indication is just are we getting into the right customer. So I think that, we've seen. As we think about over the course of this year, we want to see those grow. Part of our objective was definitely to get into customers earlier in the life cycle, earlier in the development life cycle where they're actually setting up the architecture where they can use more of our DSP in the first application they're planning. I think that's been successful, and that's allowed us to take up the volume of customers. But yes, really showing how those play out and spill into the $100,000-plus, $1 million-plus, that will happen over time.\nSanjit Singh: Great. And then just as a follow-up. How are you guys thinking about when look at the pieces of a real time on data infrastructure, I think OpenAI bought what's called like a real-time database. And you guys have sort of talked about the streaming platform, the stream processing platform. Where does the real-time database sort of fit in? And is that that something another service offering that Confluent may get involved with over time?\nJay Kreps: Yes. We actually partner very closely with a number of providers similar functionality. So I think Rockset was the company that OpenAI announced having bought. There's probably half a dozen to a dozen companies in that segment where they're taking streams of data and serving different types of queries against those streams. And that's a great set of partners for us. And we work with them around a whole set of applications, including some in the Gen AI space, use cases around search, use cases use cases around real-time analytics, around aggregating and storing other key information sets that power workloads. So there's definitely kind of a nice integration there between some the real-time databases or streaming databases and the rest of the streaming platform.\nShane Xie: Thanks, Sanjit. We'll take our next question from Raimo Lenschow with Barclays, followed by Deutsche.\nRaimo Lenschow : Hey, thank you. Two very quick questions. First, you had a bit of a change in the sales leadership. And I wanted to see if you could give us some additional comments there? And then Jay, on Flink as well, we kind of have it in the market for a few months now, and you kind of mentioned some of that on the call, but like -- what's your experience and so far in terms of adoption, what people are using for versus what you expected on the usage side? Thank you.\nJay Kreps : Yes. Both good questions. So yes, we did have one departure on the sales side. The structure of our team is the larger field effort, the reps, technical folks, BD folks, consulting, who's all under Erica Schultz. So she's kind of at the top of the sales organization and reports to me. She remains in charge of that, and she has been at Confluent for over four years. So there's a fair amount of continuity. Under her, the managers, management structure the reps just kind of bounced back and forth between something where she manages the individual theater leaders like APAC or EMEA directly. Or as somebody who manages that set of theater leaders. And so we did make a change in that structure. I won't comment on the departure in detail, but we're not planning on immediately backfilling it. We're comfortable with the arrangement we've had. And that's worked well for us in the past, and we feel good about that in the near term. On Flink, yes, it continues to go well. This is a time of excitement from our customers. I think last quarter, we said on the order of around 600 prospects and customers that tried it out. That's up to over 1,000 now. We're starting to see really nice growth in the revenue from that. But of course, it's still early days, small numbers. What we want to see is see that ramp to a larger percentage of the business, see more the kind of large-scale production use cases come online. That's what we're looking for over course of this year. And if we're successful in that, that will be a very positive tailwind for the business overall as it gets to a larger portion of the business heading into next year.\nRaimo Lenschow : Okay. Perfect. Thank you.\nShane Xie: Thanks, Raimo. We'll take our question from Brad Zelnick with Deutsche, followed by William Blair.\nBrad Zelnick: Thanks very much, Shane. And great to see the progress in new logo and the path to profitability. Rohan, you characterize digital native customers as volatile. What's the behavior that you're seeing specifically? Are they down selling? Or are they churning? And is this more cloud or Confluent platform? How much of a risk is this going forward and the extent to which you're embedding in the guide?\nRohan Sivaram: Yes. Thanks for the question, Brad. I mean, when you look at the digital native segment and customers and if you zoom out look at it over a longer period of time, the growth has been linear. And our growth has been upward, but not linear. So over a period of time, the segment, we've seen good growth, and the growth rates have been higher than the rate of company. But when you really look at the last 12-odd months, this segment has been under some kind of cost efficiency pressure. And you do see every now and then customers just focusing on the cost side of it and then adding more workloads. So that is a trend that we've seen. But the big takeaway from my perspective is if you step back and look at it over a longer period of time, this segment has been actually a good grower for us. And that's a long-term outlook. But as you think about how we saw the month of June, we thought it's just prudent to bake it into our second half outlook as we look ahead.\nJay Kreps : Yes, I think that's a good characterization. I mean, when we step back and think about the digital-native segment, overall, we remain very optimistic that that's an area that's grown for us very nicely over the last few years, and we think we'll continue that way. But as Rohan said, yes, there is probably more cost pressure there, and that does mean that if we look at Q1 to Q2, we did see different performance in that segment between those two quarters where we saw outsized growth in Q1 and a little bit more optimization in Q2. And I think that's kind of the of the balance those two forces. We expect that to play out in second half of the year as well.\nBrad Zelnick: Thanks Jay. And maybe just a quick follow-up for you. I see you have a number of open job recs for AEs in the U.S. Federal market. Can you just remind us of where you stand in that in that market? And if you see upside this Q3 could come from federal? Or is this more of a 2025 opportunity? Thanks.\nJay Kreps: Yes. Yes. By and large, open sales hires in the federal space that we're making in this next quarter would impact next year. But indeed, there's a very talented team that covers the sector in the U.S. and elsewhere. And it's a good contributor to the business. So, yes, we're adding that team, and we do think that's an area where we will see growth.\nBrad Zelnick: Cool. Thanks and keep up the good work, guys.\nShane Xie: Thanks. We'll take our next question from Jason Ader with William Blair, followed by TD Cowen.\nJason Ader: Yes, thanks Shane. Good afternoon everyone. I just want to ask about go-to-market. It seems like it's been a bit of an evolution over the last several years, and you guys are still kind of figuring it out. Beyond the change to consumption and the management structure that you alluded to, what else would you call out that you've learned that could help move the needle on your go-to-market motion and where the best bang for the buck investments are going forward?\nJay Kreps: Yes, it's a good question. If I think about the first half of this year, it was mostly that shift to consumption. It's kind of rebuilding what you had on a new foundation around a different set metrics, oriented on something new. If I think about the balance of year and beyond, it's really taking advantage of that structure. I do think that's the right setup for type of cloud infrastructure company that we are. If you look at both peer companies and what the cloud providers have done over time to drive growth of workload, it really hinges around that. And so I feel good about the progress we've made and some of the early results from that. But I think it's even more exciting when we think about how we can use that to drive the adoption of these expansion product areas and the expansion of new workloads in the customer base.\nJason Ader: And then just a quick follow-up. On the consumption transition you talked about, I think you said smaller lands, Jay, is that right?\nJay Kreps: Yes. Yes, if I think about what we've shown, we've kind of taken up the volume of lands, but we will be catching these kind of earlier in the build cycle. We think that's largely good, but it does mean in that first quarter, the contribution from a given customer will be smaller than it was in the past, just because we're earlier in that project lifecycle.\nJason Ader: Thank you.\nShane Xie: Thanks, Jason. We'll take our next question from Derrick Wood with TD Cowen, followed by D.A. Davidson.\nDerrick Wood: Great. Thanks. Jay, in terms of the new motions of cross-selling DSP to the base, can you talk about what parts of that portfolio are seeing the strongest uptake when you look at governance, connectors, processors? Is there anything you'd highlight getting more traction? And when you sell into a core customer, what's often the ASP uplift when you cross-sell one of those components?\nJay Kreps: Yes. Yes, it's a good question. Yes, I would think of each of those products as being in a kind of S-curve, where it's on some ramp. The earliest of those was our connector ecosystem where we continue to make improvements and drive growth with it. We think there's a lot of opportunity there. The governance portfolio was next, and Flink is the newest addition to that. And so I think there's interest and traction around all three, but Connect is the bigger business out of those three just because it started earlier. When we think about kind of percentage growth, course, you see the highest percentage off Flink because it's starting from the small space. And so we want to continue to ramp all three of those, but we expect the attach from those components to increase quite substantially in the year ahead as we open that up to more customers. What drives that is, in part, maturity of the product, a lot of the security, private networking functionality, other things that are important for our largest revenue customers to use those components are either just added or just being added over the course of this year, and that really opens up a lot more of the large-scale production usage to the rest of our customer base and so that's a critical focus for us when we think about the balance of the year.\nDerrick Wood: Helpful color.\nJay Kreps: Yeah, we haven't given an exact kind of uplift number. We shared a little bit of kind of sketch of the shape that business so far. I think, to be honest, I think it's still early days as these components ramp, even a customer that's adopted connectors. There's more of them they can use. Even if they have their first few Flink queries, we would like to take over a substantial portion of their applications in the stream processing layer. And so I wouldn't think of that as a dynamic uplift of like, oh, you'll see x-percent and it's binary, either on or off. I would see this is kind of unlocking an adoption cycle that drives growth not just in core Kafka, but now in these components as well, which will themselves produce more growth in the underlying Kafka usage.\nDerrick Wood: Yeah. That makes a lot of sense. Thanks. Rohan, for you. Last quarter, I think you highlighted targets of getting to 125% NRR next year. Given that NRR dropped below 120% and you're seeing some different behavior, how does this kind of change your view on where you think can get to in fiscal 2025 on NRR?\nRohan Sivaram: Yeah. Derrick, I mean when I really look at the medium-term, as Jay highlighted right now, the outlook has not changed at all. I'll basically talk about three things. First, data streaming platform. And as Jay just pointed out, the products within our data streaming platform, be it connect, stream processing or Flink or governance, they are all early stages of adoption. And 2025 is going to be the year where there is going to be monetization and material contribution to revenue. The second is around consumption transformation. By the time we finish the year, we'll have completed a full year of the transformation and a full year of fine-tuning our go-to-market all things consumption. So we expect to get a tailwind from that. And the third category is GenAI. We've been talking to customers and Jay highlighted also in his prepared remarks, real-time data is going to be a key component and key part of this broader ecosystem. So when you really take a step back and look at some of these drivers and vectors of growth, our view around NRR getting back to our medium-term targets has not changed.\nDerrick Wood: Thank you for the color.\nShane Xie: Thanks, Derrick. We'll take our next question from Rudy Kessinger with D.A. Davidson, followed by Wolfe Research.\nRudy Kessinger: Hey guys, can you hear me okay? I'm having a connectivity issue.\nJay Kreps: Yeah, loud and clear.\nRudy Kessinger: Okay, great. I'm curious on international. The growth hasn't actually slowed there quite [indiscernible] relative to U.S. growth. And in some of the sales attrition, I've seen it -- seems like it's been more weighted towards folks in Australia, APAC more so than the U.S. relative to revenue split. So any color you can provide there just on some of the slowdown in international?\nJay Kreps : Yes, do you want to speak to that, Rohan?\nRohan Sivaram: Yes, happy to. Rudy, candidly, not a whole lot read into it. When you see the relative, I would say, difference in growth rates between international and U.S., more often than not, the driver is timing of some of these larger Confluent platform deals. And I mean, Q2 was exactly the same. We called out two large 8-figure deals. Both of the deals were in North America and hence, the delta, I would say, a relative difference in the growth rates. So, not a whole lot to call out. On the sales attrition, I'd say, again, no specific trends that we'd like to call out. Just two prop comments I'll make on that front. First is, as we kind of went through the consumption transformation, obviously, as we stand right now reflecting back, we feel really good with the overall sales capacity we have on board. The first half of the year, we've had strong hiring from a sales organization perspective. And that just sets us well as we look ahead for rest of the year, I'd say we have right capacity in place to deliver on our forecast.\nRudy Kessinger : Okay. And then secondly, just on the model. I know you guys are guiding to just total subscription revenue. It sounds like platform base is probably tough comparing second half versus first half maybe down a bit in Q3. Do I have that right? And secondly, on cloud revenue, just any directional color you can give on the sequential expectations in cloud? It sounds like it may be some of the headwinds in June and July, maybe the sequential add in Q3 is a bit lower than Q2?\nJay Kreps : Yes, you want to take.\nRohan Sivaram: I lost you a little bit on the first part of your question, but I'll answer it. If it's not covered, let me know, right? Well, when we look at the second half guidance, I'll say I called out two drivers. The first is around Confluent Platform. And in general, when you have these large deals, the timing of these deals matter. And the timing of these deals, not only from a renewal perspective, but also from an expansion perspective. Renewals tend to be a lot more predictable than the expansions. And hence, my comment around the second half with respect to platform. On Confluent Cloud side, again, what we are essentially modeling out is, we're thinking that at the dynamics that we saw in the digital native customer segment will kind of continue into the second half. So, yes, starting this quarter, we've obviously stopped guiding total revenue and the focus will be on subscription revenue. But just to help with the transition from an overall modeling point perspective, we expect cloud mix for the full year as a percentage of total subscription revenue to be approximately 53%, in that ZIP code. And that's very consistent with the mix that I shared earlier in year. So not a whole lot has changed, but I just wanted to provide that color as you think about the second half, Rudy.\nRudy Kessinger : Yes. That's helpful. You've hit on the both parts. Thank you.\nShane Xie: Thanks, Rudy. We'll take our next question from Alex Zukin with Wolfe Research, followed by Guggenheim.\nAlex Zukin: Hey, guys. Thanks for taking the question. It's great to be on with you. I guess, maybe just on the first one, on the digital natives, if you can kind of dig in a little bit there on maybe -- did you see was the moderation in consumption or some of the, I would say, modulation of the green shoots. Was that tied to a particular vertical, a particular geography? We talked -- we heard Microsoft last night talk about how some consumption trends were less than they expected in Europe. So just curious if you could maybe categorize where some of those modulations came from?\nJay Kreps: Yeah, there may be some geographical effect. I don't think that's the main thing. We actually saw this primarily in the larger set of digital native customers globally. So US, EMEA, et cetera. And what is it they're doing? It's not the case that they're cutting projects. It's not the case that they're switching to competitors or there's any kind of customer loss in that segment. It really was about optimizing their use of the underlying infrastructure. And so in a lot of these customers, they have a built-out team that's FinOps or something like that that's kind of scrutinizing costs and working with infrastructure teams to figure out, hey, can we consolidate clusters across teams? Can we compress data more? What can we do to squeeze a little bit more juice out of each dollar of cloud spend is not unique to Confluent, but we did see a little bit more of that activity. Any quarter in that segment is a balance of that kind of optimization and expansion. We think about last quarter, the balance was definitely on the expansion side this quarter, a little bit more on the optimization side. That means when we think about rest of the year, could play out either way, but we're factoring in more risk when we think about what we'll get out of that segment.\nAlex Zukin: Makes some sense. And then maybe the second one, super helpful, by the way, help on the cloud revenue component for the second half. But maybe like given the fact that you're signing more customers that you're landing maybe a little bit smaller initially, you've got these -- a number of product vectors starting to gain traction with Flink and a few others. And then presumably, some of these GenAI use cases ramping, is there the possibility that even though the second half implied guidance for subscription, for cloud, there is a bit of deceleration in that guide to account for the conservatism. How do we think about sequencing of those tailwinds to maybe drive reacceleration? Again, I'll point to Microsoft, who told us second half of their fiscal year, they're going to see Azure reaccelerate.\nJay Kreps: Yeah, I mean, obviously, we've kind of given the guidance for this year. It would be, I think, early to start describing next year. But just broadly or qualitatively, as we add into that, yes, we feel like there's substantial tailwinds and all the things you just mentioned. I think we'll start to contribute more materially and that's definitely a positive factor for us. And then when we just talk to customers, I think this is an area they continue to really bet on and invest in and that's increasingly for these larger customers becoming a very substantive part of their overall data infrastructure. So I think, yeah, that gives us a lot of confidence heading into next year about what the trajectory is.\nAlex Zukin: Okay. Thank you guys.\nShane Xie: Thanks, Alex. We'll take our next question from Kash Rangan with Goldman Sachs, followed by JPMorgan.\nKash Rangan: Thank you guys. So Jay, the motivation behind the transition to consumption was to ultimately get better growth rate acceleration, which was the right thing do. So as you are halfway through the mark of the year, what are the things that you've uncovered as unlocks, what are the things that are working, things that still need work? Because when you look at the -- fit were to accelerate, which I think is definitely the goal of the company and certainly the right thing, we should be starting to see some leading indicators get better. And maybe it's not the right way to look at the subscription revenue growth or the cloud revenue growth, which have been slowing down a bit, right? Maybe due to a whole host of all reasons. While your lands are certainly very impressive. So what needs to happen more for the transition to unlock the real growth potential of the company, which is the acceleration that you have planned for some time in calendar 2025? And I have a follow-up question. Thank you so much.\nJay Kreps: Yeah. Yeah. I mean obviously, when we look at the performance any year, there's a number of factors in play, including just the fact that we're changing a lot of things in the go-to-market. The first step is kind of get back to where you were in the new system. And I feel like, hey, we've kind of done that. It doesn't mean that everything is dramatically better, but it means we're now oriented around consumption, tracking each of the individual workloads in each customer, tracking the actual spend by component and the opportunities around that, which is what will drive DSP growth. So that's a good foundation to build on. So what is it that we need to do? We need to really harness that and lean into it as the driver of growth. And I think that will be a positive tailwind for us as we kind of head into next year. As well all the customers we've landed. The nice thing is, hey, as we think about halfway into this year, we actually have a much broader base to grow out of in terms of new lands and provided we're able to continue that throughout the second half of the year. Heading into next year, that's kind of a cohort to drive growth that will be kind of coming towards the more production maturity, additional use cases, et cetera, and that will be a challenge.\nKash Rangan: And one for Rohan. So as you have the net expansion rates. I mean, certainly, they came down a bit. But broadly speaking, they're still okay relative to the overall growth rate of the company. Does it mean that you could get more profitability because generating growth within the base is less costly, less time consuming than going for growth outside? Or are there other puts and takes that offset that consideration, netting out on where you stand in terms of profitability and good net expansion as a driver of better profitability?\nRohan Sivaram: Yeah. I mean, Kash, thanks for your question. Higher net expansion rates and net retention rates are obviously a driver of leverage over a long period of time. So there's no question about it. But when I really -- I'll probably take the question in two lenses. First, when you double click into net retention in addition to the current trends that you see, we spoke about data streaming platform. And for customers that are using multiproducts for us, then net retention rates are well above 130%. So as you think about the next wave of growth, next vector of growth, that's going to be a tailwind to net retention rates. So that's one piece of piece of it. The second it, around the margin side. I mean, when we think about our resource allocation philosophy, it is always making sure you get the right balance between growth and profitability and you're driving efficient over a long period of time. And that's our goal. Given the opportunities that we have in 2025 and beyond with respect to the new growth vectors, we're being prudent about it. When you look at the second half, we'll be adding the right amount of capacity in engineering, in sales and marketing to make sure we are ready, and we are in the right position from an overall capacity perspective as we embark on next year. I mean, most of the hiring we're going to do between now and end of the year is going to benefit us next year. And I'll finish up by saying our medium-term goals from an operating margin perspective, which is in the ZIP code of 5% to 10%, continues to be the same. And we're going to manage that proactively by balancing both growth and profitability.\nKash Rangan: Thanks so much.\nShane Xie: Thank you. We'll take our next question from Pinjalim Bora with JPMorgan, followed by Oppenheimer.\nPinjalim Bora: Great. Hey, guys. Thank you for taking the question. One question for you, I'll just blurt both of them out. On the Flink market, as you try to kind of execute towards capturing the Flink opportunity, how does the maturity in kind of the understanding the use cases compare to that of the coal market? I'm trying to understand if you're finding customers that have well-defined Flink use cases and there's a pent-up demand versus the use cases are not as defined that of the core Kafka market, and there's a little bit of evangelization that maybe needs to happen. That's the first question. And second question, how big is the digital native segment for you? Thank you.\nJay Kreps: Yes. I would think about Flink as being maybe as an open source project, call it, maybe three years behind Kafka, broadly. And so in terms of maturity, that's probably where it is. Does that mean customers have use cases or don't use cases? Well, it depends on the customer, right? Typically, the way these technologies progress is from more technologically sophisticated companies to less technologically sophisticated companies. And so in maybe some of the banks, digital native companies, they would have pretty mature Flink practices, maybe not as large scale as their Kafka usage, but certainly up and running. You get out further into mainstream enterprise, you'd see some of that, but maybe less, right? And so I would think about that as being kind of the vector diffusion and very similar to Kafka usage. I think it follows a very similar pattern, but several years earlier in that flow. For us, I think the project is a lot easier than the initial Kafka land. If you think about what we had to do getting into these new accounts with a cloud offering, especially early on, a lot of these customers did not have a lot of cloud products for infrastructure outside of the cloud provider. So that kind of initial land was definitely the harder lift. As you think about, okay, great, now they've got these streams of data expansion to things that use the stream data, I think it's definitely easier than kind of getting Kafka in the first time. And I think that's a positive for us for getting that product to ramp quickly. And so we think that's a positive thing. And remind me of the second question you had?\nPinjalim Bora: Just the size of digital natives for...\nJay Kreps: Yes. Yes, we haven't broken that out. If we think about the business overall, it's not the largest kind of vertical. It's not even that that well-defined kind of broadly in the industry, but we have a definition internally we tag accounts with. So it's not the largest vertical for us, but it is sizable.\nPinjalim Bora: Thank you.\nShane Xie: Thank you. We'll take our next question from Ittai Kidron with Oppenheimer, followed by Mizuho.\nIttai Kidron: Thanks, Shane. Rohan, first question to you. Can you tell me what percent of your platform revenue is associated with cloud customers as well? I'm just trying to think because if there's a significant overlap there, we think that over time, the lumpiness -- inherent lumpiness in platform would fade. So we'll love to get color on that.\nRohan Sivaram: Yes, that's a great question. Well, we've not broken that out, but what I can tell you is there is increasing set of customers who are using both Platform and Confluent Cloud. And a couple of quarters back, we've been kind also providing updates that when customers have both Cloud and Platform, they tend to be more sticky and their NRRs are higher than the company average NRRs as well. So that's one piece of it. But your other point around -- if you have both Platform and Cloud, the lumpiness will come down. Probably not always because some -- most of these times, you do have complementary use cases that are working in parallel. So, when a time for a platform renewal actually comes, there is an event that happens that drives upfront revenue recognition. That doesn't change. So, the lumpiness will still be there. But I think to answer your question, yes, there is a growing number of customers that are using both Platform and Cloud. And actually, that's exactly the direction we want to go because that makes our customers a lot more stickier.\nIttai Kidron: And Jay, second question for you. You've talked about how the quality of the new customer additions is higher. Maybe you can dig into that a little bit more, what does that mean? Is this a Global 2000 customers more weighted? Any color on that would be great.\nJay Kreps: Yes. It's not exactly Global 2000. We have a couple of mechanisms that we include in that, but it would be broadly aligned to something like that. We would also include certain types of tech customers that might not be Global 2000, but have high potential. So, it's a defined customer list that we've set aside. So, it's something like that, where we feel like, hey, there's potential for high IT spend and therefore, kind of bigger growth for us over time.\nIttai Kidron: Appreciate it.\nShane Xie: Thanks. We'll take our next question from Gregg Moskowitz from Mizuho, followed by Needham.\nGregg Moskowitz: Okay. Thank you. Rohan, you did a nice job explaining some of the deliberation by the digital native customers and what you're assuming going forward. That said, you beat Q2 subscription revenue by about $7 million, guided in line for Q3, which implies a fairly meaningful Q4 reduction. So, I did just want to ask if either of these large deals closed sooner than you had expected? Or if there's anything you're seeing in the pipeline that has caused you to be a little more cautious with respect to the Q4 specifically?\nRohan Sivaram: Yes, Gregg, I'll say that I'll go back to like when we think about the second half guidance, obviously, these two drivers that I spoke about on the Confluent Platform side. In general, you have Confluent Platform, large deals that are either renewals and expansions and new deals. For the renewals, it's fairly predictable. You have visibility 12 months down the road when that's going to happen. And more often than not, it ends up kind of in that ZIP code. For the newer deals and for the expansion deals, that's where you could see deals kind of shift one quarter plus/minus. And that's the dynamic that basically I called out for the second half guidance. And it's also important to note is that our backdrop of what continues to be a fairly volatile macro environment. And we want to be -- we want to make sure that we are thoughtful and prudent with respect to as we think about the outlook. On the Confluent Cloud side, again, not a whole lot of new things to share, but we are basically assuming that the dynamics that we saw towards the end of Q2 will kind of have impact to the second half of the year.\nGregg Moskowitz: Thank you. And then just for Jay, can you walk through the rationale of switching Confluent Cloud pricing for your basic and standard clusters from based on partitions previously to elastic CKUs? And then also, does this change have any impact on revenue over the remainder of 2024?\nJay Kreps: Yes. We made a set of pricing changes. Those were some of them. There was also some tune-ups on some of the throughput related pricing, some of the connector pricing. We talked a little bit about that a few earnings back as being kind of aligned with this consumption transformation. So, in general, we were looking at things, that cost friction early in the buying process and we're kind of more aligned to a big upfront purchase than they were to a kind of use case-by-use case expansion and we wanted to pull some of that out. If you think about what we're trying to do broadly, there's a lot of open source Kafka usage out there. We've monetized a small percentage of it, mostly sitting out there and open source, we want to go get it. There's a bunch of things we do to make that happen. But part of what want to do is really cover the spectrum of kind of TCO needs. There are very high volume, very price-sensitive workloads. There's very premium, high-quality workloads. You actually need some different SKUs to actually segment that market and go after it in the best way. So if you think about the additions to our portfolio, both the new offerings in Kafka for very large scale, some of the tuning at the low end. It really is about trying to properly segment that market and go capture it to kind of soak up more of the world. Kafka, I think has proven successful in part, as evidenced by the higher volume of customer lands, I mean part of that kind of comp and sales practice thing, but part of it is also changes in the product that make it easier to land. Does it have impact on revenue? Yes, it does have some. Whenever any of these things that kind of give customers more options, it does give them more opportunity to shift around. When we look at that, that effectively came out as expected. So we had some model of like, hey, how much shift are we going to see. Typically, what you see when you make one of these changes is initially, some shift that may be a little bit negative. And then kind of better expansion as you have more options for customers to plug into. And so when we were checking ourselves against the model we built in terms of the impact of that, it was more or less exactly what we expected. When you take it all together, of course, individual changes might be a little bit more or less. So the change on those SKUs was not a part of that larger vision, which is like simplification, friction reduction and just kind of soaking up all the Kafka. Is that helpful?\nGregg Moskowitz: Yes, super helpful. Thank you.\nRohan Sivaram: And Gregg, I'll just add to what Jay said that is, as we look at the second half of the year, some of these dynamics that we called out is essentially baked into our outlook for the year as well.\nGregg Moskowitz: Okay. Thank you guys.\nShane Xie: Thanks. Let's go to Mike Cikos with Needham. Mike?\nMike Cikos : Hey, thanks for taking the question guys. Before I dig into mine, just to make sure we're clear on where we were going with Gregg's last question there. As far as those pricing changes, that was contemplated when you guys provided us the guide for full year two quarters ago? Or no, we're making changes now in real time off the Q2 result?\nJay Kreps : Yes. Yes. I think it's -- it was factored in early on. Like we had a model for what impact that would have, and we haven't seen it deviate from that. So when we think about like, hey, what are the factors impacting guidance in the second half? I think it's exactly what Rohan said, which is Confluent Platform lumpiness and what we've seen in the digital native segment. The price changes, we think it's net positive over time, but it's not a huge factor 1 way or the other right now.\nMike Cikos : Awesome. Awesome. So I wanted to start with -- I know the digital natives, we've highlighted that a lot. Is there any way to think about how their spend compares to other pieces or other segments within the Confluent customer base? Like are these -- is it a 2x -- like what's the significance of the spend on a per customer basis versus the rest of the Confluent customer base?\nJay Kreps : Yes. Digital native itself spans from very small kind of tech companies to very large tech organizations with thousands of engineers. And so it would be inaccurate to characterize that as a whole. So even internally, we break that into kind of large tech companies and smaller tech companies. What we saw was more concentrated on these large tech companies that are kind of more actively pursuing optimization. For those customers, yes, they do tend to operate at scale. They have a lot of engineers. They tend to move quicker than the average customer in terms of adoption and expansion, but also in terms of optimization, they're just a little bit more agile than a similarly sized company elsewhere in enterprise. That's probably broadly how I would characterize it. Their kind of use cases aren't vastly different from the rest of the world. They just tend to have a bit more data and somewhat more engineers than the average company that size.\nMike Cikos: Okay. And just thinking about the quality of those new logos that we've highlighted a couple of times here as well. We're early days here, but is there any way to think about how the expansion of these new logos has played out versus what you've seen historically? And I guess the second part here, for those new logos; does it skew more heavily towards digital natives? Or is there any way to think about the composition of these logos?\nJay Kreps: Yeah. What we've shared is it's kind of broadly more concentrated in that high propensity customer list, which you think of as kind of Global 2000 plus high propensity tech. I haven't looked at the tech composition specifically broken out, so I couldn't give you more color on that, but I'm not aware of that being a factor. And then yeah, we are catching these use cases earlier. It's just easier in this consumption motion for us to land. We're more flexible on the commitment amount. The product is better optimized for that. The comp is incentivizing it. And so yeah, it is easier for us to get in early. But the key thing for us will be to kind of show that ramp of consumption over the course of the year with these new customers. What we've seen so far is promising, both in terms of the numbers and that ramp time. I don't think it will be exactly the same amount per customer, but the customer volume is much higher. And so we think, overall, that's a net positive contributor when we think about what the base of new customers that we're acquiring.\nMike Cikos: Perfect. Thanks.\nShane Xie: Our final question today will come from Michael Turrin with Wells Fargo.\nMichael Turrin : Thanks for squeezing me on. Jay between the go-to-market changes and the new product efforts, it seems like you're setting the stage for the next phase of Confluent. When do you think the foundation there is largely set and we go past talking about some of the transition impacts and more directly to some of the benefits from consumption focus and new products? Is that something we can start just to be built towards today? Is that end of year?\nJay Kreps: I mean, obviously, there's no moment in time where yesterday, it was the old thing. And today, it's the new thing. But yeah, it's certainly the case that this year, we've got a lot of moving parts that are part of setting up where we want to get to, right? The consumption changes are part of that. The new product introductions are part of that. As it becomes more of a tailwind for the business, I think it's definitely as we head into next year, that's where we have a more stable system that we're executing the go to market in, and we've had more history with. And then we have products that have gotten to enough scale of revenue where they can move the overall number. Obviously, these newer offerings, you invest a lot of time in them, but the early results you're just building that initial customer base. It's relative to the amount of effort, you're not getting as much dollars out as you would with the core business. However, any of the big things start small. And so getting those things seated and started now, I think, is very important, both in terms of what we want the business to do over the course of the next three years, but also in terms of what we want to be in customers like the capabilities we want to provide them, setting ourselves up to really be a strategic platform in these organizations. So yeah, obviously, that's a key effort this year. I would think about the contribution as being throughout next year and kind of a tailwind then.\nMichael Turrin: Thanks very much.\nShane Xie: Thanks Michael. This concludes our earnings call today. Thanks again for joining us. Bye everyone."
  }
]