[
  {
    "symbol": "CFLT",
    "period": "Q1",
    "year": 2025,
    "date": "2025-04-30",
    "content": "Shane Xie: Welcome to the Confluent Q1 2025 Earnings Conference Call. I'm Shane Xie from Investor Relations and I'm joined by Jay Kreps, Co-Founder and CEO; and Rohan Sivaram, CFO. During today's call, management will make forward-looking statements regarding our business, operations, market and product positioning, growth strategies, financial performance and future prospects, including statements regarding our financial guidance for the fiscal second quarter of 2025 and fiscal year 2025. These forward-looking statements are subject to risks and uncertainties which could cause actual results to differ materially from those anticipated by these statements. Further information on risk factors that could cause actual results to differ is included in our most recent Form 10-K filed with the SEC. We assume no obligation to update these statements after today's call, except as required by law. Unless stated otherwise, certain financial measures used on today's call are expressed on a non-GAAP basis and all comparisons are made on a year-over-year basis. We use these non-GAAP financial measures internally to facilitate analysis of our financial and business trends and for internal planning and forecasting purposes. These non-GAAP financial measures have limitations and should not be considered in isolation from or as a substitute for financial information prepared in accordance with GAAP. A reconciliation between these GAAP and non-GAAP financial measures is included in our earnings press release and supplemental financials which can be found on our IR website at investors.confluent.io. References to profitability on today's call refer to non-GAAP operating margin unless stated otherwise. And with that, I'll hand the call over to Jay.\nJay Kreps: Thanks, Shane. Good afternoon everyone, and welcome to our first quarter earnings call. We're pleased to start the year with solid momentum. Q1 subscription revenue grew 26% to $261 million, Confluent Cloud revenue grew 34% to $143 million, and non-GAAP operating margin improved six percentage points to 4%. Our Q1 results demonstrate the mission critical nature of data streaming, and our significant product leadership. We remain laser focused on enabling our customers, to cost efficiently build next generation applications and win in the age of AI. On today's call, I'd like to walk through four key strategic drivers, behind our resilience in the current environment. In fact, our resilience has been tested by multiple macro headwinds since Confluent's founding over 10 years ago, and it continues to support our path towards delivering long-term growth and profitability. First and most critically, data streaming sits at the heart of the mission critical use cases that, our customers rely on every day. These are not lightweight experiments, they're the backbone of real production workloads. These applications play a critical role in the day-to-day business of our customers, and can't be turned off without major disruption to core parts of their business. Confluent powers real-time fraud detection for financial institutions, inventory management for retailers, 5G networks for telcos, and data pipelines that power businesses in countless industries. This dynamic has helped sustain gross retention rate above 90%, despite multiple points of instability in the macro environment that, reduced IT spend for some of our customers. The second driver of our resilience is the scale of the opportunity we're going after. Apache Kafka has become a foundational technology for data management. Today it's used by more than 150,000 organizations representing $100 billion plus addressable market opportunity. Soaking up the countless use cases built on Kafka, has been a core engine of our growth, and continues to be a powerful tailwind. This quarter we added 340 new customers, our highest net add in three years, and we continue to see robust growth with many of our largest customers, as they expand to new use cases. In Q1, we added 16 new customers to our cohort of $1 million plus ARR customers, our highest addition to that cohort ever. Our customer base is diversified by industry and by geography, and no single customer accounts for more than 2% of our total ARR. This diversification further strengthens the resilience, and durability of our business. Audacy and Booking.com are two great examples of customers that started with open source and then converted to Confluent. Audacy is a leading audio entertainment company with 200 million listeners across radio broadcasts, podcasts and other digital content. As their audience grew and customer expectations rose, their old infrastructure began to hold them back. Developers were spending most of their time wrestling with brittle point-to-point integrations, built with open-source Kafka. These were difficult to manage and even harder to scale. Delivering new features at the pace the business needed, became a major challenge. That's when Audacy turned to Confluent. Our pre-built connectors allow them to easily integrate data streaming into their existing tools and systems. Stream governance enables them to quickly, and easily enforce data consistency across dozens of different systems and applications. With our complete data streaming platform, Audacy freed up developer resources so they can focus on innovation, instead of managing infrastructure. As a result, Audacy accelerated feature development by 40%, delivering more personalized experience that keep their customers listening. This helps unlock new digital revenue opportunities across their platform. Booking.com is one of the world's largest online travel agencies. Its mobile app is, one of the most downloaded travel agency apps in the world. Booking.com developed an in-house data streaming platform, based on open-source Kafka. However, self-managing Kafka became increasingly burdensome, as the company grew and introduced new use cases. Scaling clusters, handling updates and monitoring pipelines consumed significant resources. To alleviate the operational complexities of managing Kafka. Booking.com migrated each business unit's open-source clusters to Confluent platform. Our complete enterprise grade solution provided enhanced reliability, and out-of-the-box functionality. By spending less time managing infrastructure, Booking.com can now support various mission critical use cases more efficiently, including marketing, payments, personalization and core booking processes. With a complete data streaming platform that is connected across their business, they were also able to deploy, a connected trip experience. This allows customers to seamlessly book flights, accommodations, car rentals and experiences in one visit. The third driver of our resiliency is meeting customers wherever they are, whether that's on-prem on the edge in any cloud or hybrid environment. That flexibility also provides another layer of resilience to our business. It means our growth strategy is less exposed to changes in cloud investment, and provides a healthy mix of ratable and consumption-based revenue streams. Just as importantly, it lets us land and expand in environments where cloud isn't an option. Whether for regulatory reasons, company mandates or just customer preference. We continue to see strong momentum in this area. Our Confluent Platform business had a particularly strong quarter, with revenue growth accelerating to 18% year-over-year, representing its strongest Q1 growth in three years. And finally, it's not just that our products are better, faster and more reliable, they're also more cost effective. This is a strong differentiator, and provides our customers with more value for less money, across a wide range of use cases. Our low TCO enables us to expand usage, within our existing customer base, and also drive new conversions from open-source Kafka. It's one of the key levers that helps us retain customers, grow within our installed base, and tap into the broader open-source community in a meaningful way. Key to capitalizing on this TCO advantage, is offering pricing and packaging that fits the full range of Kafka use cases, from early projects to the most demanding production workloads. With new offerings like WarpStream and Freight clusters, we're now able to serve high throughput, low latency workloads at attractive price points, enabling our customers to tackle a wider range of use cases. We continue to see strong traction with both offerings in Q1, including new customers like Lyftoff.io and the next wave of GenAI companies like Cursor and Thinking Machines. Here's an example of how our TCO advantage drives sustained growth with a top 20 global bank. This $5 million plus ARR customer, who most recently increased their spend with us by over 30%, initially relied on open-source Kafka. However, the complexity and rising costs of self-managing Kafka quickly outweighed the value they received. More than five years ago, they migrated their first use case to Confluent. Since then, we've become a strategic partner as they've transitioned numerous legacy workloads to the cloud. Today, Confluent powers hundreds of use cases across their business like fraud detection, capital management, regulatory reporting of trade data and more. By moving to Confluent, they have significantly reduced operational costs, turned their real-time data into a competitive advantage and lowered their TCO. In fact, the customer believes that for every dollar they spend with Confluent, they would otherwise spend $3 managing Kafka themselves. Together, these four factors, mission critical use cases, open source conversion opportunities, hybrid business model and TCO advantages have laid the foundation, and made our business more resilient through multiple shifts in the macro environment. Additionally, we see continued adoption of our DSP components, which significantly outgrew our core cloud business. Confluent unifies everything organizations need to work with real-time data, the ability to stream, connect, process and govern continuously flowing streams of data all in one platform. This foundation is proving especially valuable as generative AI moves from experimentation to execution. In particular, we're seeing strong interest and adoption for Flink and Tableflow, two of the most recent additions to our DSP. Our complete platform, is becoming the connective tissue that brings real time context to our customers' GenAI applications so they can deliver trustworthy and actionable results that work in everyday operations. It's very exciting to see what our DSP enables our customers to do. For example, a leading luxury goods conglomerate with 75 brands and over 6,000 stores worldwide uses our Confluent Cloud for Apache Flink to power its real-time order management and drive e-commerce growth. The company initially turned to Confluent Cloud to stream order management data to give internal teams, accurate real-time visibility into product availability. As Confluent proved its value with this first use case, the customer consumed more of our platform, including our fully managed Flink service, to prevent inaccurate stock information caused by duplicate data. This customer uses Flink to filter out orders and inventory duplicates, and to continuously analyze real-time product availability. When high demand items come back in stock, Flink automatically triggers real-time alerts to notify waiting customers, enhancing the customer experience and driving incremental revenue. Building on the success of their initial Flink use case, they are now exploring new ways to leverage the technology, to streamline and scale product inventory management. Before closing, I'm excited to share two updates. First, Ryan Mac Ban has been promoted to Chief Revenue Officer at Confluent. In this expanded role, Ryan will lead the global field strategy, bringing together sales, sales engineering, customer success, and sales operations to help customers activate real-time data to build the next wave of intelligent applications. Ryan joined Confluent last year as Senior Vice President, Global Head of Sales. He brings over 20 years of sales leadership experience, building and leading top-performing teams around the world. Before Confluent, Ryan was President, UiPath Americas, where he drove significant growth across their multi-product platform. He's also held senior leadership roles at VMware and Cisco. Second, we're honored to be named a Google Partner of the Year for the sixth time. This recognition is a reflection of the strong partnerships, we have with the leading CSPs. Together, we enable organizations to deliver the next generation applications they need to thrive in the age of AI. In closing, we're proud of our strong start to the year. Our commitment to providing the industry's most complete data streaming platform, paired with a highly resilient business, uniquely positions Confluent to seize the $100 billion plus data streaming market. With that, I'll turn it over to Rohan.\nRohan Sivaram: Thanks Jay. Good afternoon everyone, and thank you for joining our earnings call. Our first quarter performance underscores the strength of our mission critical data streaming platform. The strategic value of our multi-cloud, multi-data destination and multi-deployment approach as well as the flexibility of our well diversified growth strategy. Turning to the results, Q1 subscription revenue grew 26% to $260.9 million, exceeding the high end of our guidance, and representing 96% of total revenue. Confluent Platform revenue reached a new record of $118.2 million, with growth accelerating to 18%. This momentum was driven by early traction in our partner ecosystem, where OEM showed particular strength internationally. Cloud revenue grew 34% to $142.7 million, representing 55% of subscription revenue. The revenue impact of lapping the leap year, was approximately negative $1.6 million as Q1, this year had one fewer day for consumption. Turning to the geographical mix of total revenue, revenue from the U.S. grew 23% to $156.4 million. Revenue growth from outside the U.S. grew 28% to $114.7 million. Moving on to rest of the income statement, I'll be referring to non-GAAP results unless stated otherwise. While driving top line growth at scale, we continued to show significant operating leverage in our model. In Q1, subscription gross margin increased 100 basis points to 81.7%, primarily driven by continued efficiency gain in Confluent Cloud, coupled with strength in Confluent Platform. Operating margin was 4.3% and exceeding our guidance of approximately 3%, and was primarily driven by revenue and gross margin outperformance. Adjusted free cash flow margin, which excluded the non-recurring impact of our compensation change in Q1, was 1.8%. The impact of the change to free cash flow margin in Q1, was approximately 14 percentage points. Net income per share was $0.08 using 367.8 million diluted weighted average shares outstanding. Fully diluted share count under the treasury stock method was approximately 380.9 million. We ended the first quarter with $1.92 billion in cash, cash equivalents and marketable securities. Turning now to customer metrics, we ended Q1 with approximately 6,140 customers, representing a sequential increase of 340 customers, our highest sequential increase since Q1 of 2022. This robust growth underscores the strong value proposition of our multiproduct platform, and our continued success in capturing the open-source conversion opportunity. As mentioned, at Investor Day 2025, we will report total customer count on an annual basis and begin reporting 20,000 plus ARR customers on a quarterly basis. In Q1, 20,000 plus ARR customer count increased to 2,487 up 41 customers sequentially and represented more than 95% of our ARR. Our 100,000 plus ARR customer count increased to 1,412, up 31 customers sequentially and accounted for greater than 90% of our ARR. Our $1 million plus ARR customer count grew to 210, up 16 customers sequentially our best quarter in net add for this cohort. NRR for the quarter remained stable at 117%, while GRR continued to be greater than 90%, demonstrating the mission critical nature of our data streaming platform for our customers. Turning to our outlook for the fiscal second quarter of 2025, we expect subscription revenue to be in the range of $267 million to $268 million, representing growth of approximately 19%. Non-GAAP operating margin to be approximately 5%, and non-GAAP net income per diluted share to be in the range of $0.08 to $0.09. For fiscal year 2025, we expect subscription revenue to be in the range of $1.1 billion to $1.11 billion, representing growth of approximately 19% to 20%. Non-GAAP operating margin to be approximately 6%, and non-GAAP net income per diluted share, to be approximately $0.36. Now, I'd like to provide some additional context for our guidance along with a few modeling points. In light of the uncertainties in the current environment, we are widening our revenue guidance range and embedding a modest decline in growth rates, from Q2 through Q4. For our cloud business, some of our larger customers began slowing the pace of new use case addition and focusing on cost optimization efforts in March. In contrast, consumption activities in our smaller customer base remain stable. These trends have continued into April. Given the current macro conditions, we believe it's prudent to assume there will not be a near term rebound in consumption. This contrasts with previous cycles, where we typically saw a subsequent expansion following a period of slower consumption. As a result, we now expect cloud subscription revenue mix to be approximately 58% for Q4, '25, with a sequential mix increase of approximately one point each quarter. Finally, we expect fiscal year '25, adjusted free cash flow margin to be approximately 6%. This excludes, as previously discussed, a one-time headwind of three to four percentage points for the full year, due to our compensation change in Q1. We are confident that our updated guidance coupled with multiple parts to growth, sets us up for success this year. Specifically, we see four key drivers of growth in our business. First, the core streaming conversion opportunity targeting an open-source installed base, of over 150,000 organizations. Second, our DSP upsell opportunities across connect, process, govern and Tableflow. Third, our highly strategic role in the age of AI, as traditional enterprises accelerate AI adoption. We believe this represents our largest monetization opportunity within AI. And fourth, the leverage we gain from our expanding partner ecosystem including the OEMs, SIs, MSPs and other high impact strategic partnerships that, help us extend our global reach and accelerate go-to-market efforts. It's important to note these aren't just cloud only growth vectors. We believe they represent durable growth drivers, for both Confluent Cloud and Confluent Platform. For example, in Q1 revenue outperformance was driven by on-prem momentum, with Confluent Platform and its critical role in closing large enterprise deals, with our OEM partners. Our well diversified growth strategy, gives us resilience and flexibility, enabling us to continue to drive durable and profitable growth. In closing, our first quarter results are a testament to the resilience of our business and our ability to capture our market opportunity. With a large TAM category-defining technology and an exceptional team, we are firmly positioned to sustain long-term growth and profitability. Now, Jay and I will take your questions.\nA - Shane Xie: Thanks, Rohan. [Operator Instructions] And today our first question will come from Pinjalim Bora with JPMorgan followed by RBC. Pinjalim?\nPinjalim Bora: Oh great. Thank you for taking the questions. One obviously macro has been top of mind for everybody. I think you said you've seen some slowdown in new use cases, across large customers. Wanted to ask you what about existing kind of use cases, the consumption run rate there? Because I would assume that the existing use cases probably drives a bigger portion of revenue than, kind of the ramping of new use cases, right. And also from the ACV commitment standpoint, are you seeing any difference so far in April, which makes you to kind of look at the guidance?\nJay Kreps: Yes, yes. Great question. So overall what we said, is that we did see a bit of lower consumption in our larger customers on the cloud side. And so overall good quarter, strong growth in CP, solid growth in cloud. This was a combination of optimizations and slower addition of new use cases. I would say both, that wasn't across the customer base, you know, in our smaller customers we didn't see that pattern. And it wasn't specific to a single segment, either in terms of international distribution, or industry. I wouldn't attribute that directly to macro. I think the way I would explain it is this, right? We've seen a bit of an oscillating pattern in these larger customers, where they tend to have kind of a cycle of optimization, and then additional growth and optimization and growth in times that were a bit more certain. We would probably bake in the assumption that that pattern would continue, and we'd see more of a rebound given the current environment. We don't want to do that. We want to be a little bit more conservative in how we're looking at that, and just kind of play it forward straight through the year. And that's what we've done when we've constructed the guidance for this year. Rohan, you may have more to add to that.\nRohan Sivaram: I think you covered it, Jay. Pinjalim, I'll take the second part of your question on the commitments as you can see, from our RPO numbers, Q1 was strong. Both on the CP side where we saw multiyear deals, customers committing multiple multiyear deals. Also on the cloud side, where our cloud motion continues to be consumption first. But we've seen a lot of customers actually come and commit to multiyear deals on the cloud side as well. So the ACV commitments in Q1 was strong. That's how I'd categorize it.\nPinjalim Bora: Yes, got it. Jay, one follow-up for you. And this is more of a high level. We have seen some enthusiasm in the open-source community around this idea of a diskless Kafka. Seems like with a new KIP around there, obviously that's writing directly to object storage. And WarpStream has been doing that for some time now in your own WarpStream. So I want to ask you, how do you kind of see the future of Confluent? Is Confluent overall as a whole, not just WarpStream, could it move to a diskless future at some point? Or the latency issues kind of with object storage kind of might...?\nJay Kreps: Yes. We've actually - it's a great question. Yes, we've actually done that in both our cloud and with WarpStream. We're actually very intelligent about the use of storage. And so our Freight clusters use kind of a pure diskless approach. Our other clusters use a combination of storage technologies across the memory hierarchy to optimize it. There's a fair amount of sophistication in that layer, and it actually matters a lot when you think about the cost characteristics and the performance tradeoffs. It's definitely an area we put a fair amount of R&D effort.\nPinjalim Bora: Thank you so much.\nShane Xie: All right, thanks, Pinjalim. We'll take our next question from Matt Hedberg with RBC, followed by Wells Fargo.\nMatthew Hedberg: Hi, great. Thanks guys for the questions. Congrats on the quarter environment at all. Jay, it was great to hear the success in DSP. I think you called out Flink and Tableflow in particular. I'm just sort of curious, 4Q you called out DSP was 13% of your cloud business. I'm wondering if you can sort of quantify how that improved sequentially. And then maybe just a little bit more on Flink, it seems to be coming up more and more in our partner checks. I'm wondering where you're seeing some of the option there?\nJay Kreps: Yes. I'll give you some characterization. Our intention with that kind of DSP percentage is to come back to that periodically but not every single quarter. And so, here's what we're seeing. So ton of enthusiasm. Overall like sentiment in the company is the DSP offerings are on great success trajectory, significantly outgrowing the kind of core cloud business. And we've been through this before. As that stuff starts to get to scale, it moves the overall numbers. And a lot of enthusiasm from customers. We just released Tableflow as GA in AWS. Great early signs for that. And then Flink is succeeding really nicely both in the cloud as well as in CP. We've added this to our CP offering and picked up some really sizable customers on that doing awesome use cases. And so I think this is still the early innings for the offerings on both sides, but great initial success. In the cloud, these kind of serverless offerings, you start with kind of a broad base of simple use cases, then you start to build to the more mission-critical, large conversions where people are moving dozens, or hundreds of different processing jobs over. And that's, of course, when you start to see the real money move - and we're starting to win some of those kind of larger customer engagements. We're putting in a ton of work to make sure we can really deliver against these big migrations, and that's a real focus in the team. But overall, do you think that there's a significant push inside companies towards real-time in the use of data? We're seeing this pattern around, we would call it shifts left, where a lot of what customers were doing with data is moving upstream into the real-time area so that it can go to multiple destinations, so that it can land in their analytics environments faster and so that it can be part of the use of AI applications, which often need that. And for all those reasons, I think we have great tailwinds in that area. We ultimately don't make a ton of that product success into our guidance. It's often hard to forecast these new things, something like Tableflow that's just coming out to GA right now. We would have internal goals, but when we think about our financial plan for the year, we wouldn't have something attached to that until we really see it perform. But the initial signs are very promising in terms of build the pipeline and customer conversations.\nMatthew Hedberg: That's fantastic. And then maybe just one for Rohan. I think the reduced guidance makes a lot of sense to us just given the macro. I appreciate the conservatism there. Coming off of a record quarter, at least from the past several years of new customer adds, I'm wondering how you're thinking about the relative rate of customer adds versus NRR. I mean, are you assuming that, that NRR comes down a little bit, new customer adds? Just kind of the components of that would be helpful?\nRohan Sivaram: Yes. Matt, sure thing. I mean I'll make a couple of comments on guidance, and then I'll get to your question on NRR and customer count. I mean, as we called out, our guidance philosophy has been very consistent. And how we've approached it is disciplined approach, and set prudent targets. And Jay talked about the dynamic around consumption. On the CP side, we did see good momentum in Q1. Our visibility for Q2 remains good. So that's kind of driving our outlook for Q2, and rest of the year. But if I take a step back and look at the guidance, what I'll tell you is we're looking at a guidance of 19% to 20% for the year at $1 billion-plus scale. And we're doing that with what I would call a fairly prudent setup for us. And we have multiple vectors of growth as we look at it, which includes streaming, which includes DSP, the AI as well as the partner ecosystem. So that's a little bit about the guidance, and why we feel good with the setup that we have right now. To your question around customer count, that's right. I mean that entire ecosystem of customer count, not only total customers on one bookend, but also $1 million-plus customers, we had the best quarter from $1 million-plus customers that tells you that top of the funnel, obviously, we are adding a lot of customers into the Confluent ecosystem. Our $20,000 customer tell you the amount of, I would say, high-intensity, high-frequency customers who can spend a lot with us. That shows the core customer count. And $1 million-plus customers is just how we are pushing them through the funnel. So overall, we feel good. NRR last couple of quarters has been, give or take, around 117% range. And what supports that NRR is our consistency on the GRR side. That's call-out number one. We've been greater than 90% since we've been a public company. And on the expansion side, the dynamics that we called out on the consumption side could have an impact. But if I think about NRR, it should be in that ZIP code of 117% as we look ahead.\nMatthew Hedberg: Well done guys.\nShane Xie: Thanks Matt. We'll take our next question from Michael Turrin with Wells Fargo, followed by Morgan Stanley.\nMichael Turrin: Hi, great, thanks. Nice to see everyone. I appreciate you taking the questions. Jay, I want to start with something that was, I think, very topical at the Investor Day, which was just some of the AI-related use cases. You've mentioned Cursor a couple of times. Investor sentiment on this topic, certainly, it seems to ebb and flow. But can you just help add some context around what you're seeing in terms of AI-related demand, if there are certain use cases, you're finding you'll have strong product market fit as those evolve, and just how we should start to expect some of this to evolve, over a longer period of time?\nJay Kreps: Yes, absolutely. So we've seen success kind of in two dimensions in the AI area. I mean, first, selling to AI companies like Cursor, as you mentioned. The other is the kind of enterprise uses of AI, where we're really fulfilling two roles. One is this data supply chain for getting the data that fulfills the context for some of these AI applications. The second is for these agents that, are actually acting on things in real-time. The usage - the more sophisticated use of data has often been some batch job at the end of the day. But the point of these agents is to get into the kind of real-time flow of things. And we are starting to see those use cases emerge. I would say that's earlier of the two. But I think it's a pattern that's quite durable. We've done a fair amount of writing, and kind of thought leadership in this area. And we're seeing kind of a community of interest forming around this in our customer base, and well beyond in the larger community. So I think that's very promising.\nMichael Turrin: Just as a follow-up, if I may. Just beyond the consumption patterns in terms of some of the things you're contemplating with guidance, it sounds like newer products are just lower assumptions in the earlier stage. But are there certain milestones we should be thinking about in terms of go-live with some of the newer products? And then on the go-to-market transition, maybe just help us with what you've seen from Ryan and how you're thinking about the shape of productivity you could see throughout the year?\nJay Kreps: Yes. Yes. So I'm really excited to be working with Ryan. Any of these executive roles, we obviously do very broad outside search, and look inside as well and met a lot of people in the process. And I felt internally, we had somebody who had a ton of strength in execution. He was a strategic thinker and understood, what we were doing as a business, the space we were operating in. He would be an awesome part of the executive team, and leadership of the company. So I feel really good about the changes. Obviously, also less disruptive, because you have somebody who's already managing the full set of sales reps, just kind of taking on additional responsibility. And you have somebody who kind of proven themselves on the field, versus taking a shot on somebody new coming in and adjusting to our space. So I feel really good about that, and excited about what we can do in the year ahead. Obviously, less changes overall on the go-to-market side this year than last year, as last year, we were doing this bigger set of consumption changes. So I think overall, that's a positive setup for us. And then remind me of the other part of the question.\nMichael Turrin: Just on some of the new products. So are there time lines we should be thinking, about where those could start, to see a steeper adoption ramp just based on the...?\nJay Kreps: Yes. Yes. The two things that I think are in our mind, we're - we've started to get this Connect business scale, the business around the connectors. We're now able to do much more of the kind of lift and shift of existing use of open-source Kafka Connect and bring that into our platform. We feel pretty good about that motion. So now it's kind of taken that to scale. For Flink, it really is about these larger customers and use cases. Taking the - any kind of cloud layer that does data processing is basically a programming framework, where you're writing effectively complete program, SQL or Java, and the ability for customers to take things that they've done, to migrate in and really get to scale with that across big complicated production use cases. As we start to make more of those successful more quickly, that's kind of the motion to start bringing more and more, onto the cloud offering there. CP Flink, I think, is of a nice start with customers. That's kind of an easier process of lift and shift. And then Tableflow is just out of the starting gates. So the big milestones there are getting it across all the clouds, opening up the integration with Delta and Unity. The Databricks technologies that we've kind of promised to our customers and are working with Databricks around. Both of those are exciting milestones. I think we'll start to see that get out to early customers and have a better sense of the trajectory in the coming quarters.\nMichael Turrin: Thanks very much.\nShane Xie: All right, thanks, Michael. We'll take our next question from Sanjit Singh with Morgan Stanley, followed by Deutsche.\nSanjit Singh: Yes, thank you for taking the question. As we sort of enter this period of uncertainty, it sounds like the business coming in is quite healthy, and really impressive customer add metrics across the board. One of the things I'm trying to get a handle, or we're all trying to get a handle on is that if optimization activity comes back online, how to compare it maybe do what we saw in the back half of 2022, throughout 2023, when there was kind of a more widespread optimization activity across the customer base. So in that spirit, Jay, I was wondering if you could talk about maybe the profile of the business back then in the second half of '22 and '23, versus what's driving growth in your customer base today. And if we did see another round of optimization activity, how would you compare it versus the last cycle?\nJay Kreps: Yes. I would say that probably the biggest change in the business between those two time frames is I do think customers have done a lot of this. When you think about effectively what we went through in '19, '20, '21, there's kind of a run-up in cloud spend and a big push on just build, build, build, new stuff, new stuff, new stuff. And in that environment, you do get a lot of effectively unoptimized cloud usage in a variety of ways. And probably the companies with a consumption model as we have for our cloud, saw the run-up of that the fastest. And then, of course, also in that consumption model, it's easier than for - the customers should be able to make sure they're really getting the full value out of it, and that will take down the spend. I think the difference now is a lot of that has been done, right? So we do see refinement in customer usage. But I don't think that there's nearly as much of a - I think there's a lot more tightness in the base of the cloud usage, than there was at that time period.\nSanjit Singh: So maybe the range of outcomes is maybe narrower than it was a couple...?\nJay Kreps: I think that's probably right.\nSanjit Singh: Yes. And so picking up on the strong Confluent Platform performance, the acceleration of 18%, I was wondering if you sort of view that as a structural change as some of the knock-on effects from some of the policies - the macro policies that have - the policy debate around customers toggling a little bit more to self-managed given potential actions on digital services, those types of things. And so do you see Confluent Platform and some of the innovation around CP Flink is that now more, of a better grower for the product portfolio, in your view?\nJay Kreps: Yes. I think it's too early to say to make that. What we saw in Q1 was actually just really good performance in CP. I don't think - those deals obviously have some time line to build. So it wasn't directly in relation to tariffs, or anything like that, as you that quickly. So what we have seen, I think, is probably a ton of exuberance about cloud-heavy investment and I would say maybe a more measured cloud and on-premise strategy in some of the larger enterprises. And what you're seeing is relevant, right, which is, hi, if companies are internationally are more concerned about the interaction with the U.S., could there be more pressure on cloud usage? It's certainly possible. I mean I don't see any kind of major pullback from the cloud, but it's certainly possible. The one thing I would say is Confluent has intentionally built to be highly resilient across that. And so to some extent, we're not taking a hard bet on one side or the other. We've continued to invest in Confluent Platform. We've continued to add functionality. There wasn't as much growth in data center usage for a period of time. If there's a bit more, CP will probably grow a bit faster. If that's not the case, cloud will grow faster. We're basically happy to support customers wherever they are. I don't - I wouldn't expect a large scale pullback from the cloud just, because we've, as an industry, kind of come to just rely so heavily on it. So I think it'd be premature to call any of that. But the key point for us, making sure we're in a great place with customers one way or the other. And I will tell you that this ability, to serve customers multi-cloud and hybrid has become really top of mind for a lot of these companies. As they are just starting to think about the balance of investment, what they're doing, what's happening with some of the legacy stacks, et cetera, I think that's turned into a real asset and with it. Maybe four years ago, it was more hypothetical. Now it's just a very concrete must-have.\nSanjit Singh: Yeah, I appreciate the perspective. Thanks Jay.\nRohan Sivaram: Sanjit, I'll add another, I would say, slightly different lens to what Jay just shared. When you look at our $1 million-plus customers today and we added net 16 customers, the highest we've had, the mix of that is very balanced across our portfolio. For example, like seven of those customers were driven by CP expansions are driven by CP. And then 50% of them are currently hybrid customers. And 13 out of those 16 customers actually had DSP in it. So fairly balanced. And I think that's something that, we feel good about.\nJay Kreps: Yes. Yes. I think another way to look at this is as we were going public, I think there was concern because our cloud revenue base was solid, like, hi, can these guys really be successful in the cloud? Can they really take a leadership position there? At least personally, I think that question is kind of answered. At this point, we really have a leadership - product leadership, I think of the cloud, product leadership on-premise and a really good hybrid story. And so we feel at this point, it's kind of the customer's choice how they want to buy.\nSanjit Singh: Awesome, thanks for the perspective.\nShane Xie: All right, thanks Sanjit. We'll take our next question from Brad Zelnick with Deutsche Bank, followed by William Blair.\nBrad Zelnick: Great, thanks so much guys. Nice to see everybody. I wanted to follow-up on Sanjit's question. I mean such a strong CP quarter out of the gate here in Q1. And I think within that term license is up like 60% year-on-year. And if I listen carefully to your comments, Rohan, in the prepared remarks, you mentioned the OEM relationships in international. I don't typically think of you guys as a strong OEM company, maybe not like Microsoft, but maybe I'm just not listening well enough. Can you just expand a little bit more on the nature of these types of relationships, the visibility you have to these deals, the typical term length? And what is the better-together story with these type of relationships?\nRohan Sivaram: Yes. Happy to take that, Brad. Yes. From an overall CP business perspective, as you rightly called out, Q1 was a strong quarter, 18% growth. But I've said this before for CP. I think looking at this business over a 12-month period is actually a much better indicator. Typically, timing of some of these larger deals, timing of these renewals, which are large could have an impact on revenue. But if you look at it from a 12-month lens, you'll see the consistency in the CP performance. And historically, we've called out strength from regulated industries. And over the last couple of quarters, we've been talking about our focus around the partner ecosystem. And some of these OEM deals, I think, in a very simple manner, it just helps us amplify our message, and send basically sell through as well through a lot of our OEM partners. So this particular OEM that we called out, was primarily on the international side, which was strength. But it's not just from OEM. It's also from multiyear deals that we also had in Q1. And as we look at the rest of the year, I think the visibility is, we'll see a good momentum in CP for rest of the year primarily, because of the reasons that Jay just laid out.\nBrad Zelnick: That's very helpful. If I could just follow-up. Thank you for continuing to call out the impact from the change in comp on free cash flow. Anything else Rohan at this point in the year, as we think about the remainder that would swing the growth and trajectory of free cash flow, versus net income growth that we might want to keep in mind? Thanks so much.\nRohan Sivaram: No. Our adjusted free cash flow goals for the year is approximately 6%. And outside of this one-time impact, we don't see any kind of adjustments out of our free cash flow number for rest of the year. So historically, what we've said outside of these timing of comp payments, or timing of commission payments, generally, the free cash flow tends to go in line with the operating margin. And for the full year, for sure, kind of they're pretty closely related. And that's what you're going to see for rest of the year.\nBrad Zelnick: Excellent. Thank you again guys.\nRohan Sivaram: Thanks Brad.\nShane Xie: Thank you. We'll take our next question from Jason Ader with William Blair, followed by Needham.\nJason Ader: Yeah, thanks Shane. Good afternoon guys. How do you explain the strong net adds in Q1? Is it just the go-to-market changes that you made last year? Or is there anything else going on?\nJay Kreps: Yes. There's a set of things. You have to look at it a little bit, as Rohan said, by the tier of customers. The folks entering the $1 million-plus is obviously a different explanation from that kind of top-of-the-funnel total customer count adds. At that top-of-the-funnel side, I would say we've made a set of improvements in the product-led side of the business, and we feel like that has kind of picked up a little bit of steam. On the $1 million-plus side, it really is just customers continuing to progress in their streaming journey and helping them along. It's rare that companies start there. They usually start a bit smaller and grow into it. So that's just an evolution usually of work we've been doing with them over a year, multiyear, really depending on the case.\nJason Ader: Okay. And then a quick follow-up on - for you, Jay. Just do you think the macro uncertainty will actually stretch out AI deployment time lines for customers?\nJay Kreps: Yes. It's a good question. It's a hard one to answer. We - like what have we actually seen so far? So it's not the case that we've seen a bunch of projects put on hold or some sizable change yet. But it definitely is on the minds of customers. We have customers who are car companies or retailers, and they're thinking about this. And I think the answer is they're not sure, and I haven't seen the action yet. But certainly, when we're thinking about our guidance, the trajectory for the rest of the year, it makes us more cautious, and conservative in what we're doing.\nJason Ader: Thank you.\nShane Xie: All right, thanks Jason. We'll take our next question from Mike Cikos with Needham, followed by Mizuho.\nMike Cikos: Great. Thanks Shane for getting me on and thanks for taking the questions here guys. If I just come back to the consumption dynamics that we're talking to here, I know we've seen typical oscillations from larger customers before. With what played out in 1Q, just curious, can you give us any more color on when that started to evidence itself? Was it towards the back half of March? Was it the final couple of days? And then now that April is essentially in the rearview mirror, has that, in any way, deteriorated further and stable from where we were ending March?\nJay Kreps: Yes. Yes. So we saw this in March, what wasn't just the last few days. We certainly saw some impact through March. And then we've seen stability, but not an immediate rebound in April. And that's kind of thinking about that, thinking about just the larger environment, that's what made us more cautious overall in the cloud guidance.\nMike Cikos: Got it. And for the follow-up, I think I went to Rohan with the prepared comments, but one of the reasons you attributed some of the strength for Confluent Platform was specifically tied to the partners in international. Is it fair to think that with your - the traction you're seeing with your partner ecosystem, CP, this is, call it, an incremental growth vector here just, because certain geographies have a preference, or a greater desire to go for CP over cloud?\nRohan Sivaram: Yes. Mike, I mean, when I think about the growth drivers for us, called out four growth drivers. The streaming opportunity DSP, which is not only net new, but also expansion to our existing customers, AI as well as the partner ecosystem, which includes SIs, GSIs, OEMs, these are all not only Confluent Cloud, but they are also Confluent Platform opportunities. So I think that's probably one thing that I wanted to call out, I also called out in my prepared remarks. So short answer to your question is yes, it's across the board. And our strategy around being the partner ecosystem, Switzerland, where multi-data destination, multi-cloud and also multi-form factor, is helping in the current environment.\nMike Cikos: Thank you guys.\nShane Xie: All right, thanks Mike. We'll take our next question from Gregg Moskowitz with Mizuho, followed by Cowen.\nGregg Moskowitz: Great. Thank you for taking the questions. Jay, wondering if you could give us an update on WarpStream. Since acquiring the company, have you been able to close any meaningful transactions? And if so, has all of that come from the WarpStream pipe? Or was some of this Confluent-generated as you start to integrate it into the fold of the rest of the go-to-market, so to speak?\nJay Kreps: Yes. Yes. So we've definitely had some really nice strong wins. I think we've shared a few of those. We've mentioned Cursor, but there's been a set of others that we brought forward in some of the past earnings. And yes, those are a mixture of some things that were - a few that were already in the pipeline, but we're actually seeing great activity and a set of wins across the larger team. And it's not surprising. This is something that was very close to home, fill the kind of natural niche in our product portfolio, and was ready to sell. And so, we kind of knew coming in to be one that could potentially hit the ground running, and that's what we've seen.\nGregg Moskowitz: All right. Fantastic. And then just for Rohan, as part of the revised 2025 guide, you mentioned you're not assuming a near-term rebound in consumption. But maybe if we were to look at the other side of the coin, I'm just curious if any thought was given to assuming a further weakening of these trends just given greater unpredictability of the macro. Or from where you sit, from your perspective, does it just seems difficult to envision things degrading from here?\nRohan Sivaram: Yes. I think the way we thought about it was, again, make sure that we have a prudent setup for rest of the year. So what are the two big assumptions behind it? We spoke about it, but I'll reiterate it because it's important. First, for our larger cloud customers, we know we did see some cost optimization slowdown in net new use cases. We are not assuming an immediate near-term rebound in their consumption patterns. If you compare and contrast that with history, we've seen that - historically, we've seen a rebound after optimization pattern. And you've got us call out the sawtooth pattern that we see. We're not assuming that same shape. That by itself provides some prudence to our guide as we look forward the year. For Confluent Platform, it's slightly different because, of course, as Jay mentioned, there are deals that are already in the works. You have visibility into the pipeline. You have - so our guide is based on a lot of visibility in the pipeline that, we have from Confluent Platform. And I think, the final takeaway from my perspective is, if we take a step back and you look at our guide, we're calling 19% to 20% at a greater than $1 billion run rate. But we're not assuming any form of acceleration in the back half of the year. I think that setup makes us feel good, as we head into what I'd call uncertain times, yes.\nGregg Moskowitz: Yeah, very helpful. Thanks, Rohan.\nShane Xie: All right, thanks, Gregg. We'll take our next question from Derrick Wood with TD Cowen, followed by Barclays.\nDerrick Wood: Great. Thanks for taking my questions. I'll start with Jay. Anything to share around what kind of demand reception you've seen from Tableflow since it went GA? And just curious how to think about the revenue benefits. Is there a separate charge for Tableflow? Or is it more about just bringing new workloads onto the core platform?\nJay Kreps: Yes. It's a great question. So the reception has been extremely strong. Now it's difficult, of course, for new products to figure out exactly how fast it will ramp, and exactly to what size. So we're always cautious, when we try and forecast anything around it. But I'd say, overall, it's about as strong as we've ever seen for any new product, and we're very excited about it. It will take us some time to get it across all the clouds, and across all the different formats to fully open up and capitalize on the opportunity. That will happen over the course of this year. It is priced separately. So there's additional charges directly for the Tableflow usage. But actually, the bigger opportunity in what we've seen with customers is, yes, they actually start to bring new data sets on entirely, right? So they'll spend some on Tableflow, but they'll spend some on Connect and Kafka and Flink along with that. And so, the opportunity is really on both sides. And I think, one of the reasons we're particularly excited about it is, it's a very easy product to enable. For existing data, you can kind of just turn it on. It doesn't require a ton of development work. And so, we feel like, hi, as we really crack this and learn how to take it to market, it will be something that we can ramp relatively quickly. But of course, we have to first get it to GA and all the clouds, and make it fully available over the course of this year to be able to do that.\nDerrick Wood: Great. And then, Rohan, I mean, thanks for the color on the change in guidance assumptions. I wanted to ask about the government side of things. First, could you give us a sense of kind of how big of a business public sector, or U.S. Fed is? And then, maybe talk about pipelines, and how you may have changed your assumptions in the second half of this year, given all the new developments on the DOGE side of things?\nRohan Sivaram: Yes. Derrick, thanks for your question. When we think about the government opportunity, I always put the government opportunity in the category of the opportunities ahead of us, because it's fairly underpenetrated. For context, our exposure to the federal government is in the low single-digits, so immaterial. And the shape of the business is consistent with what you see in other companies. Q3 tends to be a stronger Fed quarter. And some of these data points are baked into the guidance that we've set. So short answer, it's obviously fairly underpenetrated, big opportunity. And we spoke about getting FedRAMP status from a technology perspective. Now we are working with our government partner, to get formal FedRAMP status. That will obviously open up the cloud business for us with the government is. So that's how we're thinking about it, small but...\nJay Kreps: And I think fair to say that in the current environment, very modest expectations for that area this year, right?\nRohan Sivaram: That's right. Very modest expectations.\nDerrick Wood: Perfect. Thank you.\nShane Xie: All right, thanks, Derrick. We'll take our next question from Raimo Lenschow with Barclays, followed by Stifel.\nRaimo Lenschow: Hi, thanks for squeezing me in. Two quick questions. One, Rohan, as you thought about the guidance, you mentioned more of the larger accounts have the issues. How do I think about that? Like in theory, this could play out two ways. So the larger account just do a little bit and then it's all good again, or it kind of goes down deeper into large accounts are first and then SMB has a problem. So when you thought about guidance, how would you kind of thought about that kind of reflecting that? And then one for Jay, if you think about - obviously, there were kind of movements from other players in the broader ecosystem to think more about acquisitions in your space. Did you see anything in the customer conversations that they realized, okay, real time is a lot more important, people are trying to keep it out? Are you seeing the benefit on that conversation that they realize, okay, you are actually in the real-time company, so I should talking more with you?\nJay Kreps: Yes. To the second part of the question, I do think that there's definitely been a change in the perception of streaming. I wouldn't say it's a step change. I mean the - in our space, I feel like people always expect there to be a single event that triggers it, but what we've actually seen is a real build, where this went for something that was viewed as kind of niche and on the side, like what could you really do with it? Just something that, of course, every company is doing, but isn't necessarily part of the top line strategy, just something that's really like a major part of data strategy. And I think these kind of things always help that along, but there's no one event that kind of goes from 0% to 100%. And so yes, certainly that comes up in conversations with the customers. I don't think it's a huge catalyst, on that in terms of how they're thinking about things. But there's no question that just - if I were to just kind of go back on two-year increments, and describe what does the conversation with the average CIO seem like? It kind of went from nothing what is any of the stuff to like, okay, Apache Kafka, yes, but like why does it matter? And what is Confluent to like really a broader appreciation of what's possible with streaming, what Confluent is, what could potentially be doable in the stream processing world as they think about kind of the real-time use of data. And that's not universal. It's not everybody has that understanding, but just more broadly across the industry that's changing. And I think it's a really powerful thing. When you think about - there's a certain inevitability to the move to streaming and real-time data. It's sort of just aspect of how companies are changing. And I do think that, that benefits us.\nRohan Sivaram: Yes. And Raimo, to your first part of the question, for our smaller customers, or not larger customers, our consumption patterns have been fairly steady. And that's a good news. And also, when you look at the net new customer adds that we have, a vast majority of our top-of-the-funnel net new ads come on the cloud side. So that is a steady stream of consumption customers flowing in. So the variation in that middle segment is a lot less. So that's why we feel good, with the outlook that we have for rest of the year.\nJay Kreps: Yes. Yes. And kind of adding to that a little color, it's like when you look behind the curtains, kind of customer-by-customer and the large customers, it's like, okay, is there some pattern or some big event that's taking place? Is there any reason to believe that would kind of spread? There's really not. It's just kind of the normal like customer activity you would see around infrastructure and optimization. And of course, the smaller customers do just have a certain law of large numbers in terms of how they operate. So yes, we don't see any kind of emerging trend there. When we put the pattern together, we certainly saw very strong pipe gen in the quarter. So kind of that top of funnel of what's coming in is really good. So we didn't see some kind of overall systematic softening, of the demand environment, or anything like that.\nRaimo Lenschow: Perfect. Thank you.\nShane Xie: All right, thanks, Raimo. Our next question comes from Brad Reback with Stifel, with a final question coming from Raymond James. Brad?\nBrad Reback: Thanks. Just had to get the audio there. Appreciate the opportunity. As you kind of look at the business going forward in the dynamic macro, have you made any changes to your OpEx plans internally? Or are you cutting back on travel? Are you spending a little less? If you haven't done that yet, what potentially would cause you to do that?\nJay Kreps: Yes. We haven't done anything particularly aggressive, but we always manage expenses along with the top line. So we would obviously watch what happens throughout the year and make adjustments. We've certainly operated over the life of the company, through very dynamic times and done all kinds of things around that. So yes, there's not been any big adjustment at this point.\nBrad Reback: Great, thank you.\nShane Xie: All right, thanks, Brad. Our final question today comes from Mark Cash with of Raymond James.\nMark Cash: All right, thanks Shane. For Jay, you mentioned how last year a lot more go-to-market adjustments with the quota alignment, and now thinking about this year and having more products and employment options to sell. So how would you characterize sales productivity? And I think in particular, can most reps and partners go and incrementally sell DSP use cases, or sell WarpStream and Freight versus sun cloud and platform previously?\nJay Kreps: Yes. Yes. It's certainly the case that we feel that the addition to the product portfolio to the other Kafka SKUs that kind of filling gaps in DSP that over time, that's a tailwind because we can land and convert more of the existing Kafka. We can turn these into bigger use cases, bigger platforms, a bigger spend customer by customer. The new product things are still smaller. So they move the overall numbers a little bit and grow fast on a percentage basis. As they get to scale, they move the overall numbers a lot. And we've been through a few of those curves before with the ramp of our cloud product and other things. And so yes, that's kind of the way we look at it. We watch these new things very closely, to make sure that they're on the ramp that we want. And we would expect to see that, kind of have broad impact as they get to scale.\nShane Xie: Great. Thanks, Mark. And this concludes our earnings call. Thanks again for joining us. Have a nice evening. We'll see you soon.\nJay Kreps: Thanks, everyone.\nRohan Sivaram: Thank you, everyone."
  }
]