[
  {
    "symbol": "PCTY",
    "period": "Q4",
    "year": 2023,
    "date": "2023-08-03",
    "content": "Operator: Hello, and thank you for standing by. Welcome to Paylocity Holding Corporation Fourth Quarter 2023 Fiscal Year Results Conference Call. [Operator Instructions]. I would now like to turn the conference over to your speaker, Mr. Ryan Glenn. Sir, you may begin.\nRyan Glenn: Good afternoon, and welcome to Paylocity's Earnings Results Call for the Fourth Quarter and Fiscal Year '23, which ended on June 30, 2023. And I'm Ryan Glenn, Chief Financial Officer; and joining me on the call today are Steve Beauchamp and Toby Williams, Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab.  Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements.  Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to their directly comparable GAAP financial measure because the information, which is needed to complete a reconciliation is unavailable at this time without unreasonable effort.  In regard to our upcoming conference schedule, Toby will be attending the Stifel Tech Executive Summit in Deer Valley on August 29 and the Citi Global Tech Conference in New York on September 7, and I will be attending the HR Tech Conference in Las Vegas in mid-October. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteven Beauchamp: Thank you, Ryan, and thanks to all of you for joining us on our fourth quarter and fiscal '23 earnings call. Our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace and help drive total revenue growth of 34.7% in Q4. For fiscal '23, we reached a key financial milestone for the company with total revenue crossing the $1 billion threshold and finishing at just under $1.2 billion or 37.8% growth over fiscal '22.  Our solid results were once again driven by both adding new clients and employees and increasing average revenue per client. We ended fiscal '23 with 36,200 clients compared to 33,300 at the end of last fiscal year, an increase of 9%. While total employees on the platform grew by mid-teens, consistent with the historical growth trends and in part driven by the success, we're seeing up market as larger clients realize the benefits of our sustained investment in product development and the most modern platform in the industry.  Revenue retention also remained strong at greater than 92%. Average recurring revenue per client was over $30,000 in fiscal '23 compared to just over $25,000 in fiscal '22. An increase of 19% as a result of increased employees on the platform, rising product attach rates across our client base and success with larger clients. We continue to attach more product at the time of sale and have realized increased success selling back into existing clients as our products focused on the most modern workforce resonate across our entire client base.  Our sustained investment in product development allows us to continue to expand our product suite, evidenced by the recent announcement of several new premium offerings and feature enhancements, including Advanced Scheduling, Learning Management and Market Pay. Advanced Scheduling is built upon our existing scheduling capabilities by adding advanced features, such as the ability to match scheduling needs with employees based on job function or role, skill set and certifications as well as swap claim, manage shifts directly via our mobile device.  Similarly, new enhancements to our Learning Management module allows users to easily create and share new training via community, including a new safety training bundle of 20 courses to help clients ensure on-the-job safety and compliance. Lastly, the most recent addition to our suite of modern workforce solutions, Market Pay allows our clients to easily explore, track, manage and compare market pay data across different job families and positions to help make better compensation decisions, evaluate specific roles accurately and comply with pay and equity job posting requirements in multiple states.  Collectively, these 3 new product offerings, along with continued investment across our product suite has increased our PEPY to $500, achieving the target we set 4 years ago. As a result, we are now raising our PEPY target to $600 and are confident in our ability to achieve this goal in the coming years as we continue to develop and deliver market-leading new products.  Our commitment to product development continues to be recognized in the market with Paylocity recently being named an overall leader in 10 HCM product categories in G2's Summer 2023 Grid Reports. Additionally, Paylocity was recognized as TrustRadius top-rated HR management software platform for 2023; won the 2023 Best Human Capital Technology Solution in the SIAA Business Technology CODiE Awards; and achieved the leader ranking in NelsonHall's 2023, Next-Gen HCM Technology NEAT Report for both the SMB and mid and large market segments.  Our strong culture, industry-leading software and exceptional sales and operational execution would not be possible without the dedication and commitment of our employees. As we close out a very strong fiscal '23, I'd like to thank all of our employees for a fantastic year. I would now like to pass the call to Toby to provide further color on the quarter and fiscal '23.\nToby Williams: Thanks, Steve. As Steve highlighted, we continue to build upon our differentiated value proposition of providing the most modern software in the industry with the introduction of new premium products and feature enhancements. While still early, the value proposition of these new capabilities is clearly resonating in the market as evidenced by one of our professional services clients, with over 300 employees, already leveraging market pay to analyze compensation for comparable positions to ensure its payer remains competitive and to help attract and retain high-quality talent in an increasingly tight labor market.  In Q4 and fiscal '23, this dynamic was reflected in solid sales execution across our entire target market, and we plan to continue investing in go-to-market initiatives to carry this momentum forward into fiscal '24. We've expanded our sales force for fiscal '24 by 18% from 694 sales reps in fiscal '23 to 820 reps in fiscal '24, and I'm pleased that we're fully staffed heading into the new fiscal year. We also continue to invest in our channel initiatives, and we remain pleased with the consistency in our referral channel, which continued to deliver more than 25% of our new business in Q4 and full fiscal '23. In addition to an 18% increase in sales reps for fiscal '24, we remain committed to continuing our investments in digital marketing and digital lead generation to support our go-to-market motion.  As a result of our strong financial performance, including our adjusted EBITDA margin of 31.9% and free cash flow margin of 18.4% in fiscal '23, which puts us well into the range of our current financial targets. We are increasing certain of our targets beginning in fiscal '24. This is a reflection of our strong financial performance in fiscal '23, and I'm very pleased with our ability to continue to grow while demonstrating the scalability and leverage in our business model. While Ryan will provide additional detail, we're pleased to continue to target 20%-plus total revenue growth with an increased adjusted EBITDA margin target of 35% to 40% of revenue and an increased free cash flow margin target of 20% to 25% of revenue.  The strong culture of Paylocity continued to be recognized externally this fiscal year as we were named to Built In's Best Places to Work and among the best and brightest companies to work for in the nation. Additionally, for the second year in a row, we also earned placement on the Forbes list for best companies for diversity and best employers for women. Echoing Steve's comments, I would like to thank all of our more than 6,000 employees for a fantastic fiscal '23, which would not have been possible without their dedication and commitment to our clients. I would now like to pass the call over to Ryan to review the financial results in detail and provide fiscal '24 guidance.\nRyan Glenn: Thanks, Toby. Total revenue for the fourth quarter was $308.5 million, an increase of 34.7% and with recurring and other revenue up 24.3% from the same period last year. As Toby noted, our sales team had another solid quarter, and we were pleased to come in $5.3 million above the top end of our guidance range. Adjusted EBITDA for the fourth quarter was $100.6 million or 32.6% margin and exceeded the top end of our guidance by $4.1 million. For fiscal '23, adjusted EBITDA was $375.2 million or 31.9% margin, resulting in leverage of 400 basis points versus fiscal '22. Additionally, we made significant progress on free cash flow with fiscal '23 margin of 18.4%, up nearly 650 basis points and an increase of 111% on a dollar basis from fiscal '22. We remain confident in our ability to continue expanding free cash flow margin in fiscal '24 and beyond.  We continue to make significant investments in research and development. And to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a combined non-GAAP basis, total R&D investments were 15.2% of revenue in the fourth quarter. And on a full year basis, total R&D investments were 14.5% of revenue. On a dollar basis, our year-over-year investment in total R&D increased by 45.7% in fiscal '23 when compared to fiscal '22. We continue to believe our investments in R&D provide us with valuable product differentiation and the ability to drive future growth.  On a non-GAAP basis, sales and marketing expenses were 22% of revenue in the fourth quarter and fiscal '23. On a non-GAAP basis, G&A costs were 10.7% of revenue in the fourth quarter versus 13.2% in the same period last year. Full year G&A costs were 11% of revenue as compared to 12.9% in fiscal '22, and we remain focused on consistently leveraging our G&A expenses on an annual basis. Briefly covering our GAAP results, for Q4, gross profit was $211.7 million; operating income was $49.4 million; and net income was $37.3 million. For the full year, gross profit was $807.6 million. Operating income was $155 million and net income was $140.8 million. In regard to client health funds and interest income, our average daily balance of client funds was $2.5 billion in Q4 and $2.4 billion for fiscal '23. We are estimating the average daily balance will be approximately $2.3 billion to $2.4 billion in Q1 of fiscal '24, with an average annual yield of approximately 410 basis points.  On a full year basis, we are estimating the average daily balance will be $2.5 billion to $2.6 billion in fiscal '24, with an average yield of approximately 420 basis points. Our guidance includes last week's 25 basis point increase, but does not currently include any other changes to interest rates in fiscal '24.  Before I provide our financial guidance, as Toby mentioned, we're updating certain of our key financial targets. Since setting our current targets in August of 2018, our adjusted EBITDA has increased from 21.5% of revenue to 31.9% of revenue, an improvement of over 1,000 basis points. And our free cash flow margin has increased from 12.9% of revenue to 18.4% of revenue, a 550 basis point improvement. As a result of our strong financial performance and the scalability of our business model, we are revising certain key financial targets, which we expect to make progress against beginning in fiscal '24.  In regards to total revenue, our goal of 20%-plus growth remains our target, and we continue to be confident in our ability to achieve this goal. Our adjusted total gross margin target has increased to 75% to 80% from 70% to 75%. Our general and administrative spend target is reduced from 10% to 15% of revenue to 5% to 10% of revenue. Our adjusted EBITDA target has increased to 35% to 40% from 30% to 35%. And our free cash flow margin target is increased to 20% to 25% from 15% to 20%. Please refer to our earnings press release for additional details.  Finally, I'd like to provide our financial guidance for Q1 and full fiscal '24. For the first quarter of fiscal '24, total revenue is expected to be in the range of $314.1 million to $318.1 million or approximately 25% growth over first quarter fiscal '23 total revenue. And adjusted EBITDA is expected to be in the range of $89.5 million to $92.5 million, which represents approximately 250 basis points of leverage over Q1 of fiscal '23. And for fiscal year '24, Total revenue is expected to be in the range of $1.405 billion to $1.410 billion or approximately 20% growth over fiscal '23. And adjusted EBITDA is expected to be in the range of $464 million to $468 million, which represents approximately 120 basis points of leverage over fiscal '23.  As it relates to the broader macro environment, workforce levels continue to be roughly flat in all material respects. This is contrary to what we have historically experienced in a normalized business environment, with recurring revenue typically benefiting from 2 to 3 points of growth driven by broader GDP expansion and workforce levels. Our guidance assumes this trend of flat workforce levels continues in Q1 and fiscal '24 and thereby representing an equivalent of 2- to 3-point headwind to recurring revenue growth. After crossing the $1 billion threshold in fiscal '23 and with continued investments in our go-to-market motion and product road map, we enter fiscal '24 with a high level of confidence in our ability to continue to drive strong revenue growth while simultaneously scaling our business and driving continued adjusted EBITDA and free cash flow leverage.  Operator, we are now ready for questions.\nOperator: [Operator Instructions]. Our first question comes from the line of Brad Reback with Stifel.\nBrad Reback: Steve, if we think about the 18% increase in sales force headcount entering the year as well as the success you're having driving higher ARPU into the base, any reason we shouldn't think of 18% is the absolute bottom and in fact, not being able to do a little better than that on the subscription side?\nSteven Beauchamp: I think if you look at our guidance, it hasn't changed from a philosophy perspective. So we're at the front end of the year and there's a lot of execution in front of us, being able to guide to total revenue of 20% revenue growth, we feel really good about. We've got all the heads on board and up and running, which is always a goal for us at the start of the year. We've got a product suite that we have enhanced pretty significantly. And so we feel pretty good about the momentum.  Certainly, our guidance wouldn't contemplate us being below the 18% on a recurring basis. So I think that's a reasonable way to think about it. But we feel confident in our ability to hit the goals. And I think we have a history of being able to do even better than our initial guidance.\nOperator: Our next question comes from the line of Raimo Lenschow with Barclays.\nSheldon McMeans: This is Sheldon on for Raimo. As your product portfolio grows with adding the new capabilities and talking about the $600 per employee per year target, how are you thinking about revisiting your installed base and kind of the installed base opportunity particularly as we enter a more normalized growth environment? Is there any opportunity to lean more into the upsell motion in '24?\nSteven Beauchamp: Sure. We really started selling back to the client base back in 2018. So we've been doing that for a number of years. And we've been increasing that inside sales team at a much faster rate than the rest of our sales force, really since we started back in 2018. So that team did really well this past fiscal year. We're really happy with their success. We are certainly increasing that team, be on the average 18% headcount, and so it will have a more material impact going into next fiscal year. But it still represents a small portion of our overall revenue growth.  We are still focused on primarily landing new customers and then continuing to enhance our product portfolio, therefore, giving more products for our inside sales team to sell back to the client base. So yes, it's the right way to think about it. That will gradually continue to get bigger, and it is growing faster than our outside sales team.\nSheldon McMeans: Great. And a quick follow-up, if I may. It's nice to see the, I would say, faster than peer generative AI road map. I was just wondering, how are you feeling about AI/ML talent, engineering talent at your organization? And just more broadly thinking about R&D headcount investment.\nSteven Beauchamp: Yes. So I think I'll take the second part first. So from an R&D headcount investment, we've been pretty consistent when you look at what we expense and capitalized being around that 15% of R&D. This is definitely a competitive space. It's a pretty dynamic workforce environment where we have lots of product ideas that we get from our customers and that we feel we can add to the product suite. So we've maintained a pretty steady level of R&D investment when you look at it as a percentage of revenue. And I think that philosophy is what we have going forward. There's lots of things that we think we can do to enhance our portfolio.  On the first part of your question, we really started a data practice team about 4 years ago. And so if you go back, we've had predictive capabilities in our platform around who might leave a customer. We've got our MWI based off algorithms. And so we've had a team that's been investing in that space for a while. I think that's what allowed us to get to market relatively quickly with the generative AI capabilities, both in community and now in job descriptions. And we've got a long list of places where we think we can continue to add those capabilities for our customers.\nOperator: Our next question comes from the line of Bryan Bergin with TD Cowen.\nBryan Bergin: I wanted to kick off with kind of a fiscal '24 growth cadence question. So as we think about what you guided to here in the first Q guide relative to the fiscal '24 growth guide, particularly on recurring. Can you give us a sense where about you anticipate the recurring growth cadence to kind of trough out at?\nToby Williams: Yes. I mean maybe I'll start and Ryan can jump in, too. I mean I think when you look at the first half of the year, obviously, that's where the hardest comps are relative to last year. And I think overall, we feel very good about the guide that we provided going back to Steve's comments a few minutes ago, just getting -- guiding to that 20% mark for the fiscal year. And I think, obviously, like I said, I think the first half is the toughest from a comps perspective. But I think we feel pretty good about the momentum that we have across the business from a recurring perspective.  I'm certainly excited about a lot of the product announcements that we've made and feel pretty good about the adoption that we've seen across the portfolio in the products that we had announced. And I think while it may take -- it's early days for the things that we've just announced, you probably start to see more actual impact from that when you get to the back part of the fiscal year. But I think from a momentum perspective, I feel pretty good about what we're seeing from a sales perspective. We feel pretty good about the momentum we have in new product release and adoption and feel -- I think, overall, I feel very good about being able to guide to 20% for the fiscal.\nBryan Bergin: Okay. That makes sense. And then a follow-up on the long-term target. So it's nice to see the grades on EBITDA and the free cash flow margin. Within gross margin and G&A specifically, can you talk about some of the bigger sources of expansion? Just obviously, understanding natural leverage on broader scale, but are there other key levers you have here to discuss that gives you that confidence?\nSteven Beauchamp: Yes. Sure. I think gross margin, we've consistently expanded since IPO in 2014. And I think the reason for us being able to do that is you hit one of them scale. But I think the second one is a lot of the new products that we've added don't always require the same lift either from an implementation or ongoing service perspective. You think about the 3 additions that we had now, those are all incremental from a gross margin perspective. So as we see our revenue mix shift, some of the newer products we've added, we get a natural lift in gross margin, and that's probably the biggest driver.\nOperator: Our next question comes from the line of Terry Tillman with Truist Securities.\nTerrell Tillman: I guess maybe the first question, just I think in the prepared remarks when you all were quoting some of the stats, mid-teens employee growth, I think you talked about larger customers. Was there anything notable in 4Q about the mix of bookings coming from larger customers and kind of any quantification on is the size of the larger customer increasing? And the second part of this question is based on the 18% sales capacity growth, do you foresee maybe a mix shift from where the business is coming from large, midsize or smaller customers in FY '24?\nSteven Beauchamp: Sure. I think the last part of your question is we did have a mix shift if you go back several years ago. First, we kind of expanded below our original target market. And then we expanded up in our target market. We started to see success upmarket in particular at an accelerated rate, and we put more resources against that. I think that was the case over the last couple of years, but that is probably steady now. We really feel good about the mix that we have in each segment, and we think about the growth rate of the 18% headcount growth being fairly similar across each of the segments.\nTerrell Tillman: Okay. Great. And just the follow-up is on I think there was a comment about workforce level being flat for 1Q. Did you say anything about like the assumption or what you're thinking about for the full year on workforce levels, same thing or any different dynamic?\nRyan Glenn: Yes. Terry, this is Ryan. I think the same approach, and I think we've been consistent with this methodology going back toward the beginning of the pandemic. So we guided to what we can see. And as we said in the prepared remarks, workforce levels have effectively been flat really going back 12 to 13 months at this point. So we assumed flat levels, certainly for Q1, but for the balance of '24, and we'll certainly watch those and update you all as we get deeper into the fiscal.\nOperator: Our next question is from the line of Brian Peterson with Raymond James.\nBrian Peterson: So Steve, I wanted to hit on AI, but maybe through a different lens. I think one of the things that people are talking about is the ability to really accelerate product and software development cycles. So I'd be curious to hear how you guys are thinking about using it internally. And do you think that can have a meaningful difference in terms of either the margins or how quickly you can develop new products?\nSteven Beauchamp: Yes. I think just stepping back, I think AI will impact every part of the business, whether that's how we service customers and onboard customers, whether that's how we're building software products and using generative code, building tools and then where there's capabilities that we can actually deliver to the customer that drives efficiency for them. So we're looking at all aspects of it. We've certainly been actively using that behind the scenes.  I think we've found a lot of success generating test use cases from a code perspective. That's probably where we, kind of, are on that journey. But we are pretty passionate that this is a really interesting opportunity across all aspects of our business.\nBrian Peterson: Great. And maybe just a quick follow-up. I know you mentioned the 18% growth in the sales headcount. Any comments on how the tenure of that group looks and thoughts on expectations for fiscal year '24?\nToby Williams: Yes. Brian, it's Toby. Yes, I mean, I think overall, we came into the year fully staffed, which we're really happy about. That's been the case over the last few years, at least. And came into this year, growing the sales force at 18%, consistent with what we did last year. And I think overall, I feel really good about the mix of talent that we have in that. Certainly, a skew as we would have historically done towards folks coming in with industry experience, which has always been productive for us. And I think we're overall really happy with how we're staffed as we come into fiscal '24.\nOperator: Our next question comes from the line of Patrick Walravens with JMP Securities.\nOwen Hobbs: This is Owen Hobbs on for Patrick. So I'm curious about the -- like the customers' time line to kind of ramping up with product adoption. So if they like, say, start out with the payroll product, how long would it take them to kind of adopt other products in the suite?\nSteven Beauchamp: Yes. So I think you can look at it through 2 different ways. So one is if you -- we talk about the number of employees that we've got kind of on the platform, the average size customer that we have, we give you the employee count, you can really calculate that realized PEPY, which has kind of typically been 50% to 60% of our maximum PEPY. And so that gives you a sense because we bundle and package, that gives you a sense of what they're buying in terms of the total available opportunity.  So there's still lots of opportunity to drive that higher. And so that's probably the easiest way to look at it. I think conceptually, as we build new modules, we definitely feel like that we can get that module into the 10% to 20% range over time. That gives us the ROI and the conviction to be able to kind of build something for customers. Some of our modules are 50%-plus product penetration rate. We've got some still below that 20%. But we've got to have conviction that we can get into that range before we actually build and launch a product.\nOwen Hobbs: Awesome. And then -- so I know this isn't like the main focus right now, but thinking kind of longer term, the expansion opportunity within the business, kind of how much of that is driven by the increase in a customer's employee count versus increasing PEPY via new products?\nSteven Beauchamp: Yes. So historically, in a growth GDP environment, say, GDP was growing 2% or 3%. We would typically get 2% or 3% in our client base of additional employees, which translates to roughly that same revenue growth number because people pay us on a per employee basis. So that was pretty typical. As Ryan mentioned, for over a year now, the number of employees on the platform has been flat. So our clients aren't losing employees, but they're also not adding employees. So there's no necessary tailwind from that.  So really, at this point, when you look at the results we're delivering, there's no help from extra employees on the platform, that all just comes from us selling new customers clearly. And so it's really being driven from selling more to every new customer that's kind of coming on board. And then having that inside sales team I spoke about earlier actually selling back to the client base, that second part being a smaller portion than the first.\nOperator: Our next question comes from the line of Scott Berg with Needham & Company.\nMichael Rackers: Congrats on the quarter. This is Michael Rackers on for Scott today. I was just curious kind of on your thoughts and maybe some commentary around the opportunity with the global payroll space. I mean do you see international kind of as the next stage of growth over the long term? And just what are your kind of thoughts on the general trends there?\nSteven Beauchamp: Sure. Yes. So I think we're definitely squarely focused on the opportunity in the U.S. We still have relatively low penetration in terms of the target market that we're going after. So we see huge TAM that we've got to focus on. And we've definitely got a product set that we think creates differentiation. Where we do see a need to be able to have some global capabilities is when you've got a U.S. headquartered customer, who may have some number of employees abroad.  And so that's why we obviously had purchased Blue Marble and integrated that into our suite, so we can handle that need for customers. So they can Paylocity customer and they can pay their 10, 20, 30, 50 employees abroad through Blue Marble and the network of partners that we leverage. And so that has been our strategy globally. And we'll always look for interesting opportunities, but our primary focus will be U.S.-headquartered companies. And with the size of the TAM that we've got in front of us, we think there's plenty of opportunity there.\nOperator: Our next question comes from the line of Samad Samana with Jefferies.\nSamad Samana: Maybe first one. Just as I think about the bookings cadence or linearity in the quarter. Can you maybe just help us understand how, from April to May to June, trends went, and how does that compare to normal booking seasonality in the fiscal fourth quarter?\nToby Williams: I mean I don't think we saw anything different from a linearity perspective in terms of the bookings coming in. I mean I think, obviously, when you look at -- as I said a few minutes ago, when you look at last fiscal year, you had heavy compares coming in, in the first half. But I think as we got to back half of this last fiscal year, I don't think we saw anything different in terms of seasonality or difference in performance for the quarter or than year-over-year from a sales perspective.  I think the only thing probably note is just going back to comments that we've made over the last probably a handful of quarters and that Steve made a few minutes ago just in terms of how we're seeing incrementally better performance upmarket. But I think that just reflects probably the strength of the solution and what we've done from a product perspective, just being more competitive there over time.\nSamad Samana: Great. And I'm going to ask a sales-related question. I've never worked in sales, so please indulge me if this is a bad one. But I'm curious when you think about just the unit count growth of sales reps. Does it -- does the number of heads matter as much if you're targeting larger deals? Do more reps work on a larger deal? Or is it still the same number assigned, just how should we think about targeting larger customers and sales rep count?\nSteven Beauchamp: Yes. So we have consistently quoted sales reps based off annual recurring revenue and new annual recurring revenue. Now sales reps' natural behavior is they will go for the larger customers because there's more employees there and that give them more new revenue. But the reality is, we also get a significant business through broker referrals. So that's over 25% of our business. So you've kind of got to follow those leads wherever you can find them. You get client referrals, so you kind of follow wherever you go.  So you can't purely just target the larger customers. You've really got to go after what's available to you. And frankly, some of our best reps, they've got great productivity when you look at the unit volume as well as the amount of product that they sell. And the last thing I would say, we also talked about the fact that some of our most experienced reps, we've specialized and having them focus upmarket. So that's another way that we don't get everybody chasing the bigger deals, but we focus on the best and most experienced people to go after those larger customers. And that's been a good formula for success for us.\nOperator: Our next question comes from the line of Mark Marcon with Baird.\nMark Marcon: I've got two questions. The first one is basically, can you talk a little bit about the pipeline that you're currently seeing? How does that compare to a year ago? How active is it? Any reason to think that sales force productivity and conversions wouldn't be as good as they have historically been?\nSteven Beauchamp: That's a good question, Mark. I would say there's no real big call-out when we look at the pipeline. The pipeline is growing nicely as we add reps, and they continue to put more opportunities in top of funnel. It's a little challenging from a history perspective. You think of COVID and all the environment that you came -- you came out of COVID, you had a little bit of a bounce out of COVID in terms of people not having done things for a while.  We're now kind of getting back into a more normalized environment. And so I think as we continue to see the pipeline build and we look at that almost from a pre-COVID level, we feel really good about the activity levels that we're seeing and how we're ramping new reps.\nMark Marcon: Great. And really appreciate the updated financial targets. You're targeting roughly 120 basis points of margin improvement for this year. How should we think about the cadence of the margin improvement towards -- going towards the top end of the target range, when we strip out the impact of float in terms of the interest income?\nRyan Glenn: Mark, it's Ryan. I think if you step back and probably think about the journey we've been on since we set those initial targets 5 years ago in August of '18, I referenced a few data points in the prepared remarks on adjusted EBITDA and free cash flow leverage that you've seen over that period of time. And as you said, we sit here well into the previous targets, and I think continue to have a lot of confidence in our ability to drive leverage, particularly in gross margin and G&A at the same time, as we have historically invested in sales and marketing in R&D.  And I think when you pull that forward to the initial '24 guide on the backs of significant leverage we saw across adjusted EBITDA and free cash flow in '23, setting out that initial guide, as you said, of north of 100 basis points of adjusted EBITDA leverage, and I think that is certainly something that is reasonably close to what our target would be annually. I think we've had years where we started closer to 50 basis points of leverage and through over performance have been able to take the guide up. But I think we feel good being able to start the year at that 20% revenue growth number, at the same time continue to make progress there on adjusted EBITDA.\nOperator: Our next question comes from the line of Alex Zukin with Wolfe Research.\nAleksandr Zukin: I guess maybe I wanted to ask one about the configuration of the guidance for next year. Is it safe to say that we're assuming kind of single-digit -- high single-digit net client net adds for the year, where the bulk of the growth is going to come from larger -- both larger lands and more expense? And then maybe just if you can double click on how much you expect growth for the year to come from the installed base selling compared to where maybe fiscal -- where you ended fiscal '23. And then any comments on just the competitive environment, where you're taking share from increasingly, et cetera?\nSteven Beauchamp: Okay. So maybe start in reverse order. I wouldn't call it anything different from a competitive environment. It's always been very competitive. It's kind of the usual suspects. And really, our point of differentiation come down to the solutions and really providing a very modern experience. So no change there. In fact, we feel good about our road map to be able to continue to compete from that perspective. I think in terms of some of the other points, Ryan or Toby, you want to handle one of the other pieces?\nToby Williams: Yes. I don't think -- I mean, I think to start, I mean, I think in terms of your question in terms of what the mix is from a growth standpoint and across sort of the target market. I mean I think while it's been different every single year, I think we -- with what we're seeing right now, I don't think we have any different expectations for fiscal '24 in terms of the mix of business relative to what we've seen kind of over the course of fiscal '23. I think to Steve's point, the competitive environment tends -- it's always been competitive. I don't think we see any major shifts there. And I think our plan for '24 contemplates largely what we've been seeing over the course of the last few quarters.\nOperator: Our next question comes from the line of Dan Jester with BMO Capital Markets.\nDaniel Jester: I wanted to ask about the $500 PEPY. It seems like a really big step up compared to last year. And so I'm just wondering what lets you this year introduce so much new product? Is it you're just seeing better productivity out of the R&D organization, that the types of products that you're launching or just maybe easier to get into the marketplace? Maybe just help me think about that big step because it seems it's the biggest in several years.\nSteven Beauchamp: Yes, it's a good question. I think we've been pretty happy with our velocity in R&D overall. Sometimes, these things do happen where you're doing a lot of work on the back end. Some products can take you 9 or 12 months to build. You may have other products that are multiyear efforts that you're kind of working on. So the timing of launch can be very different. And so I think what you're seeing is the product of a couple of years of pretty strong work.  And the other thing I would say is we've also focused on some platform capabilities that would allow us to go faster across R&D. And so I feel like the investments we've made over the last couple of years, you're starting to see now in terms of the new product launches. But I think it actually, more importantly, positions us to be able to have high velocity on a go-forward basis, and that's pretty exciting for us.\nDaniel Jester: Great. And then I appreciate the new financial targets, maybe any updates on how you're thinking about capital allocation, inorganic growth going into the new year?\nToby Williams: Yes, I don't think there's any different contemplated from a capital allocation perspective. I think our view has consistently been that we want to use capital to be able to drive growth. Obviously, you're seeing the strength right now, as Steve was just talking through and our ability to organically and deliver product to continue to drive differentiation in the market. But I think -- I don't think there's any substantive change in our view on capital allocation as we think about fiscal '24.\nOperator: Our next question comes from the line of Jason Celino with KeyBanc Capital Markets.\nJason Celino: Just two quick ones. When we think about OpEx and R&D growth for the upcoming year, is the deceleration we're seeing just kind of the return back to a more normalized spending after the few previous years and some pretty heavy investments?\nRyan Glenn: Yes. I mean I think that's right. If you look at the spend levels that we had in fiscal '23. I think total R&D was up about 46%, both in Q4 and then in the full fiscal year. And I think what you'll see as we head into a more normalized environment in fiscal '24, you'll see R&D spend and sales and marketing as well, kind of back to that historical cadence that tracks much closer to revenue growth.\nJason Celino: Great. And Ryan, when we think about the 2 to 3 points of headwind from the staffing levels likely being flat for the coming year, will that be pretty consistent each quarter? I imagine it was, I just want to check.\nRyan Glenn: Yes, nothing I'd call out from a seasonality standpoint. I think it's pretty consistent in each quarter. There's nothing of note from that perspective.\nOperator: Our next question comes from the line of Andrew Warren with D.A. Davidson & Company.\nRobert Simmons: Sorry, this is actually me. This is Robert Simmons on for myself. You touched on the general topic. But more specifically, can you talk about how Blue Marble is performing in terms of helping you win new clients and for cross-sell?\nSteven Beauchamp: Yes. So we've called out the success that we've had up market, and that is where you run into more international opportunity, so customers might have employees in multiple countries. And so definitely Blue Marble has been a component of our product suite that has created some nice differentiation upmarket. So if you're a customer and you've got 1,500 employees and you have 50 employees in 3 different countries, we've got a great solution for you. We can handle everything that you need.  And that does become a differentiation point in terms of us selling those customers. And so I think it's been a nice contributor upmarket. It continues to grow as well when you look at the risk stand-alone revenue that we bring in from those opportunities. But the biggest thing is really focused on the differentiation upmarket.\nRobert Simmons: Got it. That makes sense. And then, great to see the revised long-term targets. Do you have a time frame for when you think you can achieve those and get into those ranges? And then also, how long do you think you can maintain 20%-plus growth?\nRyan Glenn: Sure. Maybe I'll hit the second part and let Steve hit the last part of your question. I think when we set the previous targets in August of '18, I think we're 5 years later, and we were well into those ranges. So I think that's probably the right way to think about it. We don't have a specific year that we'd expect to hit those. But I think at the same time, our expectation would be we'd continue to make progress beginning in '24 on an annual basis towards those revised targets. So continue to have a high degree of confidence in being able to grow the business at a healthy rate, at the same time, scale across the business as well.\nSteven Beauchamp: And in terms of continuing to grow at 20%, I think Toby mentioned earlier, we're definitely focused on growth as a big priority for us and what's going to drive that. We're going to make the investments in product. We talked about how we're excited about what we've got coming out. We have a rich product pipeline. That is one of the key elements that gives us some confidence on being able to focus on that.  Bringing in the talent from a sales perspective, 18% headcount increase puts us in a really good position to be able to drive that. Huge TAM, right? We've got relatively low penetration in terms of the opportunity. So it really comes down for us to be able to kind of execute. Size of the opportunity is big enough. We've got enough product differentiation. We've got a great pipeline.  And so -- and I think as Toby mentioned, we have strategically made some smaller acquisitions that also have enhanced our capability. I just answered the question around Blue Marble. And so when you put all that together, I think that's what gives us confidence in terms of being able to continue to grow at 20%-plus.\nOperator: Our next question comes from the line of Siti Panigrahi with Mizuho.\nSitikantha Panigrahi: I wanted to ask about on-demand pay. That's on something you announced long back. And now most of the -- most of your competitors have that solution. How important is that for your customer? Like what sort of -- we haven't heard from you any kind of traction there. Are you trying to revamp that product? Is it more to help you win? Or is that really generating revenue? Any color on that?\nSteven Beauchamp: Yes. So we were one of the first to market with our on-demand pay product. So we've had that available several years. And I would say that the customers that really see value in that often have larger hourly populations where they will actually request early access to their wages fairly frequently. And so that product worked really well for us. We've made, based on customer feedback, some enhancements to the product on an ongoing basis. The product is doing well.  I think from the first date that we launched it, I never said this was going to be a big needle mover. I really characterize it as a nice feature that customers could take advantage of. And I think that's kind of how it's played out for us overall. But I do think you need a product like that and customers are getting value from it, but it isn't a big driver for us.\nSitikantha Panigrahi: All right. And then I want to ask about the AI assets like you guys announced that in March. Any feedback from our early adopters? But broadly, I want to ask how do you think this HR and payroll industry will evolve as we start seeing this AI adoption? And where do you see an opportunity to monetize for that?\nSteven Beauchamp: Sure. I think if you just take a step back and you think of some of the big challenges that HR teams have. You've got a very dynamic workforce, Gen Z entering the workforce, gig work increasing, globalization kind of back on track and increasing as well. And so it's just a complicated environment for HR teams to really get the talent that they need in a fairly tight labor market.  And so I think when you then overlay that with AI, AI creates opportunities for efficiency for HR teams. It creates opportunity to then use that time from efficiency to be able to drive a more engaging environment and actually really compete on a culture basis. And so we see our early clients doing that. So they're communicating more with their employees. They're driving engagement. We've got a ton of use cases that we plan on rolling out over time that will make it so much easier for communication, engagement, culture-building initiatives. And I think that's going to be really important for our clients as they attempt to win the war for talent.\nOperator: At this time, I would now like to turn the call back over to Steve for closing remarks.\nSteven Beauchamp: Well, first of all, thank you to all of you for dialing in and having interest in Paylocity. And I just want to kind of restate my thank you for all of our Paylocity team members, 6,000 strong, that delivered a fantastic fiscal '23 and looking forward to another great year in FY '24.\nOperator: Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect."
  }
]