[
  {
    "symbol": "PCTY",
    "period": "Q2",
    "year": 2023,
    "date": "2023-02-02",
    "content": "Operator: Hello, and thank you for standing by. Welcome to Paylocity Holding Corporation Second Quarter 2023 Fiscal Year Results. [Operator Instructions] I would now like to hand the conference over to your speaker, Ryan Glenn. You may begin, sir.\nRyan Glenn : Good afternoon, and welcome to Paylocity's earnings results call for the second quarter of fiscal '23, which ended on December 31, 2022. I'm Ryan Glenn, Chief Financial Officer. And joining me on the call today are Steve Beauchamp and Toby Williams, co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements.  Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, I will be attending the Stifel Executive Summit in Florida on March 6 and the Raymond James Institutional Investor Conference in Orlando on March 7 and Toby will be attending the JMP Tech Conference in San Francisco also on March 7. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp : Thank you, Ryan, and thanks to all of you for joining us on our second quarter fiscal '23 earnings call. Our differentiated value proposition of providing the most modern software in the industry, coupled with continued strong execution, resulted in excellent Q2 results and increased full year guidance. Total revenue was $273 million or 39.3% growth over Q2 of last year and exceeded the top end of our guidance by $12 million. Our continued strong sales momentum is the result of ongoing investments in product innovation, including leveraging last year's acquisition of Cloudsnap, a flexible low-code solution for integrating disparate business applications. We have fully integrated Cloudsnap into the Paylocity suite and are leveraging this technology to provide the most modern software in the industry to accelerate the role of new integrations and use cases to better serve our clients and their employees. To date, we developed nearly 2 dozen next-gen integrations across ERP, point-of-sale, time and labor and expense-related software that allow our clients to experience better data consistency by sharing employee benefits, financial and other key data elements more readily across their HR and other critical business systems. In addition, Cloudsnap's low-code integration capabilities has accelerated the extensibility of the Paylocity platform, helping to drive differentiation and incremental value to clients by positioning employee data and the Paylocity platform at the center of their application ecosystem. We continue to see strong attach rates in our modern workforce solutions as clients realize the value in creating a unique employee experience and engaging culture for remote, hybrid and in-office teams. Community and premium video whose new features centered on creating and sharing files, automating team groups and centralizing video management have allowed our clients and their employees to use our application in ways that stretch beyond traditional HCM functionality. This dynamic is reflected in our utilization metrics, where community monthly active users post and announcements continue to demonstrate strong growth on a year-over-year basis. Similarly, the number of videos created and played within our premium video offering continue to grow faster than the overall business as clients look to increasingly connect and engage with their employees through mediums that are more engaging than traditional e-mail. Our continued success in the market and commitment to product innovation continues to be recognized by third parties as Paylocity was recently named an overall leader in all 12 HRIS product categories in G2's Winter 2023 Grid report, including the number 1 overall leader in several categories, such as core HR, HR management systems, performance management and learning management. Similarly, the strong culture at Paylocity continues to be recognized externally as we receive the 2023 Built-in Best Places to Work award. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams : Thanks, Steve. Our focus on driving higher employee engagement, collaboration and connection once again contributed to strong results in Q2 as these underlying tenets of our modern workforce solutions have continued to drive increasing utilization of these products as we exit the pandemic. This dynamic was evident in Q2 across a wide range of clients, including an auto dealer with 1,200 employees across 22 locations that has seen employee survey participation increased to more than 70% since the rollout of Paylocity surveys, which directly led to updates on their fringe benefit policies and higher employee engagement. Similarly, an outdoor furniture manufacturer with over 1,800 employees has seen over 90% of its employees engage with the Paylocity mobile app to communicate, collaborate and recognize their peers. Combined with the ongoing investments we are making across our broader product suite, this commitment to innovating and building the most modern software platform in the industry contributed to strong sales execution in Q2 and helped set us up for a strong second half of fiscal '23. Consistent with the prior quarter, interest income on client funds continues to rise as a result of sustained interest rate increases from the Federal Reserve. Given the large market opportunity in front of us, we continue reinvesting a portion of this upside back into key areas of the business to help drive future growth. In addition to continuing our investments in digital marketing and our channel initiatives, which once again, delivered more than 25% of our new business in Q2, we will continue to incrementally invest across our product suite to further innovate and deliver the most modern software platform in the industry. This is also a very busy time of year for our operations teams as they work closely with clients on year-end processing of payrolls, W-2s, 1095s and annual tax form filings to federal, state and local agencies and the implementation of new clients. I want to thank all of our employees for their hard work and dedication to our clients during this very, very busy time of year.  I'd now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal '23 guidance.\nRyan Glenn : Thanks, Toby. Total revenue for the second quarter was $273 million, an increase of 39.3% with recurring and other revenues up 31.4% from the same period last year and $14 million ahead of our guidance midpoint. Our adjusted gross profit was 72.4% for Q2 versus 68.7% in Q2 of last fiscal, representing 370 basis points of leverage as we continue to focus on scaling our operational costs, while maintaining industry-leading service levels. We continue to make significant investments in research and development and to understand our overall investment in R&D is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 38.4% when compared to the second quarter of fiscal '22 and we remain focused on making incremental investments in R&D throughout fiscal '23 as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities, on a non-GAAP basis, sales and marketing expenses were 23.7% of revenue in the second quarter, and we remain focused on making incremental investments in this area of the business in fiscal '23 to drive continued growth. On a non-GAAP basis, G&A costs were 11.3% of revenue in the second quarter versus 13.3% in the same period last year, and we remain focused on consistently leveraging our G&A expenses on an annual basis. Our adjusted EBITDA for the second quarter was $77.4 million or 28.3% margin and exceeded the top end of our guidance by $10.9 million and represented 450 basis points of leverage versus Q2 of fiscal '22. We continue to be pleased by our ability to drive increased profitability through leverage and adjusted gross margin, adjusted EBITDA and free cash flow while also maintaining strong revenue growth. Briefly covering our GAAP results. For Q2, gross profit was $182.9 million, operating income was $18.2 million and net income was $15.6 million. In regards to the balance sheet, we ended the quarter with cash and cash equivalents of $120.1 million and no debt outstanding. In regard to client-held funds and interest income, our average daily balance of client funds was $2.3 billion in Q2. We are estimating the average daily balance will be approximately $2.7 billion in Q3 with an average annual yield of approximately 320 basis points. On a full year basis, we are estimating the average daily balance will be $2.4 billion with an average yield of approximately 280 basis points. Additionally, please note that our guidance includes the impact of this week's 25 basis point interest rate increase and also assumes an increase of up to 25 basis points in March. In regards to client workforce levels, the number of client employees on the platform was flat in October, November, December and January on a sequential basis in each month, and as a reminder, was up only modestly on a sequential basis in Q1. Our guidance assumes client workforce levels to be flat for the remainder of the fiscal year. Finally, I'd like to provide our financial guidance for Q3 and full fiscal '23, which assumes no further changes in client workforce levels in the back half of this fiscal year. For the third quarter of fiscal '23, total revenue is expected to be in the range of $330.5 million to $334.5 million or approximately 35% growth over third quarter fiscal '22 total revenue. And adjusted EBITDA is expected to be in the range of $121.5 million to $124.5 million. And for fiscal year '23, total revenue is expected to be in the range of $1.156 billion to $1.161 billion or approximately 36% growth over fiscal '22, and adjusted EBITDA is expected to be in the range of $358.5 million to $362.5 million, which represents 320 basis points of leverage over fiscal '22. In conclusion, we are pleased with our Q2 results and the strong momentum we have carried in the back half of fiscal '23. With our fiscal '23 guidance of approximately 36% revenue growth at the midpoint and adjusted EBITDA margins of 31%, we are firmly above the rule of 60 in fiscal '23. We remain committed to continuing our history of driving profitable revenue growth while also increasing adjusted gross margin, adjusted EBITDA and free cash flow on an annual basis. Operator, we are now ready for questions.\nOperator: [Operator Instructions] Our first question comes from the line of Scott Berg with Needham & Company.\nScott Berg : I've got two here. We're seeing a little bit of weakness from some other SMB companies or software vendors focused on market a little bit. Any color in terms of what you're seeing around customer adds in the last quarter, maybe relative to your expectations year-to-date?\nSteve Beauchamp: Yes. Sure, Scott. So we had a really good first half of the year overall. And I think even Toby mentioned talking about some of the sales momentum that we've had in our busy selling season and that allowed us to significantly raise the year. I think we have an advantage being the HCM business, payroll is something that every single company has to do. For us, it all starts with payroll and using the data from being payroll to be able to connect to the rest of the suite and obviously sell a much broader solution today. And so we've had continued success in terms of adding new units, and we've also had success in terms of selling more product and also even more success upmarket as we kind of called out over the last couple of calls.\nScott Berg : Got it. Helpful. And then from a follow-up question, I know Ryan had mentioned that your R&D expense is up roughly 38% year-over-year. That's faster than your revenue growth right now. And I've called out many times, so I think your product innovation is driving your -- at least what I think there's some preseason win rate improvements over the last 2 years for the company. But how should we think about R&D investments going forward? Do you continue to step on the accelerator in a similar manner as you have been recently? Or is that an opportunity to maybe gain some financial leverage over because you're starting to, I don't know, hit as much product as you need to say.\nSteve Beauchamp: Yes. I think, Scott, our point has always been a combination of adding new units, landing those customers and then expanding the number of products that we've got. I think we have been fairly consistent being close to our revenue growth in terms of our investments in product and technology. We never viewed that as a big leverage point, we look for leverage elsewhere. We see big opportunity to add more modern capabilities to the suite additional products and revenue opportunities to the suite. And we certainly have not signaled any intention to be looking for leverage there, we think there's a fair amount of natural leverage in the business model in many other places as we scale. So I think the same approach as we've taken historically.\nOperator: Our next question comes from the line of Brad Reback with Stifel.\nBrad Reback : Steve, as you talked about sort of customers using the product in new use cases, is there an opportunity for new ways to monetize going forward beyond just per employee per month?\nSteve Beauchamp: Yes. I think that's a great question, Brad. We called out the Cloudsnap acquisition, the ability for us to integrate in our marketplace. We really view the data that we have about people to be really valuable to our customers, both from an automation perspective. But as we integrate with their broader suite of software that they're using to run their business, there certainly could be additional monetization opportunities. We are seeing that a little bit in the marketplace. We're at very early stages of continuing to expand the number of providers and leveraging the data that we have. So I don't think that -- all of our revenue has to be PPM, I think most of our revenue will continue to be PPM. But there's some opportunity for us to be able to leverage marketplace to potentially drive some referral revenue back to Paylocity as well.\nBrad Reback : That's great. And then one quick follow-up. I know it's still really early in sort of the adoption curve across a lot of these newer products. But do you have any appreciable data yet on higher retention rates for customers that are consuming more of these nontraditional HCM products?\nSteve Beauchamp: Yes. I would say that higher utilization, both in terms of the number of products that they use and then how much frequency their employees are logging in does translate to higher retention. It is a small difference. Quite frankly, there's a lot that goes into retention, right? The service elements are really important as well. But overall, we have historically segmented the customers based on utilization and number of products, and we've seen the customers who take advantage of the broader suite staying with us a little bit longer.\nOperator: Our next question comes from the line of Bryan Bergin with Cowen.\nJared Levine: This is actually Jared Levine on for Bryan. In terms of the demand environment, was there any change in 2Q or through January in terms of the pace of prospective client decision-making.\nSteve Beauchamp: Yes. I can start with that, see if anyone else wants to add color. I think we were really happy with our sales results for the first half of the year and into our very busy January selling season. That's obviously what allowed us to be able to raise the year and so both top-of-funnel activity in the larger end of the market, our core marketplace and even down market has been pretty strong. We definitely are seeing the modern suite the newer capabilities, the video product, community, survey, LMS, all really resonating even in a post-COVID environment where -- our clients are dealing with hybrid workforces. They're dealing with the demand more flexibility. Gen Z continues to grow in the marketplace. And so we would certainly credit to the combination of service and differentiated product as to our success that we've had so far.\nJared Levine: Okay. Great. And then in terms of your client conversations, has the ROI and the payback period of your offerings increasingly become a focus with prospective client conversations? And how do you generally view the typical payback period with the average client?\nToby Williams: Yes. I think -- so maybe a couple of different points on this. I mean, there's no doubt that with the type of product, the type of software that we're offering in the market, there is an appreciable ROI that comes from both modernization and automating what would otherwise be manual tasks for folks. I think though, the core of the value prop that we're really focused on from a client or from a prospect pitch standpoint is really around the breadth of the platform, focusing on the fact that we do have the most modern platform in the industry and talking to people about what we can deliver from a value proposition standpoint that is certainly with the core of payroll, certainly with the core of the HCM suite, but really getting into all the things that we're offering that really go beyond the traditional HCM suite, whether that's things like community or what we're doing with the modern workforce index as we continue to expand the product set with things like Community Plus, what we're doing with video surveys and LMS really getting towards engaging with employees and giving clients the ability to engage with their employees in a more modern and differentiated way. So I think that's really the core beyond an ROI conversation of how we're having those types of client or prospect conversations in the market.\nOperator: Our next question comes from the line of Terry Tillman with Truist.\nTerry Tillman: I have a question and then a follow-up. And dangerously I guess my creative juices are flowing. You all help the idea of a modern platform and clearly, payroll, core HR and then talent management, you've got a lot of those capabilities, you keep adding more R&D. But what I'm curious about is I've been hearing software companies talked for a number of quarters now about this aspirational glove vendor consolidation, and that will benefit their business. So whether it's a premium video community, surveys, LMS or just talent management bundles, I'm not suggesting you're going to shift from trying to go after new logos, but is there an incremental opportunity to almost have kind of a tactical selling effort back to the base to really drive kind of a vendor consolidation playbook?\nToby Williams: Terry. Yes, so I mean, I think the main part of our motion from a go-to-market perspective has certainly been in terms of landing new units. No doubt about that. And I think what we're seeing as we do that is new clients onto the platform have tended to take a broader part of the suite, which we feel good about. I think though -- to your question, we have also had a distinct motion going back into the customer base as we've expanded the product set going from $200 for the full product set at the time of the IPO to where we sit over $400 today, [440]. I mean we have an opportunity to sell product back into the customer base, and we do have a dedicated team that does that. So I think what you've seen from us is, over the course of the last 4 years primarily set up and I think invest more in that back-to-base motion. And I think we've seen a reasonable amount of success with that.\nTerry Tillman: Okay. It sounds like that's still going to be secondary, maybe more opportunistic, but maybe a future call option.\nToby Williams: Well, I think just given the relatively low sort of share of a relatively large market that we have, I think we have put the bulk of our go-to-market motion in terms of landing new logos and new units. And I think that just reflects the size of the opportunity that's out there in front of us.\nTerry Tillman: Yes. Yes. Sounds good. And I guess the follow-up question is up on the upmarket. I always like hearing examples of the auto dealership and then the furniture manufacturer. As you continue to iterate on your platform and you have more capabilities, whether it’s 1,000 employees plus or do you feel like you could keep getting pulled higher up in the market? Or what could you share a little bit strategically how you think about that kind of upmarket opportunity over the next 2 to 3 years?\nSteve Beauchamp: Yes, sure. It’s a good question. We’ve always focused on as we build new products, we build the capabilities that we think our average sized customer a little more than 100 employees we really need. And then what happens is as we get more customers, we see more demand from our customers and we really kind of live in product and technology on the ID of customers of cocreator. And so they request features and we continue to enhance the product. We keep teams in an agile fashion, constantly building on top of that product and the product gets richer in terms of the feature set. And that starts to appeal to larger customers. And so what you’ve seen over time is as our talent modules have matured, as we’ve added some of these newer modern capabilities, we are starting to see differentiation even upmarket where they are starting to think about how do they engage employees and going beyond automation. We don’t think that, that goes to the moon, quite frankly. We’ve just increased the target market about a year ago or so, and we’re having success in that marketplace. So it’s possible that, that stretches a little bit over time, but I would be more focused on what Toby just said, which is we’ve got a really big opportunity in the market that we’re in very low market share. And so we plan on focusing on capturing many customers in our existing target market is possible.\nOperator: Our next question comes from the line of Mark Marcon with Baird.\nMark Marcon : Congratulations on a strong quarter. Steve, Toby, you talked a little bit about CloudSnap just in terms of prepared remarks and in the press release. Can you add a little bit more dimensionality with regards to how that's helping in terms of getting new clients? What are you seeing from a sales productivity perspective? And what are some of the integrations that are the most common that you're seeing that you weren't able to do before that you can do now and that's really adding to the sales momentum.\nSteve Beauchamp: Sure, sure. So Mark, we've had kind of a marketplace where our clients can connect disparate applications to the employee data that we have. And certainly, we can do that in a real-time fashion from an API perspective. And we do that with some of our larger providers that get asked more frequently. On the flip side, you've also got customers who may have vertical market applications or whose applications may not be quite ready for real-time API capabilities. And then it takes a while to build those integrations, and we've got a team with technical services team who's been doing this for years. Cloudsnap really enables that team to operate so much faster using the low-code capabilities that they bring to the table. And so we can configure integrations so much faster, and they also become much more scalable on a go-forward basis using that technology. And so for us, it really opens up the landscape of number of providers that we can integrate with and it also gives us increased speed to market for those integration and longer-term scalability.\nMark Marcon : Great. And does that help you more in the upmarket or the mid-market? Or how would you describe that.\nSteve Beauchamp: All the way across. Certainly, upmarket clients are definitely demanding integration into their disparate system. But even if you've got 35 employees, you'd love that connection into your accounting system as well. And so the scalability portion really helps downmarket in terms of us to be able to scale that to a broader set of customers. Upmarket, we may find vertical market applications that don't necessarily have horizontal penetration across all of our markets. Using Cloudsnap, we can get those vertical market application, ERP integrations up relatively quickly as well. So I think it's really helpful across the entire target market.\nMark Marcon : And so are the ERP integrations the most common that you're seeing now? Or what would be the most common?\nSteve Beauchamp: Yes. So I think broadly speaking, ERP applications would be one of the most common areas and certainly, the accounting portion of that is a key integration. But if you think about it, employee data ends up being kind of at the center of many workflows and processes at an organization we know when people are hired. They know in the term, they know the supervisory changes. We know a lot of information about the employees that, from a workflow perspective, you can power into other applications and create even more automation for clients. So although we're seeing a fair amount of demand in ERP, point-of-sale systems is another great example, vertical market applications, another great example. And so we're seeing a fair amount of demand, and we're excited about fill that demand with Cloudsnap capabilities.\nMark Marcon : Okay. Great. And then my follow-up is, just on the float, the effective yield, you didn't give the effective yield for the second quarter. I'm assuming it's somewhere around 290 basis points. Is that right? And can you remind us what it was during the first quarter in terms of the sequential increase. And you did give us the float expectation for the for the third quarter. I'm just wondering to what extent that seems a little on the conservative side.\nRyan Glenn: Sure, Mark. I can take that one. So first quarter average daily balance was about $2.1 billion, and the annual yield was 1.5% or 150 basis points. Second quarter, you had it right, about 290 basis points of yield. So you saw that big step up following the September and November Fed rate increases. Third quarter, as we outlined in the prepared remarks, a $2.7 billion plant held fund balance average there, 320 basis points of annual yield and I think if you do the math in the fourth quarter, we're expecting about $2.6 billion of client funds in the fourth quarter with about 3.4% to 3.5% annual yield.\nOperator: Our next question comes from the line of Samad Samana with Jefferies.\nSamad Samana : Maybe first one, just around the numbers themselves. If I think about the F 3Q guidance, it kind of gives us an early peek into F 4Q and I know the world is changing right underneath our feet at all times, but it implies kind of a low 20s recurring revenue growth rate. You guys have been growing well above that. And we're big fans and there's a lot of momentum behind the business. I'm just kind of thinking, should we expect growth to -- is that conservative because of macro? Or is that just the comps get tougher? Or is that just -- how should we think about that, especially in the context of where the business momentum has been and where it was prior to COVID?\nToby Williams: So I guess the way I would think about this is if you go back to the fiscal year prior to COVID, we were in that sort of mid-20s-ish performance range from a recurring revenue growth perspective. And at that point in time, we were guiding in the low 20s. And I don't think our guidance philosophy has changed from then until now. And what we had talked about at that point in time was continuing to operate the business and drive the business and invest in the business to be able to come out the other side of everything that was pandemic related with similar growth profile. And I think that's what we've talked about over the course of the last handful of quarters is as you start to get clear of some of the noise in the comps which we thought would be the back half of this fiscal year and in particular Q4, you would start to see more normalized growth rates that probably start to look a lot like they did pre-COVID, certainly in a much bigger business. But -- and I think that's what we're starting to see. I mean if you sort of unpack some of the dynamics there, Ryan called out that we are seeing really flat performance from an employee on the platform perspective. We have continued -- so that has been a tailwind starting to comp some of those increases and so that starts to flatten out. I think you also -- from a demand perspective, Steve made some of these comments, we have continued to see a reasonably strong demand environment. The sales execution has been good, which we feel good about. I don't think you're seeing any -- I don't think we're any -- displaying any particular conservatism as it relates to the macro. We're certainly aware of the macro concerns. But from a performance perspective, have continued to see a strong demand environment. I think you're just starting to see us normalizing in Q4 back to pre-pandemic level of growth rates as we get through some of the noise that was in the comps, which is pretty consistent with how we've talked about things over the last handful of quarters.\nSamad Samana : Great. And then maybe a follow-up for you, Steve. As I just think about the company's evolution and some of the questions you've gotten before this. Are you getting both a -- obviously, your primary advocates turn out to be the HR department, but are you getting more in different buyers inside of the organization. Is that giving you access to maybe more dollars or budget that may not have been previously thought of going through that department? Or is that they're able to allocate to you? How should we think about that?\nSteve Beauchamp: It's an interesting question. I think the buyers for the most part, have stayed very much the same, meaning it's typically your Head of HR and also your CFO as part of that decision-making process. Historically, we would involve CEOs at times, but it would probably be more from an approval perspective. I would tell you that we've had better CEO conversations when we start talking about how you engage employees like you drive retention, how you're driving productivity in employees with things like LMS, how you're gathering feedback and making changes based off that feedback. So this engagement concept really does appeal to a CEO. You think people are the most important asset of any company. And so the ability to onboard new employees to drive productivity to make sure that retention is high to attract talent, I think we definitely -- although the HR and CFO buyer are still the key buyers, I think we've extended the value proposition such that we've got more conversations and access to the actual CEO.\nOperator: Our next question comes from the line of Brian Peterson with Raymond James.\nAlex Sklar: This is Alex Sklar for Brian. I know the current quarter rents normally a big hiring quarter. Just want to see if there's any change at the margin to your hiring plans relative to what you had laid out the last couple of quarters.\nSteve Beauchamp: Yes. I would say it's a little bit different by department. But if you think of sales, it's really post year-end. So as we start to hit the spring time frame. So this month in February and March that things really ramp up and we start to put our planning process for next fiscal year and start ramping up sales headcount. So we're fairly early in that, we sometimes get off to a little bit of a head start when we can, and we always do that opportunistically, but the hiring season is really ahead of us. I think really good success from a product and technology perspective, great retention in that group. You can see we've had pretty good year-over-year increase in investments there. We're excited about the pipeline to that organization. And we went into the year-end, really fully staffed just from an operations perspective because it's a really important time here to be there for our customers and to be able to deliver the service that they need. So overall, we feel really good about the staffing levels and the employee value proposition that we're selling in the market, a growth company in the software space that's not looking to reduce expenses, but looking to develop talent and promote people and continue to grow really resonate. So we've been really happy with our ability to attract and retain talent.\nAlex Sklar: And I also want to follow up on Terry's market question earlier. So I'm curious, can you help frame kind of the percentage of your pipeline? I don't know, either in terms of MRR or if you have a different preferred metric, but that's coming from those upmarket opportunities now versus a year ago?\nSteve Beauchamp: Due to annual recurring revenue, we don't necessarily break that apart by any specific segment. But if you think of our historically our [indiscernible] kind of 30, 40 employees to 500 employees, that's where we still get the majority of our new recurring revenue. The larger end of the market certainly is growing really nicely. We've called that out really over the last several quarters that continues to be success. And we continue to get traction down market as customers are starting to look for those new capabilities. So think about the majority of our revenue still coming from the core market that we focused on, really from the beginning.\nOperator: Our next question comes from the line of Matt Pfau with William Blair.\nMatt Pfau: Okay. Great. Just one. I wanted to ask on the employee growth within your customer base and the comments that, that was flat and expected to be flat. Anything to read into that in terms of the health of your customer base? Or is this just sort of a more return to what you would see in a normal labor environment?\nRyan Glenn: Sure, Matt. I can take that one. I think if you think about the guidance philosophy we've had all the way back to the start of the pandemic, Obviously, there's been a lot of uncertainty over that period of time. And I think the approach that we've taken is we've guided to what's in front of us, and we've done that here again this quarter. As I outlined in the prepared remarks, workforce levels have effectively been flat since August and up modestly in July, and that's our expectation for the balance of the fiscal year. To the extent things get a little bit tighter, we see some expansion in the other way. I think that's sort of the movement within the guidance range. But sitting here today, coming off of a really strong selling season and a great January, I think we feel good about where the overall revenue guidance sits and obviously watching the macro closely but have not seen any impact within the client base. And likewise, from a sales perspective, continue to feel really good about the demand environment.\nOperator: Our next question comes from the line of Daniel Jester with BMO.\nDaniel Jester: My guess is that at this point, Blue Marvel is probably pretty well integrated into the platform. You've got Cloudsnap now out there. I guess it frees up potentially some bandwidth internally for inorganic growth opportunities. So Steve, Toby, would love to kind of hear how you're thinking about inorganic in the year ahead.\nToby Williams: Dan, yes, I mean, I think just in terms of those two, I think the press release that we put out certainly feel really good about what we're doing with Cloudsnap. Steve made some comments earlier just around what the capabilities that, that's giving us from an integration platform perspective. And so really happy with how that's worked out and the value that's been able to add in the process. I think Steve made the comments on the last quarter call that we're still in the process of fully integrating the Blue Marble capabilities into the platform. And I think that's typical of how we would sort of approach any acquisition that we do, the processes that we bring something in and we'll then spend the time which could take anywhere between 12 and 24 months to fully bake capabilities into our platform in a seamless way from a user experience perspective, from a data flow perspective. And so the teams are still working on that and feel good about the progress so far. Certainly, we continue to have the overall bandwidth to look at acquisitions that might be interesting. I think our point of view historically remains the case today. We would prefer to always develop the next capability that we want to push out from a product perspective. But I think we've also taken advantage of, in certain instances, the ability to accelerate things that might be really strategic to us, that it might be on the product road map by way of what's largely been, I would characterize as smaller product-oriented or technology-oriented tuck-in acquisitions. And I think that strategy and that viewpoint remains the case.\nDaniel Jester: Got you. That's helpful. And then -- maybe just a quick one on the integration. What percent of your customers actually have an integration today connected through Paylocity? Just wondering to kind of see what the overall penetration and how that could actually look over time.\nSteve Beauchamp: Yes. I don't know that off the top of my head, quite frankly. A lot of our customers have integrations for a wide variety of things. So 401(k) integration, as an example, Benefits integration would be another point of integration. And then you get into all this stuff, I mentioned prior ERPs and so on and so forth. So I think there's an opportunity to expand the number of integrations to the way I think about it. I would imagine we would have to see a future where every client has at least 1 integration. And over time, we want to actually drive the number of integrations so that they can really leverage the people data that we have. And in a real time, workflow capability. They know when something changes about that person, that will then enable 1 of their processes to create automation and create an opportunity to have higher levels of engagement. And so our viewpoint is clients, we want to integrate with all of the systems that they use to run their business that lever people data. That's the goal and objective.\nOperator: Our next question comes from the line of Arvind Ramnani with Piper Sandler.\nArvind Ramnani: Good set of results. My first question is really about this kind of investments you have made over the past few years on making your HCM solution more employees intact and driving engagement. You're certainly collecting a lot of data. Are you able to sort of feed back some of the data to your clients? Are they seeing value in it. And down the road, do you expect that may drive some revenue growth in the longer term?\nSteve Beauchamp: Yes, it's a great question. We've been investing for several years now kind of in machine learning, artificial intelligence capabilities. You see that surfacing our product already in a few different places, and we do see many more opportunities as well. So one is our modern workforce index, where we look across our clients, and we score customers based off how engaged they are in our platform. And we know the higher the score, the more employee retention they have. And we do that even by vertical markets. So we compare hospitality to other hospitality. And then as they start to use more of the product, they see their score's going up, so the recommendation engine behind that starts to give them ideas on how they can get more value out of the product. We also will surface recommendations even to employees around people that they might want to connect with, that they might want to communicate, that they might want to follow a community that's certainly another place. And then lastly, I would just say our dashboards and insights is another place that we try to surface that. But as technology continues to advance, we see this being another opportunity to modernize our suite in pretty much every single module, leveraging newer technologies and artificial intelligence and machine learning.\nArvind Ramnani: Perfect. And does this like sort of help your win rates? Or is it at this stage? And do you think it could drive like revenue growth? Like are you able to [indiscernible] for this at the data point.\nSteve Beauchamp: It's a good question. I think today, it's largely driving win rates and it's creating differentiation in the marketplace. And I think, as Toby mentioned earlier, when you've got such a huge TAM in front of you and a market opportunity, that's really important to have differentiation. I think that capability can be a component of new offerings that we have. I'm not sure we see at least in the immediate future that we would charge for a separate SKU on some of these capabilities. But as we launch new products, being able to incorporate things like recommendation engine, leveraging all the data that we have across the organization, get our clients to see best practices and implement new more modern capabilities. That's where we see the more immediate opportunity than maybe a separate monetizable products.\nArvind Ramnani: Yes, having followed Paylocity for several years now. I know even in 2018, '19, when you introduce community, it was free and then I appreciate your patience on trying to monetize first introduced brain adoption, I monetize I think that's a good approach. Just a couple of quick other questions. One is on this kind of employment levels, I mean, are you able to quantify how much of your growth comes from basically increased employment at existing clients? I know in the past, you have kind of outlined rate increases offset any sort of employment pressures. But are you able to quantify like over the last couple of years, how much of your growth has come from employee expansion at existing clients?\nRyan Glenn: Sure, Arv. I can take that one. I think if you think about in a normalized environment with a growing GDP, you may get 1 point, maybe 2 in a normal period with client workforce levels. Obviously, over the last 3 years or so, you've seen significant movements both ways. I think if you anchor back to the pandemic, we talked about up to a double-digit impact on recurring revenue in fiscal '20 that bled over into fiscal '21. And then again, I think if you look at where we were from a spring of '21 all the way towards the summer of 2022, we saw nearly every single month sequential improvements. And as we talked about each of those quarters, that has been a reasonable tailwind and you've seen outsized recurring and total revenue growth over that period of time. To Toby's point earlier, as you think about the back half of the fiscal year, year-over-year, there's still a little bit of a tailwind here in the third quarter. As you get to the fourth quarter, I think we've really fully anniversaried all of the client workforce levels improvements that we've seen over the last handful of years. And you get back to that kind of low 20s or so recurring revenue growth. And as we sit here and think about fiscal '24, continue to have a lot of confidence around go-to-market motion and our ability to continue to drive 20% plus as we get back to that more normalized employment environment.\nOperator: Our next question comes from the line of Alex Zukin with Wolfe Research.\nAlex Zukin : A lot of them have been asked, but I guess one of the constant questions we get from investors, and I'm sure you get too is you look at the headlines, you look at commentary, particularly about white collar recession or employment levels at some point, starting to kind of tick in the other direction from the record strength we've had here. Samad kind of asked this question about your Q4 numbers, around conservatism. It sounds like you're not seeing any change in employment levels in your customers, you're not even really seeing any change in sales cycle times in your customer base for new logos. I guess, how -- is there a reason that you guys have been able to decipher as to why that is or when you would be anticipating seeing that impact from the macro economy? Or is there just a level of resiliency either from a share market perspective or type of client perspective that you serve that gives you that resiliency on the recurring revenue line. And maybe it's also just the mix of SMB versus larger customers that you're serving in your business. But would love to get some -- just further clarity on that.\nSteve Beauchamp: Sure. So obviously, been in this industry, really my whole career, and I've seen the different cycles. But the interesting part, I think, to me about this cycle is you still have relatively low unemployment levels. And certainly, the headline news, there are people reducing their workforces, but there are still a number of jobs out there, and we're still in a growth environment. There's been a lot of lumpiness post COVID. The other thing I would say is hybrid work, people moving from 1 industry to the next, there's a lot of resilience in terms of being able to move from 1 job to the next, being able to work from home anywhere in the country. And so I think the labor force can react relatively quickly as we've seen these maybe shifts in demand, as you said, from white-collar jobs. And overall, when I look at the longer-term history is GDP is growing a little bit, employment usually trails at a little bit from a percentage basis. If it's declining a little bit, it's also going to decline trailing GDP. And sometimes unemployment numbers can take a couple of months before you see it all the way through. But if you think of all those headlines, we've been flat for several months in terms of employment levels. And that, frankly, makes sense to me based on what I've seen historically. Now that doesn't mean that, that's certainly going to continue. We have forecasted kind of a flat environment on our guidance for the rest of the year. But I think there's a fair amount of resilience in this type of employment environment where people can move from one job to the next relatively quickly because of the rise remote work.\nAlex Zukin : That's actually a really unique and great explanation. It's super simple and super interesting that the labor mobility, effectively if one of your clients loses somebody they'll pop right up at 1 of your other clients. I guess 1 other question I have is, as I look at the OpEx umbrella, it does look like for the first kind of -- this quarter specifically, your growth in sales and marketing is meaningfully ahead of the recurring revenue growth on a year-over-year basis, which I guess, to some extent, makes sense because it's aligned with your total revenue growth, what do we -- when you think about your ability to kind of almost not overinvest, but invest ahead at a level that maybe you haven't been able to invest in the last couple of years, what are you -- if we think about the reaping the rewards of that kind of front-loaded sales and marketing investment that you're able to make in the first half of this year, is it -- do you anticipate it kind of driving greater growth durability, greater growth rate when -- particularly when we start anniversary-ing some of those tougher comps.\nToby Williams: Yes. I mean I think what you've heard us say over -- pretty consistently over the last handful of quarters is we felt very good about the demand environment. We continue to. We felt really good about the growth opportunity in front of us based on having relatively low share of a very large market. I think what the message has been is we would continue to invest in -- certainly in sales and marketing, in sales headcount and in marketing and in channels, a lot of that being in the form of digital marketing, support for our channel initiatives, which continue to drive 25% plus of new business to us. And I think what you're seeing in the first half of this year is the continued progress and the continued sort of motion against that strategy. And I think we came into this fiscal year feeling really good about our staffing levels from a sales headcount perspective, and I think our strategy on an ongoing basis has been to continue to add talent in those areas where we can, given that from an overall business perspective, sales and marketing is certainly along with product, one of the big growth-driving areas of the business. And so I think you've just seen us continue to incrementally invest there in the first half of the year, pretty consistent with how we've described it historically.\nRyan Glenn: And Alex, I'd just add there, if you think about our financial playbook, so to speak, is -- and we've talked about this over several years, we've talked about consistently investing where we can in what Toby just referenced. Sales and marketing to drive continued revenue growth or R&D, which you also see this fiscal year. And offsetting that, you're seeing the scale and leverage across the areas that we focused on historically and continue to do so. So really strong gross margin leverage this quarter, year-to-date, really strong G&A leverage this quarter and year-to-date. And I think if you add all that together, it allows us to drive in this quarter, over 400 basis points of of leverage from an adjusted EBITDA perspective while investing incrementally, both in sales and marketing and R&D. So I feel really good about that combination in addition to the strong revenue growth we're driving.\nOperator: Our next question comes from the line of Siti Panigrahi with Mizuho Group.\nSiti Panigrahi: So you talked about employee growth within your platform. So when you look at the incremental recurring revenue, what percentage of that incremental revenue come from new customer versus cross-selling new products like increasing PEPM within your installed base?\nToby Williams: The vast majority of what you see from a revenue growth perspective is attributable to new logo acquisition. So it's the result of selling new clients. We do -- as we've talked about, see certainly the opportunity to sell back into the customer base, that is, on a relative basis, still a smaller part of our overall revenue, still a smaller part of new sales and that continues to be the case through the first half of the year and certainly in this quarter. It's important to us. We certainly continue to invest in it. And the more that we have introduced new products over time, certainly the bigger that opportunity has gotten, and we've pursued it for sure but still had the go-to-market motion and the bigger part of it is new logo acquisition.\nSiti Panigrahi: Great. And then a follow-up to earlier questions in terms of employee client employment growth. You have exposure to multiple vertical industry, including tech and financial services, some of this white collar industries. So what's your mix? Like what's your exposure to tech and white collar industry?\nRyan Glenn: Yes, Siti, I think as you think about our 30,000-plus clients, no client representing nearly anywhere close to 1% of revenue. And to your point, I think the breadth of our clients across various industries is pretty significant. There's nothing particular I'd call out as far as being over under-indexed to tech or any other particular sector. I think our average client having 100-plus employees, that composition would look pretty similar to the SMB space across the U.S. There's nothing that I'd call out that is of particular note.\nOperator: Our next question comes from the line of Robert Simmons with D.A. Davidson.\nRobert Simmons: I was wondering if you talk about client retention. How has that held up so far this year? And what have you built into your fiscal year guidance?\nToby Williams: Yes. So far, our retention rates have continued to be strong. I mean we have talked over the last few quarters consistent with other sort of data points in the industry about us seeing the highest retention rate really that we've seen over the last handful of years, that continues to be the case. And I think overall, I would say January is the busiest time in the industry. It's the busiest time for us as a company, and I think we're really happy with how we came through January from an overall operations and an overall service perspective. And I think the high level of client service that we've provided through the course of a pretty difficult time for our clients during the pandemic has been a huge factor in us differentiating on service and being able to serve our clients effectively when they needed it. And I think that's been a key contributor to us still being able to see record-high retention rates from a last 5-year period perspective.\nOperator: Our next question comes from the line of Jason Celino with KeyBanc.\nJason Celino: If I were to kind of summarize things, it sounds like the demand environment is still pretty strong. You're executing really well. I know you guide to kind of what's in front of you. But when we think about visibility how would you say your visibility is today and how it's changed versus maybe pre-COVID?\nToby Williams: I'm not sure.\nSteve Beauchamp: Sorry, Toby, I jumped ahead of you there. Let me start. I would just start by saying from a visibility perspective, our model being recurring revenue and the fact that a big part of our revenue is retaining the existing customers. And then you overlay new customers and new recurring revenue as the year goes along. So think about it as we go along in that year, we get greater visibility to only 2 quarters left. Obviously, January being a huge part of our selling season. At this stage, we have better visibility than we certainly did last quarter and significant visibility because we know what our retention rates are and we've got pretty decent look into the pipeline of new business. And so it's just 1 of the benefits, I think, of this business model that we've got. I don't think, though, like at the size and scale that we're at now, versus maybe 3 or 4 years ago pre-COVID, there's a different level of visibility. I think it's just more inherent in the business model and where we're driving the revenue from.\nOperator: Ladies and gentlemen, that concludes our Q&A session. I would now like to turn the call back to Steve for closing remarks.\nSteve Beauchamp: Yes. I just want to take a quick moment to thank everyone at Paylocity for all their hard work and effort over a very busy year-end. And of course, thank all of you for your interest in Paylocity. Everyone, have a great evening.\nOperator: Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect."
  }
]