[
  {
    "symbol": "PCTY",
    "period": "Q3",
    "year": 2023,
    "date": "2023-05-04",
    "content": "Operator: Good day, and welcome to the Paylocity Holding Corporation Third Quarter 2023 Fiscal Year Results Call. At this time all participants are in a listen-only mode. After the speaker presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker, Mr. Ryan Glenn, Chief Financial Officer. Please go ahead, sir.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the third quarter of fiscal 2023, which ended on March 31, 2023. I'm Ryan Glenn, Chief Financial Officer; and joining me on the call today are Steve Beauchamp and Toby Williams, Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to their directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regards to our upcoming conference schedule, Toby will be attending the Cowen Annual Technology Media and Telecom Conference in New York on June 1st. I will be attending the Jefferies Software Conference in Los Angeles also on June 1st, and Toby and I will be attending the Stifel Cross Sector Insight Conference in Boston on June 6 and the Baird Global Consumer Technology and Services Conference in New York on June 7. And Steve will be attending the William Blair Growth Conference in Chicago also on June 7. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thanks, Ryan, and thanks to all of you for joining us on our third quarter fiscal 2023 earnings call. Our overall momentum continued in third quarter with solid execution across our target market. Q3 revenue growth was 38.2% as our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. We continue to build on our unique value proposition of providing the most modern software in the industry with the recent release of AI Assist, the HCM industry's first integration of generative AI. Leveraging an integration with OpenAI, the developer of ChatGPT, AI Assist is designed to help our clients more easily and effectively communicate and engage with their employees. Included as a new feature within Community, AI Assist allows users to draft ready-to-send communications and announcements with a simple prompt, tailor messages to specific audiences or even translate announcement into other languages to reach multilingual employees. AI Assist represents the next step in Paylocity's broader investment in AI and machine learning, building upon other AI-based platform capabilities, such as our modern workforce index, retention risk dashboards, time and labor forecast and tone and sentiment analysis in performance reviews. Our commitment to product development also continues to be recognized in the market with Paylocity recently placing number one overall in G2's Best HR Products list and ranking inside of G2's Top 25 Global Software Companies. Additionally, Paylocity was named an overall leader in all 12 human capital management product categories in G2's Spring 2023 Grid Report and won a 2023 Most Loved Award by TrustRadius. Similarly, the strong culture at Paylocity continues to be recognized externally as we received Forbes' 2023 Best Employers for Diversity Award for the second consecutive year. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. In Q3, our sales team turned in another solid performance. And as Steve highlighted, our differentiated value proposition of providing the most modern software in the industry continues to resonate across our target market. Our sustained investment in key product areas such as mobile, engagement, AI and analytics continues to strengthen our position as the most modern software platform in the industry and sets us up for a strong close to fiscal 2023. In particular, we've continued to see employees increasingly engage with the platform via mobile and through Community, a trend highlighted across a number of clients in Q3, including a real estate developer with over 400 employees that is leveraging mobile alerts and peer-to-peer recognition to drive and measure higher engagement and connectivity across its geographically dispersed property managers, leasing agents and staff. Similarly, a retailer with 1,300 employees across over 70 locations is leveraging our mobile self-service capabilities, on-demand pay, Community and surveys to drive higher employee engagement and help retain employees. Solid sales and operational execution helped drive our total revenue to $339.9 million or 38.2% growth over Q3 of last year, beating the midpoint of our guidance by $7.4 million as we continue to build momentum across our target market. We also continue to be pleased with the success in go-to-market hiring and attracting talented sales reps, and we are confident in our ability to hit our staffing targets to start next fiscal year. Additionally, channel referrals, primarily from benefit brokers and financial advisers, once again represented more than 25% of new business for the third quarter as we continue to leverage both virtual and in-person broker meetings and events to help us maintain the strong source of referrals. We continue investing to support channel referrals and in digital marketing efforts, both of which have driven increased top-of-sales funnel activity and productivity this fiscal year. Interest income on client funds has also continued to rise as a result of sustained interest rate increases from the Federal Reserve and increases in average daily balances. Our top line outperformance, coupled with continued operational efficiency, helped drive adjusted EBITDA of $130.7 million or 38.4% margin, which exceeded the midpoint of our guidance by $7.7 million. Lastly, Q3 represents our busiest time of year as we work to support our clients through all their year-end processing and annual tax form filing needs. I'd like to send out a big thanks to our more than 6,000 employees, who live and represent our values every single day and who worked so hard to support our clients in Q3. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2023 guidance.\nRyan Glenn: Thanks, Toby. Total revenue for Q3 was $339.9 million, an increase of 38.2% with recurring and other revenues up 28.3% from the same period last year, and we were pleased to come in $7.4 million above the midpoint of our Q3 revenue guidance and to raise fiscal 2022 revenue guidance by $8.5 million at the midpoint, resulting in fiscal 2023 guidance of 37% revenue growth. Our adjusted gross profit was 76.0% for Q3 versus 73.1% in Q3 of last fiscal, representing 290 basis points of leverage as a result of revenue overperformance and continued focus on scaling our operational costs while maintaining industry-leading service levels. We continue to make significant investments in research and development. And to understand our overall investment in R&D is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 53.5% when compared to the third quarter of fiscal 2022. And we remain focused on making incremental investments in R&D as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities, on a non-GAAP basis, sales and marketing expense was 19.1% of revenue in Q3, and we remain focused on making incremental investments in this area of the business to drive growth going forward. On a non-GAAP basis, G&A costs were 10.4% of revenue in the third quarter versus 12.2% in the same period last year, representing 180 basis points of leverage in Q3. Our adjusted EBITDA was $130.7 million or 38.4% of revenue for the quarter, which exceeded our guidance by $7.7 million at the midpoint. And we remain committed to progressing against our adjusted EBITDA target of 30% to 35% of revenue. We continue to be pleased by our ability to drive increased profitability through leverage in adjusted gross margin, adjusted EBITDA and free cash flow while also maintaining strong revenue growth. On a year-to-date basis, our free cash flow margin expanded to 19.2% and improved 900 basis points versus the prior period, and we're pleased to be well within our target range of 15% to 20% free cash flow margin. Briefly covering our GAAP results for Q3, gross profit was $244.1 million. Operating income was $80.4 million, and net income was $57.6 million. In regards to the balance sheet, we ended the quarter with cash, cash equivalent and invested corporate cash of $233.7 million and no debt outstanding. In regard to client held funds and interest income, our average daily balance of client funds was $2.8 billion in Q3. And we are estimating the average daily balance will be approximately $2.5 billion in Q4 with an average annual yield of approximately 380 basis points. Additionally, please note that our guidance includes the impact of this week’s 25 basis point interest rate increase, and although we expect the impact to be more material in future periods, we do not expect this to have materially impact on Q4 results given the recency of the increase in rates.  In regard to over our client workforce levels, the number of client employees on the platform was flat for January, February, March and April on a sequential basis in each month consistent with Q2 and versus only a nominal increase in Q1 on a sequential basis. Our guidance continues to assume overall flat client workforce levels for the rest of the fiscal year.  With that, I’d like to provide our financial guidance for Q4 and full fiscal 2023. For the fourth quarter of fiscal 2023, total revenue is expected to be in the range of $299.2 million to $303.2 million, or approximately 32% growth over fourth quarter fiscal 2022 total revenue. And adjusted EBITDA is expected to the range of $93.5 million to $96.5 million. And for fiscal year 2023, total revenue is expected to be in the range of $1.165 billion to $1.169 billion or approximately 37% growth over fiscal 2022 and adjusted EBITDA is expected to be in the range of $368.1 million to $371.1 million, implying an adjusted EBITDA margin of approximately 31.7% and representing leverage of 380 basis points versus last fiscal year. In conclusion, we are pleased with our Q3 results and we’re pleased to raise fiscal 2023 guidance to 37% growth of the midpoint, which in combination with the adjusted EBITDA margin represented in our full year guide exceeds the Rule of 68 for fiscal 2023. We remain confident in our ability to support 20% plus revenue growth going forward and also remain committed to driving increased adjusted gross margin, adjusted EBITDA and free cash flow leverage on an annual basis. Operator, we are now ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question will come from the line of Scott Berg with Needham and Co. Your line is open. Mr. Berg, your line is open.\nScott Berg: Sorry about that. I was on mute. Congrats on the great quarter and thanks for taking my questions here. I guess I have a couple, Steve, let’s start about – start with the AI topic of the year so far. You mentioned AI Assist and how it will help your customers communicate better? But as you think more holistically across the HR space over the next couple of three years, how can AI impact both your product and maybe the industry products even more so than what you’re already seeing today?\nSteve Beauchamp: Sure. I think, you know, most of the AI use cases you see early in the cycle really revolve around writing assistance. And clearly that’s going to evolve very quickly over time and there’s lots of examples within the HR suite where that can be helpful. You can think of things like job descriptions as another example, performance reviews, lots of places where you need to provide written communication to employees that having an assistant to be able to make sure that you’re really getting your point across or potentially getting people excited or energized with an announcement. You can get assistance from an AI perspective. And I think we see a lot of those initial use cases is where we will add AI Assist into our platform and deliver value to our clients. But over time, the algorithms start to become much more complicated. You’ll see us impacting modern workforce index over time with new ideas for clients to be able to engage with employees differently and really drive higher retention and higher attraction from new employee perspective and better culture. And so we’re really excited about the opportunity to embed AI Assist throughout the platform.\nScott Berg: Understood. Thank you. And I know in Ryan’s commentary, you talked about your assumptions around flat employment levels here going forward. But how are you all seeing sales cycles today? Our work has indicated kind of the SMB to mid-market HCM’s sales cycle seem, relatively normal out there. But are you seeing any changes maybe more positively or even a little more cautiously?\nToby Williams: Hey, Scott, it’s Toby. I mean, I think, consistent with the commentary on the quarter and the performance, I mean, I think we haven’t seen significant changes in the sales cycles. I think the sales performance has been relatively steady and I think overall, we’re happy with how the quarter shaped up both from a sales perspective and then also from an operational execution standpoint.\nOperator: Thank you. One moment for our next question. And that will come from the line of Terry Tillman with Truist. Your line is open.\nJoe Meares: Hey guys. This is Joe Meares on for Terry. Thanks for taking the questions, I appreciate it. So we saw you guys recently announced a feature – several feature updates including texting for new hires, a new integration for LinkedIn for easier job posting and then fillable forms for signatures and acknowledgements. I’m just curious if there are any other feature updates that you’d point to that you and customers are most excited about? And then if anything could be meal [ph] movers in 2023 or beyond?\nSteve Beauchamp: Sure. So we’ve had a great history of being able to release improvements based off client feedback. We believe strongly and client is a co-creator. And so you listed several examples that we got feedback from our clients and we continue to improve our product and you’ll also see more modern capabilities used in other software platforms be inserted. So we just talked about AI Assist, but things like chat are another great example, leveraging all the mobile connections. I think Toby had some examples in the prepared remarks to really drive higher level of employee engagement, and so you’ll see us continue to improve the platform on ongoing basis. And then from a new product perspective, we’ve more than doubled the amount of product we’ve sold since our IPO and we are pretty confident with a rich product pipeline that we’ll be able to continue that trend going forward and add new modules that are also monetizable at the same time.\nJoe Meares: Very helpful. And just as a follow-up. I think you’ve talked about 92% plus growth retention target. Just curious how that metric performed in the quarter and then how you expected to trend through the rest of calendar 2023? Thanks again.\nSteve Beauchamp: Yes, I mean, I think consistent with prior comments, we’ve – I think benefited from higher retention through the course of the pandemic and then coming out of it consistent with others in the industry. I mean, I think we still through the course of the quarter and year to date, are pretty pleased with the revenue retention. And I think that was part of what contributed to the solid quarter that we put in.\nOperator: Thank you. One moment for our next question. And that will come from the line of Brian Peterson with Raymond James. Your line is open.\nUnidentified Analyst: Hi, this is Jessica Wong [ph] on for Brian Peterson. I just wanted to quickly follow up on investments into sales and product development that you’ve been announcing. How has the pace of hiring investments been in these areas, especially given the start of a new calendar year. And as you’re looking towards the rest of the calendar fiscal year considering ongoing macro and competition? Thanks.\nSteve Beauchamp: Yes, so I think hiring in product technology has always been challenging. Especially to try to get the talented folks you’re looking at examples like software engineer or data practices security, all pretty hot market still despite the fact that there’s been some macro layoffs by the others in the tech org. But we’ve been continuing to hire as I go back to, we’re really excited about what we’ve got from a product pipeline perspective. We’ve gotten great ROI on our previous years product investments. Average revenue per customer has been a strong performance for us, and that’s been driven by the new product introductions that we’ve got. So we understand that things are a little bit more uncertain from a macro perspective. But we’re sticking kind of to the strategy. And at the same time we’re able to deliver pretty strong leverage. And so we feel like we can balance the investments in product going forward, take advantage of the feedback we’re getting from our customers and come out with new monetizable opportunities going forward which has been a key component of our strategy historically.\nUnidentified Analyst: Great. And one quick follow-up question as well. Considering a recent events in a banking sector, have you seen any impact on existing customers or the broader SMB market from the recent banking crisis? Thanks.\nSteve Beauchamp: Sure, I can take that one. The answer to that is no. I think we obviously are working with a very diverse set of banking partners both on the corporate and client held fund side. And I think feel good about the redundancy we have with the multitude of banking partners and there’s nothing that I’d call out as far as noise there, whether it’s with existing clients or with prospects.\nOperator: Thank you. One moment for our next question and that will come from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Thanks very much. So I appreciate the fiscal 2024 kind of revenue commentary. But as we think about expenses going forward, obviously, this year, you got a big benefit from funds held and the incremental gross margin there and OpEx grew in line with revenue. Do you envision a scenario where that somewhat reverses next year on the OpEx side? Thanks.\nSteve Beauchamp: I think the simple answer is we've had really years and years of – if you take out the COVID year, we pretty much expanded our adjusted EBITDA year after year, and we're not necessarily changing our approach towards that. So as we go into next year and we don't have the same type of tailwind from an interest revenue perspective, we're still committed to adjusted EBITDA expansion.\nBrad Reback: That's great. Thanks very much.\nOperator: Thank you. One moment for our next question and that will come from the line of Bryan Bergin with Cowen. Your line is open.\nBryan Bergin: Hi. Good afternoon guys. Thank you. First one on the sales force for you. Can you just give us a sense on how sales headcount expansion progressed this year and how you may have some early plans and thoughts for fiscal 2024?\nToby Williams: Sure. I mean, we came into the year with, I think, sales headcount up right around 18%, which is fairly consistent, maybe ex-one year of COVID, to growing the sales force in that high-teens zip code, plus or minus. And I think we were pleased with our ability to staff up coming into the year. I think as we sit here today, we've got a favorable view of how that's shaping up for our path into next fiscal year. And I think we've got a history of being able to come into the year fully staffed with the headcount that we think we need to be able to support the growth in the fiscal. And so I think as we sit here today, we think we feel pretty good about that as we're looking forward to fiscal 2024.\nBryan Bergin: Okay. And then just a broader question on fiscal 2024. Just if you assess the current environment, just – and the key considerations right now in client conversations, anything we should be mindful of as we just think about that fiscal 2024 growth and margin potential?\nToby Williams: Well, I think – I mean, just as we look at fiscal 2024, I mean, I think we're obviously in the throes of putting together the plan for fiscal 2024, I think I've just talked about how we think about the sales force build into that. I think Steve's comments before, we've had a history of product innovation that I think has helped both create differentiation and also create the performance as we're looking at any future fiscal year. And I think we've got an ops team in place that's done a great job of coming through the busiest time of the year for us and set us up for success as we close out the fiscal year. And so I mean, I think, we're at the planning point for what fiscal 2024 is going to look like. But I think we are positive on the momentum that we've seen in the business, both from a sales perspective and from an operational standpoint.\nSteve Beauchamp: Yes, Toby. The only thing I would add is just from a macro perspective, obviously, we've had the tailwind of interest revenue this year, which has really been an industry tailwind. And then we really haven't seen any growth in pace per. So on a normal kind of low-growth GDP environment, you do typically get pace per growth. And so as we go into next year, you don't get that necessary interest revenue tailwind, and we're anticipating no pace per type growth. So as Toby said, we're pretty confident with all the things that we can control from an execution perspective, but those are a couple of things from a macro to be aware of.\nOperator: Thank you. One moment for our next question, and that will come from the line of Mark Marcon with Baird. Your line is open.\nMark Marcon: Hi, good afternoon and congratulations. Thinking a little bit about the guidance for this coming quarter. What are you thinking with regards to a reasonable effective yield on the float balance for this coming quarter? Because if I'm just doing the raw math, I'm not sure that the revenue guide was raised, and it looks like you've got really good momentum. So I'm just trying to think that part through.\nRyan Glenn: Sure, Mark. This is Ryan. I think for the third quarter, as I said in the prepared remarks, the average daily balance was about $2.8 billion. The average yield, if you back into that, was 360 to 370 basis points and we guided to – Q4 to about 380 basis points. So I think our expectation is continue to step up in yield, as you've seen consistently each quarter this fiscal year. Obviously, we got a 25 basis point rate increase yesterday. The impact of that in Q4 is negligible, but you will see the yields continue to build in Q4 as you have earlier part of the year.\nMark Marcon: Okay. And I mean, just staying on the topic, just how are you thinking about the momentum into Q4? Because it looks like things are going really well. And perhaps you can comment a little bit with regards to the sales pipeline and the implementations and particularly, if you're seeing any more traction on the upper end of the market, as you mentioned during prior quarters.\nSteve Beauchamp: Sure. So yes, I think you're right. We've had really good execution in the quarter and throughout the fiscal year from a sales perspective. As you go into next quarter and you look at our guidance, it starts to look very similar to pre-COVID type activity. So we're anniversarying a lot of the noise from COVID tailwind. So I think that's one thing to kind of think about is it's kind of getting back into, we were kind of in that 20-plus category, and we're focusing on that and we're executing above that pre COVID. There's been a lot of headwind early on and tailwind late. And so I think you're going to get back to a more normalized quarter as we go into the fourth quarter of the fiscal year. But we've been executing really well across all market segments. I would still highlight the upper end of that market. Probably if you were to say, which is probably the place you're executing the best that would still be a highlight.\nOperator: Thank you. One moment for our next question and that will come from the line of Alex Zukin with Wolfe Research. Your line is open.\nAlex Zukin: Yes. Hi, guys. Thanks for taking the question. I guess it's been asked a couple of times. It does not sound like you're seeing any macro headwinds at the moment. I guess if you -- as you look towards 2024, you just talked about seeing better traction up market. Do you see any lengthening in sales cycles? Any -- maybe, again, as sales cycles take longer, approvals take more time that close rates are, again, stretched out or impacted by that? And then how do you think about how is the importance of global in kind of the incremental traction, incremental bookings opportunity for fiscal 2024? It appears to be increasingly important in the ecosystem.\nSteve Beauchamp: Maybe I'll start with the global part of the answer. We acquired Blue Marble to be able to have a global offering where companies can be paid through a network of providers in a number of countries around the world. And so, we've integrated that business into the rest of our organization. And now when we look at that it's very much a customer that might be on the Blue Marble platform, but also on the Paylocity platform. And so we think that's been a nice differentiator for us. It also creates a nice revenue stream on top of that. I think, though, it's still relatively small compared to the rest of our business. And so we think about that as now being kind of part of our core strategy and not so separate and certainly being helpful, even more so from a differentiation perspective than a new revenue stream.\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Samad Samana with Jefferies. Your line is open.\nSamad Samana: Hi, good evening. Thanks for taking my questions. Maybe first one, just if I strip out as kind of the implied float contribution, gross margins on the core software side is still up really nicely year-over-year. I'm just curious maybe what's driving that underlying increase beyond scale or if there's anything that's changed in terms of what maybe your hosting costs are or what's maybe supporting that gross margin expansion outside of just float side.\nRyan Glenn: Yes. Samad, I can take that one. I think as you said, we're really pleased with, I think, leverage across the business, certainly from a gross margin perspective, almost 300 basis points of leverage in the quarter. And as you outlined, stripping out the float impact, I think you're still at about 100 basis points. So nothing I'd call out there from a one-time perspective. I think it's – as the business continues to scale, you're driving efficiencies and scale and automation in those teams. And at the same time, we feel really good about the service and implementation and overall ops experience we're driving for clients. So I think it's just that continued strategy of investing in that part of the business, but at the same time, driving efficiencies.\nSamad Samana: Great. And then maybe Steve or Toby, as a follow-up. As you think about the nature of the typical customer conversation that you're having right now, is it more about how to leverage better what's called the incremental modules or the products that they have adopted over the last 18 to 24 months [indiscernible] what seems to be just largely kind of understood world of where people are working? Or is it more about how do they get new tools to better manage the world that we're in, right? So is it kind of better leveraging what they already have or finding more?\nSteve Beauchamp: Yes. I think it's a combination, really. So I think it starts with how do we really digitize all of our back-office HR processes. And ultimately, that puts more control in the hands of employees and managers and saves the HR team time. That's still a big part of the equation. And then on top of that, part of the equation then is with the time that you save, what are you going to be doing from a strategic perspective? And that's really driving initiatives to create the right culture, to make an engaging environment, to drive productivity. And that's where a lot of the new tools come into the equation. And that's where you've seen things like surveys and LMS and Community and video really create a better engaging experience. That always becomes part of the conversation, but it still starts with how do you get as efficient as possible first.\nOperator: Thank you. One moment for our next question and that will come from the line of Jason Celino with KeyBanc Capital Markets. Your line is open.\nJason Celino: Great. Thanks. Appreciate it. This year, you've been taking advantage of the favorable flow environment to reinvest in the platform. My question has to deal with like the pace of innovation, specifically with this AI feature. If we take a step back, it's really only been about 6 months since the AI rhetoric has really uptick. I'm curious on maybe when you started developing this product, like how long did it take and if we could see additional features here on the AI side near-term?\nSteve Beauchamp: Yes, sure. So I think what we called out in the prepared remarks is that we've been investing kind of in broader data science, machine learning, AI for a number of years now. And so, we gave examples of a number of products that are leveraging those types of capabilities. More recently, AI Assist is obviously leveraging large language model in that category. And so we’re – we continually invest and we believe that’s really part of the whole engagement and more modern platform story is our investments – multi-year investments in there. And we think we’ve got a pretty good pipelines of places that we can take either products like AI Assist or making modern workforce index more robust or being more predictive across our insights over time.\nJason Celino: I see. Okay, perfect. And then appreciated the update on international, sounds like it’s been a good differentiator. But I guess where does international kind of fit in some of your more near term to medium term priorities? Thanks.\nSteve Beauchamp: Yes, I think we’re focused on kind of the mid-market U.S. TAM opportunity. We still have relatively low penetration into a very large opportunity. We recognize that there are segments of the market that are adding employees internationally, certainly post COVID. That has increased a little bit before what, and that trend will likely continue. And so having an international solution for our clients is super helpful. But the primary focus for us is really continuing to gain market share when it comes to mid-market companies in the U.S.\nOperator: Thank you. One moment for our next question. And that will come from the line of Robert Simmons with D.A. Davidson. Your line is open.\nRobert Simmons: Hey, thanks for taking the question. I was wondering if you could give a little more color on AI Assist just in terms of the revenue model. Then also are there customers who are using it live today?\nSteve Beauchamp: Yes. So I think from a functionality perspective, the first use case that we have enabled is many of our customers use community to actually communicate HR updates to their employees. And so they use our announcement feature to be able to do that. And sometimes that’s community we use to talk about events that they’re having. Sometimes it’s just updates of what’s happening in the organization, policy changes. It really replaces email for those customers. And at times, an HR team can spend a fair amount of time drafting those communications. And so AI Assist is built right into the community announcement feature and you can actually prompt it, you can ask it questions, you can ask it to change language, you can ask it to make it sound more exciting. All the things that you can normally do in ChatGPT. And so it really helps HR teams just be more efficient from an announcement perspective. That’s where we have it today. Community is a free feature available to all of our customers. We’re not monetizing that separate. But we certainly see an opportunity to take that type of capability and embed it in other places in the suite over time.\nRobert Simmons: Got it. That makes sense. And then can you talk about what you’re seeing in the competitive landscape? Any changes to how others are operating?\nToby Williams: Yes, I mean I think we’ve seen relative consistency through the course of the quarter from a competitive landscape perspective. And I think, going through a lot of the things Steve just ran through, I think we’ve tried to differentiate on product strategy with things like community and being able to drive different level of engagement with things like surveys and LMS and video and things like we announced with AI Assist through community. And so I think the competitive landscape has been fairly steady. And I think those continue to be the points that we’ve driven from a value prop perspective and those have continued to resonate in the market.\nOperator: Thank you. One moment for our next question. And that question will come from the line of Siti Panigrahi with Mizuho. Your line is open.\nSiti Panigrahi: Thanks for taking my question. Just wondering, are you seeing any strength and weakness in any particular verticals? And also what are you seeing in your 50 – below 50 employee segment versus upmarket?\nToby Williams: Sure. So we’re pretty happy with sales execution across all segments. Start there. I think I highlighted earlier that if you think of the upper end of the segment, we have been having increasing success. That’s probably less of a comment from the quarter. But that’s really happened over the last couple years. And really that’s a function of all the new products and the new features that we’ve added. We’ve just been more competitive upmarket. And so no real changes in terms of our go-to-market motion or the success rate that we’ve had. We’re pretty happy, whether it’s a customer with 25 or 30 employees or whether they’ve got several thousand employees. We’re really seeing that the product that we’re putting in front of them is resonating and delivering value to them.\nSiti Panigrahi: Any exposure to tech industry and what are you seeing there?\nToby Williams: Yes, so, sorry, I missed that part of the question. We really operate horizontally across the industry. If you think of how we organize our sales force, they’re really focused on a zip code based geography and they’ll sell across all industries. We certainly emphasize different parts of the product for different industries and certain features. But I would say no call out from an industry perspective. I think we look at that from both a sales perspective and within our, our client base and we’ve got a pretty even distribution if you look at the DNB [ph] distribution across the U.S., our client base looks very much like that.\nSiti Panigrahi: Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Daniel Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Hey, great. Good evening. Thanks for taking my question. Maybe just to start with on the quarter, if you exclude sort of the upside from flow, which has been a nice tailwind for a while. The recurring upside from revenue in the quarter, maybe it wasn’t as big as we’ve seen in the last year or so. So maybe if you just dig in there, like is there something that you would call out in terms of execution in the quarter or maybe compare and contrast what drove such significant upside to your guidance last year that maybe isn’t repeating going forward?\nSteve Beauchamp: Sure, Dan. I think, as we step back and look at the quarter results obviously, beat across the implied recurring and total and raise that plus for the year. So I think to the comments earlier, felt really good about the results in the quarter and the momentum within that sales team. I think the last few years you’ve had a little bit of noise in certain of those quarters. You obviously had some tailwinds from client workforce levels that weren’t factored into the guidance. So that was probably a bit of the overperformance you would’ve seen for the last six to eight quarters. I think it’s been a steady state as we outlined there. So no real tailwind. Retention has been high, continues to trend nicely that had been a little bit of upside in the past as well as that’s performed really well for the last few years. Outside of that, there’s nothing I would call out one time, I think feel really good about the beat and feel good about where Q4 headed as well.\nDaniel Jester: Great. Thank you. And then, this comment about employees and the platform being steady for a couple quarters. Obviously, there’s other data that I suggest that the job market is growing. If you look back historically, has there been periods in time when your employees in the platform trends or substantially different than the macro overall? I’m just – I’m trying to sort of connect all the dots here…\nSteve Beauchamp: Sure.\nDaniel Jester: …about what underlying is going on. Thank you.\nSteve Beauchamp: Ye, so I think, when we talk about employees on the platform, we’re often looking at employees. It’s the same clients year-over-year and do they have more employees or less employees, right? And so there’s – that’s really kind of what we’re focused on. And in a normal, like if you go pre-COVID, GDP was in the low single digits. We were getting low single digit growth of employees on the platform. And if you’re in a recessionary time period and that’s kind of negative GDP, then you definitely see people kind of shedding employees on the platform. But if you go back, we’ve had many years of employee growth on the platform pre-COVID. And that’s probably the more normal state even when we are seeing 2% GDP growth, we are seeing a little bit of bump of employees on the platform. So the one difference from a macro perspective is we haven’t seen that and we’re not forecasting seeing that going forward. And so the employment numbers sometimes don’t exactly line up perfectly, but yes, there’s some jobs added. But unemployment rate hasn’t gone up and shifts. But generally speaking, I think if you think about it the way I just described versus something like a GDP number that’s what we’ve seen historically.\nOperator: Thank you. One moment for our next question. And that will come from the line of Steve Enders with Citi. Your line is open.\nSteve Enders: Okay, great. Thanks for taking the question. I guess just based on kind of like what you’re seeing out there in the current environment. How are you thinking about kind of further sales investments at this point and where you’d be making your bets in terms of the types of types of coverage or the rep kind of base that you’d be looking at here?\nSteve Beauchamp: So this is the time of year that we’re hiring reps. We typically start kind of after the last quarter. We just kind of completed, we ramp up throughout the spring and then we try to get ourselves to kind of a target number of quota carriers going into the fiscal year. I think Toby mentioned one of the earlier questions. We’ve had success getting up to that number last year that was kind of 18-ish percent. We’ve kind of been in that mid-teens growth rate for a while. We will give you the exact number on the next earnings call. But I think to echo Toby sentiments, we really feel good about where we are from a hiring perspective right now. We think, our value proposition for sales reps really resonates as well in the marketplace and we’re making good progress towards the target for next year.\nSteve Enders: I guess in terms of like the profiles of reps that you’re looking to add, like is it more focused on larger customers and building up more of like the mid-market coverage or inside sales or like, is there any kind of change in how you’re viewing the types of reps that you need in this environment?\nSteve Beauchamp: No, that’s a good question. I think we’ve called out over the last, like I said, maybe even almost two years now, where we’ve been having a little bit more success with the larger end of the market. And so those are experienced people with industry experience that we bring on our core mid-market reps were probably a mix of non-industry, but yet B2B sales experience and industry reps. We definitely lean still heavily more towards industry reps. And then on the inside sales, you’re capturing kind of digital lead generation and handling those. And so those need less experience. And so we’re going to be potentially adding people across the board. We’re going through what that mix looks like, but if anything, it’s a slight shift to a little bit larger client that we’ve been generating that would likely continue as we forecast going forward. And maybe not quite as many on the small end. But we see opportunities to expand in all markets.\nSteve Enders: Okay, perfect. Appreciate you taking the questions.\nOperator: Thank you. I’m showing no further questions in the queue at this time. I would now like to turn the call back over to management for any closing remark.\nSteve Beauchamp: Thank you very much. I just wanted to thank everybody for their interest in Paylocity. Thanks for joining the call and also wanted to give a special thank you to all of our employees for all their hard work throughout the course of the quarter. Thank you.\nOperator: Thank you all for participating. This concludes today’s program. You may now disconnect."
  }
]