[
  {
    "symbol": "PCTY",
    "period": "Q2",
    "year": 2024,
    "date": "2024-02-08",
    "content": "Operator: Hello, and thank you for standing by. Welcome to Paylocity Holding Corporation Second Quarter 2024 Fiscal Year Results Conference Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] I would now like to hand the conference over to Ryan Glenn. Sir, you may begin.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the second quarter of fiscal 2024, which ended on December 31, 2023. I'm Ryan Glenn, Chief Financial Officer and joining me on the call today are Steve Beauchamp and Toby Williams, Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks including statements made during the question-and-answer session contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained herein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com, under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure, because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, I'll be attending the Wolfe Conference in New York on February 27th, and Toby and I will be attending the Stifel Executive Summit in Florida in early March and the Raymond James Institutional Investors Conference in Orlando on March 6th. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thank you, Ryan, and thanks to all of you for joining us on our second quarter fiscal 2024 earnings call. Our solid results continued in Q2 of fiscal 2024, with total revenue growth of 20% as our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. Recurring and other revenue was $298.4 million or 16% growth over Q2 of last year. We continue to receive positive client feedback on our modern product suite, including newer products such as advanced scheduling, learning management, rewards and recognition and employee voice. Specifically, a client in the automotive industry with over 1,000 employees highlighted how the ability to create custom recognition awards that are shareable via the mobile app is positively impacting employee sentiment by making it easier for employees to celebrate one another in new ways. Similarly, a retail client with 900 employees has created over 200 custom trainings with our learning management module to better connect employees to the company's vision, mission and core values. Additionally, we continue to invest and build upon our AI leadership in the HCM industry with the launch of AI-driven personalized learning plans, optimized workforce schedules and embedded generative AI recommendation within rewards and recognition, employee voice and community. Building upon the generative AI-driven announcement and job description released in community and recruiting last calendar year, these new features help to further improve business efficiency, communication and the end user experience for our clients. While we are pleased with our Q2 results, the macro environment has become increasingly challenging over the last few months as employment levels on the platform once again moderated versus our expectations and presented an incremental headwind to results in the quarter and to fiscal 2024 guidance. Despite the macro challenges, we continue to invest in our product suite and this commitment to product innovation continues to be recognized by third parties as Paylocity was recently awarded a Bronze Brandon Hall Group Excellence in Technology Award in the Best Advance in Employee Engagement Technology category, and named as overall leader in 10 HCM product category in G2's Winter 2023 Grid Reports, marking the 21st consecutive quarter in which Paylocity achieved leader ranking. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. This is a very busy time of year for all of our teams across the business as they work closely with clients on year-end processing of payrolls, W-2s, 1095s and annual tax form filings to federal state and local agencies and on the implementation of new clients. I want to thank all of our employees for their hard work and dedication to our clients during this very busy year-end season. Building on Steve's comments around product innovation, in early December, we announced the acquisition of Trace, which enables organizations to manage headcount plans, forecast headcount budgets and approved headcount changes. When combined with the valuable employee record data in our platform, we believe Trace's headcount planning capabilities will help our clients improve decision-making and drive faster execution. From a financial perspective, Trace will not materially contribute to revenue or impact our overall margin profile in fiscal 2024. With respect to our go-to-market efforts, we've realized significant success in the upper end of our target market over the last several fiscal years, and we have invested to grow the size of that team. To date, in fiscal 2024, we've seen sales cycles upmarket take longer, and it has taken longer for our new reps to ramp up which has pressured productivity and new sales volumes in January and has weighed on fiscal 2024 growth. That said, we remain confident in our sales team and go-to-market motion, and we are pleased by our top of funnel activity, the growth of the upmarket pipeline and our ability to drive product differentiation upmarket. We will be focusing the rest of this year and going into next year on driving a higher level of go-to-market productivity and driving execution upmarket. We have remained focused on our referral channels and have been pleased with the consistency of our referrals, which once again delivered more than 25% of our new business in Q2. We have also continued to drive leverage across the business as we grow and scale with focus on both EBITDA and free cash flow leverage this quarter and this fiscal year. The strong culture at Paylocity continues to be recognized externally as we recently were named to Newsweek's America's Greatest Workplaces for Diversity in 2024 and built-ins list of the 100 best large companies to work for in Chicago for 2023. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2024 guidance.\nRyan Glenn: Thanks, Toby. Total revenue for the second quarter was $326.4 million, an increase of 20%, with recurring other revenues up 16% from the same period last year and above the midpoint of our guidance. Our adjusted gross profit was 72.7% for Q2 as we continue to focus on scaling our operational costs while maintaining industry-leading service levels. We continue to invest in research and development and to understand our overall investment in R&D, it is important to both combine what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 27% when compared to the second quarter of fiscal 2023 and as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities. On a non-GAAP basis, sales and marketing expenses were 21.3% of revenue in the second quarter versus 23.7% in the second quarter of last year. On a non-GAAP basis, G&A costs were 9.1% of revenue in the second quarter versus 11.3% in the same period last year, and we remain focused on consistently leveraging our G&A expenses on an annual basis. Our adjusted EBITDA for the second quarter was $112.6 million or 34.5% margin and exceeded the top end of our guidance by $9.6 million and represented 620 basis points of leverage versus Q2 of fiscal 2023. We continue to be pleased by our ability to drive increased profitability through leverage and adjusted gross margin, adjusted EBITDA and free cash flow while also maintaining strong revenue growth. Briefly covering our GAAP results. For Q2, gross profit was $219 million. Operating income was $49.7 million and net income was $38.1 million. In regard to the balance sheet, we ended the quarter with cash and cash equivalents of $366.9 million and no debt outstanding. In regard to client-held funds and interest income, our average daily balance of client funds was $2.4 billion in Q2. We are estimating the average daily balance will be approximately $2.9 billion in Q3 with an average annual yield of approximately 450 basis points. On a full-year basis, we are estimating the average daily balance will be approximately $2.5 billion to $2.6 billion with an average yield of approximately 445 to 450 basis points. Please note, our guidance includes the impact of a contemplated 25 basis point decline in the Fed funds rate in May. In regard to client workforce levels, year-over-year employees on the platform growth came in below our expectations in Q2, resulting in an incremental headwind to the quarter and fiscal year. Given recent macroeconomic trends, our updated guidance for the back half of fiscal 2024 includes further moderation in client workforce levels through the remainder of the fiscal year. Finally, I'd like to provide our financial guidance for Q3 and full fiscal 2024. For the third quarter of fiscal 2024, total revenue is expected to be in the range of $395 million to $399 million or approximately 17% growth over third quarter fiscal 2023 total revenue. And adjusted EBITDA is expected to be in the range of $153.5 million to $156.5 million. And for fiscal year 2024, total revenue is expected to be in the range of $1.384 billion to $1.389 billion or approximately 18% growth over fiscal 2023. And adjusted EBITDA is expected to be in the range of $474 million to $478 million, which represents 240 basis points of leverage over fiscal 2023. Operator, we are now ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question comes from the line of Scott Berg with Needham. Your line is open.\nJoshua Reilly: Hey guys. This is Josh on for Scott. Thanks for taking our questions. Just starting off here, what are you seeing in terms of unit growth or any potential churn with customers at the low end of the market? One of your public competitors noted an elevated level of churn with customers under 50 employees. Are you seeing anything there? Or is it really simply just a matter of customers across the board regardless of size, lowering their employment levels across all customer segments?\nSteve Beauchamp: Yes. I think the impact that we're seeing is our current customers are not necessarily getting the growth of employees on the platform that you would typically see in this type of economic environment. And so we certainly factored that in, in terms of what we've seen already this year and then assumed that that was going to continue to be the case for the back half of the year. So that's the headwind that I think Ryan referred to in the script. You typically see customers under 50 employees, they naturally turn over at a higher rate just because there's more out of business losses. That trend is probably something that's always been the case in our industry. And so if you were growing that segment more and you were losing more there, that probably just is the nature of the business under 50 market. I don't think we've seen anything in that space that would be any different than before. And I think an economy that's growing and fairly consistent in terms of employment levels, nothing to call out in that space.\nJoshua Reilly: Got it. And then just a follow-up. Are you seeing – is there going to be any year-over-year headwinds related to forms revenue in the March quarter in terms of number of employees that were active on the platform on a year-over-year basis? Thank you.\nRyan Glenn: Sure. So I think we obviously – where we are in the quarter, have a good idea of where form revenue is trending for Q3, so we've taken that into account as we've guided for Q3 and for fiscal 2024.\nJoshua Reilly: Got it. Thanks, guys.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Great. Thanks very much. Toby, can you spend a couple of minutes reviewing some of your commentary on the salesforce, the close rates, upmarket. How much of that you feel is economic versus execution? Thanks.\nToby Williams: Yes. Sure. Thanks, Brad. Yes, I think if you go back over probably the last, call it, 18 months to two years, we've talked about getting a traction upmarket and we've talked about having incremental success there from a sales perspective. And I think that's been the case. And I think we've also invested more across the business and in go-to-market to support the growth that we've seen there. And as we've called out, I think last quarter, we called out that we were seeing slightly slower sales cycles, I think we saw the same thing this quarter. And I think that was the reason why we put it in the script. I think it's hard to take a part with any precision, what part of that because I know others in the space have talked about this, too, and you've on and off heard it in the broader software category in terms of upmarket sales cycles being longer. It's hard to take a part how much of that is attributable to the macro. I don't think the macro helps. But I think part of it is, I think as we've sort of gotten further and further into the upmarket, I think we certainly have an opportunity to execute better. And I think that will be a focus as we look at the rest of this fiscal year to be able to drive productivity and I think that will carry into next fiscal, too.\nSteve Beauchamp: I think the only thing I would add to that, Brad, is one of the things that we are seeing is a pretty nice build in the pipeline market. We didn't see all that come through in January and obviously, we had to factor that into the guidance. But we definitely see a fair amount of activity there. And so that is certainly allows us to remain optimistic about the success in the market in terms of the clients that we're selling, the response we're getting from prospects in the market and the opportunity going forward.\nBrad Reback: And can you just remind us what upmarket means for you? Is that north of 500, north of 1,000? Thanks.\nSteve Beauchamp: Yes. I would say it's north of 500 employees would be how we define that kind of internally, yes.\nBrad Reback: Great. Thanks very much.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Samad Samana with Jefferies. Your line is open.\nSamad Samana: Hi, good evening. Thanks for taking my questions. Maybe the first one, as you – maybe to piggyback on Brad's question about the upmarket, does it make you think that you need a different type of either sales reps? Or I guess, can you help us understand maybe what has made it more difficult for them to be able to ramp? And does it, do you need to hire different types of reps there than it historically done in the core sales organization? Maybe walk us through that?\nSteve Beauchamp: Yes. I think it's a good question. So we've been ramping the number of reps in that space, as Toby just mentioned faster than the rest of our sales force over the last, call it, two to three years. We've called out the fact that success in that market has been a tailwind for us over the last couple of fiscal years. Early on in that cycle, you get a lot of promotions from within. It's very common to be able to do that as you start to ramp to bigger numbers, you're certainly bringing more people in from the outside. So I think part of this is figuring out how long does it take someone to ramp from the outside versus internal. And then I think secondly, when you start to get higher volume of deals in that space, trying to understand what those sales cycles look like and the decision-making cycle. So there certainly is a little bit of learning at scale that's going on here. But I would reiterate the fact that we've had a lot of success. It's been a tailwind for us over the last couple of years, a little bumpier here on the first half of this year, but the pipeline looks pretty rich and strong. And we think we know what we have to do to continue to get success in that market going forward.\nSamad Samana: Great. And maybe just a follow-up for Ryan. Just as I think about the guidance, how much of it was maybe the sluggishness that you've seen upmarket versus the trend in employment in the base coming in differently than expectations? And as I think about the exit rate and what that implies, is that kind of a fair way to think about the growth rate going forward, at least for the short-term?\nRyan Glenn: Yes. I think when you think about the revised guidance for this fiscal year, I think it's absolutely a combination of what Steve and Toby have referenced relative to sales execution. So that's certainly part of it. And I think an equal part of it has been some of the challenges we've seen from a macro standpoint, both year-to-date as well as the fact that we factored in some further moderation in the back half of the year. So I think both of those contributed fairly equally to the revised guidance. Relative to what that implies for Q4, obviously, as I referenced, we had some further moderation in employment levels. That puts you in the sort of 13% or so range for exit of Q4, and I think we'll see how the back half of the year goes before we guide more specifically into 2025.\nSamad Samana: Great. As always, appreciate the time. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Pat Walravens with JMP Securities. Your line is open.\nPatrick Walravens: Great. Thanks very much. Steve and Toby, I'm wondering how deeply do you analyze the trend of the employees that are on the system? I mean do you break it out internally for yourselves by industry? Do you break it out by geo and you break it out by segment? And because UKG started disclosing that and they're private, so they can do it, right? But I assume you guys have that level of detail, too. And I'm just wondering, so where was the weakness?\nSteve Beauchamp: So we do all of those things, and we look at it a variety of different ways. I would tell you that not – there wasn't a big spike in a specific geo or a specific vertical market. I think your higher hourly employee segments when you think of vertical markets, we saw a little bit higher decline in those segments if you think of vertical markets. Geos, there really wasn't much, a call out at all. And so it was generally kind of across the board just a little bit of weakness. But when you add that up across all the customers that we have and you factor that in, it starts to have an impact, especially when it's happened month after month this fiscal year.\nPatrick Walravens: And so this is a tough follow-up, I know, but – so this is two quarters in a row, you think it happens again?\nSteve Beauchamp: We factored into our guidance that the trend that we've seen in the last two quarters would continue through the back half of the year.\nPatrick Walravens: Okay. Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Terry Tillman with Truist Securities. Your line is open.\nTerrell Tillman: Yes. Thanks for taking my questions. I had a question and a follow-up. Just kind of building on the last couple of questions. I think you guys are articulating that there might be some macro stuff here, but also execution stuff. Can you share a little bit more how you're thinking about with a couple of quarters left, what you can do on the execution side, whether it's org or leadership changes? And then the second question, maybe if I could just go ahead and ask it, and I can repeat it if you all forget is, have you all maybe over-indexed on the upmarket activity? Because there is lots of smaller employers under 500 employees. Is there any way – I know it's easier said than done, a bit of a pivot to that market? Or is that market just less active? Thank you.\nSteve Beauchamp: So I think what I would say is I don't think we need any major structural changes. I think we've got the team in place. When we look at what we've got from a pipeline perspective and we look at all of our internal metrics, we feel pretty confident that the ability to execute sits in front of us, big market, great product in terms of receptivity. And so we feel pretty good about that. We have grown pretty fast to your second question, in upmarket. Maybe hindsight's 20/20, it's hard to say that's been a great tailwind for us over the last two or three fiscal years. So hard to actually say that wasn't successful. Did it create some bumps in the road maybe early on in this fiscal year, yes. But the product is being received really well in the marketplace. The pipeline is really, really strong. We've got a great group of people that we feel like have been productive and will continue to be productive, and we've got to focus on execution in terms of what's in front of us.\nTerrell Tillman: Got it. But just Steve, just a real quick kind of follow-up because one thing you did note is the pipeline. I mean, if these deals are closing, that they just stay in the pipeline. I'm just curious, do these folks though at some point just kind of slow down or just cut it off and then you have to kind of get in the new sales cycle with them into next year? Or could some of these larger deals actually play out in the next couple of quarters? I'm just trying to understand how some of these larger deals could potentially play out because this is a newer business for you. So maybe you don't have pattern recognition? Thank you.\nSteve Beauchamp: Sure. No, it's a fair question. I think we've been in this space for a while, but really more of the last three fiscal years kind of in earnest where we've been expanding more significantly. And as I mentioned earlier, we've ramped the reps up more significantly over probably the last two years with more hires from outside of the industry. So we do continue to learn. I think you see many people in this space talk about a long-dated sales cycle. So I think there's a macro element to that. That's certainly the feedback that we hear from our reps, which is just taking a little bit longer to get the decisions. We look at both top of funnel pipeline as well as late-stage pipeline, and we see pretty strong activity all the way through. So that gives us confidence that we've got an opportunity to be able to push some of those deals through on the back half of the year and have a better back half than we did on the front half upmarket.\nTerrell Tillman: Okay. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Brian Peterson with Raymond James. Your line is open.\nBrian Peterson: Hey. Thanks. Two quick ones for me. So given what you're seeing in terms of the sales cycles and the productivity ramping, does that change your plan on sales hiring, at least for fiscal year 2024 and how we're thinking about fiscal year 2025?\nSteve Beauchamp: Yes. So I think we got this question last quarter in terms of how we think about adding per segment. And I think the last couple of times we would say it's much more even. So we're not adding more in the upper end of the market relative to our core marketplace. And so we've already kind of made that shift. I think there's an opportunity for us to be able to – we're focused on an absolute new ARR number versus a specific number of reps. And if we have an opportunity to press on productivity to be able to get there, we always go there first. That's always kind of our thought process. So we won't make that decision until we go into next fiscal year. But I would say we feel pretty good about the staffing level that we've got right now. We feel good about the initiatives that we have to drive productivity, and we'll give you more color as we kind of go into next fiscal year.\nBrian Peterson: Understood. And Ryan, I'm sorry if I missed this, but any help on how to think about interest rate implications in the updated guidance? Thanks guys.\nRyan Glenn: Sure. So in the prepared remarks, I went through and gave you average daily balance and yield assumptions. I think we did bake in a contemplated 25 basis point Fed funds cut in May. The impact of that to the fiscal year, obviously very – in the middle of the fourth quarter. So muted impact, but it's probably about $1 million or so impact to Q4, and that's factored in the guidance.\nBrian Peterson: Thanks guys.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Mark Marcon with Baird. Your line is open.\nMark Marcon: Hi. Good afternoon, guys. Just want to follow-up. The same kind of line of questioning as some of the others, but maybe a slightly different way with regards to the employment trends that you're seeing, and thanks for narrowing it down to the hourly employees and some of the clients. The last couple of quarters, we were talking about employment trends kind of being flat year-over-year. Are you actually seeing them decline on a year-over-year basis now?\nRyan Glenn: We're not seeing them decline yet year-over-year. They're still actually up a touch in the first half of the year, but we're certainly seeing softness on a sequential basis. So when we think about what we saw in the first quarter and called that out last quarter and what we've seen in October through December, we are seeing some of that sequential flatness. So they still are up in the first half. But I think if this trend continues, they will certainly turn negative in the back half of the fiscal year on a year-over-year basis.\nMark Marcon: And that's what you're expecting?\nRyan Glenn: That is what we have factored into guidance, yes, based on the fact that we've now seen several months of the sequential trend down.\nMark Marcon: Okay. And then with regards to the elongated sales cycles. Obviously, that always occurs when there's macro challenges and if employment is trending down, then that would imply that. But I'm wondering, are there any other factors aside from the macro and also maybe some sales execution? In other words, if you talk to your more experienced sales folks and if some of them are not performing as well as they previously had, are you hearing any feedback with regards to, hey, maybe the level of urgency to modernize the solution isn't quite what it was, say, three, four, five years ago because there's a greater percentage of clients that have moved to more modern solutions and most of the large legacy players have become better and have improved their solution? In other words, is switching to Paylocity as compelling as it used to be?\nSteve Beauchamp: Yes. So I have not heard that. We've had a lot of conversations with our teams internally and many of our top reps. It more comes down to more decision-makers involved, more stage gate processes that they've got to be able to do to get things across the finish line, a little bit of delay in that decision-making process. That's the kind of stuff that comes up. We haven't necessarily seen maybe a different competitive environment that's caused that. It just – it seems to be on the elongated sales cycle comment more driven by the prospects.\nMark Marcon: Okay. Great. And then are you seeing any change in behavior in terms of just the number of either upsells in terms of modules or for new logos, number of modules that they want to take on?\nToby Williams: Hey, Mark. No, I don't think we've seen any change in that. I mean, I think we've been fairly steady in terms of take rates for new logos. And I think probably just to add on to that, we've added a significant amount of product over the course of the last year or so. And I think we've been overall fairly happy, not just with the differentiation that that's helped us continue. But with the attach rates that we've seen in some of the newer products, almost all of which are in early stage yet still, but I think we've been pleased with what we've seen so far.\nMark Marcon: Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Jared Levine with TD Cowen. Your line is open.\nJared Levine: Thank you. How did this January's revenue retention compared year-on-year, even so it's consistent, were there any underlying changes based on employer size segment or controllable versus uncontrollable churn?\nSteve Beauchamp: Yes. So I think we really kind of give more of an update at the end of the year from a retention perspective. It was not something that we called out in the script. I think we see fairly consistent performance there. We did call out historically, everybody was kind of seeing record high retention after – right after COVID. People definitely didn't seem to be moving quite as much. And we've certainly seen that return back to the pre-COVID levels, but I don't think there's any specific call out from a retention perspective.\nJared Levine: Got it. And then how would you anticipate the price you charge for your payroll software to change over the medium-term, if at all? Does the increasing access to payroll offerings through solutions such as embedded payroll represent a threat to pricing power?\nSteve Beauchamp: I don't think we've seen that competitively in the market really at all, particularly in the market that we serve. And you start to get to a slightly larger client size in the very micro small market, you might see more activity of that there. That's probably not a place we play in as much. So no, that – we don't see that as necessarily a factor.\nJared Levine: Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Raimo Lenschow with Barclays. Your line is open.\nRaimo Lenschow: Hey. Thanks for squeezing me in. I had two questions. You changed your full-year guidance on the revenue side a little bit, but EBITDA stayed the same. Can you talk a little bit about the action you are taking there to protect the profitability there? And then I have one follow-up. Thank you.\nRyan Glenn: Sure. I think – so I certainly feel good about where we've driven profitability so far this fiscal year. So in second quarter, over 600 basis points of leverage on adjusted EBITDA, 470 basis points, if you strip out the impact of interest income. So we have a number of programs across the business from a efficiency and scalability perspective, reducing manual processes and making sure that we're really prioritizing spend and continue to be pleased with the output of those programs. And I think that has allowed us in a maybe more challenging year from a revenue standpoint to be able to maintain really strong profitability and in fact, actually take up margin for the fiscal year. So really happy. I think it just demonstrates the scalability and profitability of the business, and we've seen that both in adjusted EBITDA as well as in free cash flow.\nRaimo Lenschow: Okay. Perfect. And the follow-up was on – you kind of mentioned in the script and in the prepared remarks, your leading position on the AI side. Like how does that play out? And how do you see the maturity of that solution? And how does it play out in sales cycles already? Is that already a differentiator? Where are clients in terms of the understanding? Thank you.\nSteve Beauchamp: Yes, it's a good question. I think we're still very much in the early innings. And I think customers are also themselves trying to figure out how, in an HCM platform, AI can provide them benefit. And so we've been often first to market with many of the AI capabilities and we're definitely seeing clients use it and you get tying into the LLMs and having writing assistance and job descriptions and community. You have a much better option for personalization across the platform, easier to create recommendations based off your historical data set. Think about that like schedule recommendations that we've launched. And we've got a long list of ideas that we can enhance customer value in terms of adding AI across the platform. So that continues to be our approach versus any type of separate monetization by SKU. I also think there's a big opportunity to really enhance the client experience. Clients do call and e-mail and we interact with them a ton. There's a lot of different questions and answers. And so that's an area that we continue to invest in as well as being able to provide much better, more personalized responses to our customers over time. And so I think we've got opportunities in both categories.\nRaimo Lenschow: Okay. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Siti with Mizuho. Your line is open.\nSitikantha Panigrahi: Thanks for taking my question. I want to ask about your Q3 guidance. If I look at your Q2 recurring and other revenue on a seasonality basis, like it only grew 2% sequentially versus last year, it was like 4.5%. But the way you are guiding for Q3, 22%, which is like same as last year. So did you see any kind of deals or go live that got pushed to Q3? Or are you seeing any kind of revenue contribution maybe from Trace? Or basically, I want to understand your confidence level with this guidance for Q3?\nRyan Glenn: Yes, nothing that I'd call out as far as onetime or any material movements in deals. I think Toby went through in his prepared remarks some of the challenges relative to January starts that we saw upmarket. We would have taken that into account and obviously, being on February 8, we've got a good sense of January starts and form revenue as well. So we're able to take all that into account as we guided into Q3. So feel good about that guidance, but nothing I would call out as far as onetime in nature or specific movements within the months or quarters that would have impacted that.\nSitikantha Panigrahi: And the Trace, what kind of revenue contribution you expect from Trace acquisition?\nRyan Glenn: Immaterial to the year, so it has no impact on guidance.\nSitikantha Panigrahi: Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Steve Enders with Citi. Your line is open.\nSteven Enders: Okay, great. Thanks for taking the questions here. Maybe just to start maybe following up on the kind of seasonality dynamics for 3Q into 4Q. Still kind of assumes another three or four points down on the recurring and overall growth line. So I guess, maybe can you just give a little bit more detail on maybe what's different in the assumptions for 4Q versus 3Q and kind of the delta in the growth rates between the two quarters?\nRyan Glenn: Sure. I think probably the two factors I'd call out would be obviously January starts, which we've referenced in the prepared remarks and in the Q&A here. So that probably had some headwinds in it relative to upmarket. So that as a factor in the third quarter but certainly into the fourth. And the other factor would be the macro impact. So as we've referenced we did see now really two quarters of weakness sequentially, and we assumed some further moderation in the back half. So that has an impact in Q3. But as you get to the fourth quarter, that would have all the impact we've seen year-to-date as well as the additional moderation that we factored in. So I think it's really those two items that would account for that sequential slowdown in revenue growth you're referencing.\nSteven Enders: Okay. All right. That's helpful. And then maybe just on the conservatism that you have kind of baked into the guide like any change in how you're thinking about the level of conservatism that's now being kind of the same tier?\nSteve Beauchamp: Yes. I don't think there's a change in any guidance philosophy. I think it's a matter of how long do you see a trend, and then do you have to account for it. So I think last quarter, we kind of assumed employment stayed flat and that you wouldn't see any continued sequential decline. We've seen that now for two quarters. So we think it's prudent for us to be able to take that trend into consideration. You also – Ryan just said, he took into account potentially a rate cut, and that's obviously included as well. And so we're also in the back half of the year, so you're only talking two quarters left. So I don't think there's any different in approach, but we felt like we should at least take into account all the things that we have seen so far and that seem at least reasonably possible into the guidance.\nSteven Enders: Okay, perfect. Thanks for taking the questions.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Alex Zukin with Wolfe Research. Your line is open.\nAleksandr Zukin: Hey guys. So maybe again, kind of similar line of questioning. It's a multiparter. The first being just if I think about the amount kind of taken out of the guide for this year, I think it's about $20 million on the recurring revenue line. Just dimensionalize like is half of that employment levels and half of that kind of either later starts or less starts. And then as we're kind of – maybe a few quarters removed from the long-term guide of 20%, given the exit rate of 12% to 13% in Q4. Is this something that's temporal and there might be kind of a year air gap until we get back to that 20% long-term target? Or are we talking more a quarter or two?\nRyan Glenn: Sure. I can hit the first question, Alex. I think roughly the impact from macro and the sales headwinds, roughly the same impact to the revised guidance. I wouldn't wait one or the other. They both certainly weighed on the guidance, particularly in the back half of the year. Relative to your second question on longer term, I'll let Steve handle that.\nSteve Beauchamp: Yes, I think the way we think about long-term model is over an extended period of time, and it's something that we've made a couple of updates since we've gone public we'll consider that as we go into the turn of the year and see if there's any changes that we want to make. We made some changes going into this fiscal year. We're still focused on growth as a priority. We still think there's a lot of levers that we can pull to be able to grow the business, huge TAM, products getting great adoption, pipeline is pretty rich and full. So at this point in time, no changes and same priority growth first and continued focus at the same time on margin expansion. And that's kind of been our formula for success in the past.\nAleksandr Zukin: Got it. And maybe just a quick follow-up. If I think about kind of everything you've referenced from on the sales go-to-market side, the execution side, what gives you kind of incremental confidence that there's also not kind of increased competitive pressure, maybe increased market saturation, that it's not those things that it really is kind of a temporal fix around both the macro current environment as well as the longer time to ramp for sales people?\nSteve Beauchamp: Yes, I think there are several factors there. So I think, number one, it's the conversations that you have with your sales force, especially the folks that have been here around a long time and the confidence level that they have in the product and service that we're offering. And then number two, I think it's the data that we get into. And when we're looking at the pipeline, we're looking at this in detail by deal, looking at what those close ratios look like. And so if the pipeline wasn't necessarily building and we weren't seeing these elongated sales cycles, I probably would have a different answer to that question, but that's very evident in the data that we're looking at. And so that provides us more optimism. And then I think lastly, it's the conversations that we have with current customers, and we're seeing how the product is resonating in the upper end of the space, and we're certainly having success. And so I think it's when you put those three things together, we think we have an opportunity to execute better on the back half of the year. And we have a big opportunity from a TAM perspective, and that includes the success we've had over the last several years in upmarket.\nAleksandr Zukin: Perfect. Thank you, guys.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Jason Celino with KeyBanc Capital Markets. Your line is open.\nJason Celino: Great. Thanks for fitting me in. Really sorry to beat a dead horse here, but the moderation you're making in on the employment levels in the second half, is there a way to think about the magnitude and the linearity of it?\nRyan Glenn: Yes. I think we hit the magnitude question earlier. And I think the way to think about that is relative to the revised guidance. Half of that impact is macro, roughly speaking, and half of it would be some of the sales headwinds I think the way that we assume that layered in over the balance of the year is we've seen a very small but consistent decline over the last five months, and we assume that similar level of decline in further moderation happens each month into Q3 and Q4. There wasn't a particular month or quarter that we had concentration. It was assumed that continued moderation happens over the course of the back half of the year.\nJason Celino: All right. Thanks for that clarification there. And then maybe on the Trace acquisition, can you talk about how that fits in or complements to the broader portfolio? And then with the near-term environment where you're seeing some pressure on workforce levels, how does headcount budgeting and forecasting kind of fit in, in terms of priority?\nSteve Beauchamp: Yes. So I think it's certainly been a little bit tighter economy and when we talk to our customers, and they're certainly trying to be able to manage their cost as well as the growth that they might see in their business. And so one of the challenges that our customers tell us about is people are one of the largest costs that they have. And when somebody then leaves the organization, are you going to replace them? Are you going to replace them right away? Or are you going to replace it in a different position? How do you then approve requisitions for new positions? All those concepts in a tighter economy become even more important parts of the conversation. And we have all the data about the people in our platform already. And so when you can layer in workflows and approvals for that activity to happen, you can layer forecasting capabilities, on rules and routing that becomes really attractive in terms of driving both cost efficiency for our customers as well as just purely efficiency in terms of getting those actions done where the data already exists today.\nJason Celino: Interesting. Thanks.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Dan Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Great. Thanks for taking my question. So I appreciate all the clarity on the slowdown in the upper end of your market. I think just to be explicit, if you look at your core customer that has 100 or 200 employees, which I think is close to the average size of the folks you have on the platform, have you seen a change in the velocity of new bookings there or sales cycles?\nSteve Beauchamp: Yes. I think Toby called out the fact that we've had continued broker referrals that are really strong. That's obviously ends up being a big driver in the core end of the market. That's not something that we kind of called out. We feel good about the momentum that we have there. Still a big market, still relatively underpenetrated. I think the point we're trying to make is we've grown relatively quickly in upmarket, a lot of new people in that category, some macro impact that we're kind of feeling in there. You add that into what we saw from an overall macro perspective, and that's really the bigger factor worth calling out on the sales side.\nDaniel Jester: Okay. Great. Thank you. And then maybe just get a refresh take on how you're viewing your capital allocation strategy. It looks like you're going to end this fiscal year with kind of north of $400 billion on the balance sheet. Most of your acquisitions have been more tuck-in in nature. How are you thinking about organic versus inorganic? And is there opportunities to maybe deploy capital in other ways going forward? Thank you.\nToby Williams: Yes. I'd probably give you a fairly consistent answer on that, Dan. I think we ended the quarter with [$400 million] or so on balance sheet, and that will certainly grow as we go through the back half of the fiscal year. You're right, I mean I think we've been pleased with the acquisitions that we've done and being able to use those as drivers for strategy and growing the portfolio. I think that continues to be of interest to us. And I think as we get through the back half of this fiscal year, we'll continue to look at other ways to allocate capital as we go through the year. But I don't – no massive change in our mentality around that.\nDaniel Jester: Okay. And just a quick one then on Trace. Is that going to be a separate standalone SKU? Or is that going to be embedded into another product?\nSteve Beauchamp: Yes. We haven't really made any big announcements in terms of what the product strategy is. But what I would tell you based off of our prior acquisitions is we really try to take the time to build it into our platform such that from a user perspective, you would have no idea whether we built it ourselves or we acquired it and then use that team that we acquired to build it into our platform. So we're doing that work right now, and we're figuring that out. I definitely think there's a fair amount of value in the product. So if you can save customers both time and drive more efficient process and ultimately save them people dollars, then that certainly becomes a monetizable option. So that would certainly be the lean sitting here right now.\nDaniel Jester: Great. Thank you very much.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Matthew VanVliet with BTIG. Your line is open.\nMatthew VanVliet: Hey. Good afternoon. Thanks for taking the question. Curious on how the referral network performed. Any trends there that you're seeing that maybe deviate from what some of the direct business looks like?\nToby Williams: Yes. I mean I think just a quick refresher. I mean, that's referral deals that we end up selling directly, but I think no major change in terms of the production there, called it out in the script, 25% plus of new business continuing to come from the referral channels, primarily benefits brokers and financial advisers and the like. And I think that's been a really successful channel for us over time and year in, year out has also been fairly consistent and fairly consistent throughout the course of this fiscal year-to-date. So continue to see a lot of strength there and continues to be a producing channel for us.\nMatthew VanVliet: Great. And then as you look at some of those upmarket deals that sales cycles are elongating to a certain extent, anything you'd peg there? Are they evaluating more vendors? Is it a little more competitive there? Or is the ask trying to get multiple products in the door, creating any additional friction than maybe just trying to get your foot in with payroll and go from there? Curious on how you're analyzing sort of the trends there.\nToby Williams: Yes. I don't think any of those things have necessarily been the case. I go back to a couple of the comments that Steve made. I think we've continued to see the pipeline build. I think we've continued to get access. I think what we've seen is you might have more decision-makers, you might have more gates in the process, more reviewers in terms of the actual purchasing. And so I think those have more been the dynamics than challenges gaining access or challenges around how much product gets added into a deal or something like that. I think we've seen product take rates remain fairly consistent throughout all sort of areas of the market. And like I said earlier, I think we've also seen. We've also been happy with the attach rates that we've seen with some of the newer products. So I think that's what we've seen so far.\nMatthew VanVliet: All right. Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Adam Bergere with Bank of America. Your line is open.\nAdam Bergere: Hey. Thanks for taking my question. Just given the macro is obviously out of your control, where are some of these growth levers that you mentioned that you think you can pull it in the next six to 12 months, so to say? Thanks.\nSteve Beauchamp: Yes. So I think there's a lot of the growth levers that we have been pulling for the last several years continue to be an opportunity for us. So we've had a pretty robust new product introduction cycle. Toby mentioned, we're pretty happy with the initial take rates there. So attaching those new customers and selling those back to customers become an opportunity. Obviously, rolling into Trace and getting that product out in the market will be a future opportunity. So we're excited about what we got from a product perspective. And then I think, overall, we've got pretty significant presence both in our core market as well as upmarket. And we're getting good receptivity of those products and the enhancements that we're making to the product. So we're really leading with the most modern platform in the industry and we feel good about that. It's really up to us to be able to continue to execute. Broker channel remains really strong. We're executing really well there. So there's certainly a lot of positives. We obviously focus on this call on areas that we have opportunity to make improvements in, and we're committed to make those improvements. And our turnover rates have been really, really low. So we've got the team to be able to do it, and we've got a strong pipeline, and that's what we're going to focus on.\nAdam Bergere: Thank you for that. And I guess following up, is this fair to say you'll lean in a little bit more into upsell? Or is that focus unchanged? Thanks.\nSteve Beauchamp: We have been leaning in gradually more to upsell. Over the last few years, we've called out the fact that our internal salesforce that's selling back to the customers has grown at a much faster rate than any of our other salesforces. And that is – that team has done really well this year. It's been certainly a standout for us, and so we'll continue to do that on a go-forward basis.\nAdam Bergere: Great. Thank you, all.\nOperator: Thank you. Ladies and gentlemen, at this time, I would like to turn the call back over to management for closing remarks.\nSteve Beauchamp: Well, thank you very much for all of your interest in Paylocity. And I just want to echo one of Toby's sentiments from the prepared remarks, thanking all of our employees for their efforts over a very busy year-end. Have a great evening, everyone.\nOperator: Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect."
  }
]