[
  {
    "symbol": "PCTY",
    "period": "Q4",
    "year": 2024,
    "date": "2024-08-01",
    "content": "Operator: Hello, and thank you for standing by. Welcome to Paylocity Holding Corporation Fourth Quarter 2024 Fiscal Year Results. At this time, all participants are in a listen-only mode. After the speakers’ presentation, there will be a question-and-answer session. [Operator Instructions] I would now like to turn the call over to Ryan Glenn. Sir, you may begin.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the fourth quarter of fiscal year 2024, which ended on June 30, 2024. I'm Ryan Glenn, Chief Financial Officer. And joining me on the call today are Steve Beauchamp and Toby Williams, Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, Toby will be attending the Stifel Tech Executive Summit in Deer Valley on August 27, and I will be attending the Citi Global Tech Conference in New York on September 4 and HR Tech in Las Vegas in late September. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thank you, Ryan, and thanks to all of you for joining us on our fourth quarter and fiscal 2024 earnings call. Our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace and help drive recurring revenue growth of 15% and total revenue growth of 16% in Q4. For fiscal 2024, recurring revenue grew 17% over fiscal 2023, and total revenue grew 19% and finished at $1.4 billion. Our solid results were once again driven by both adding new clients and employees and increasing average revenue per client. We ended fiscal 2024 with 39,050 clients compared to 36,200 at the end of last fiscal year, an increase of 8%. Additionally, our average number of employees per client increased to over 150 given our continued upmarket success. Average recurring revenue per client was nearly $33,000 in fiscal 2024 compared to just over $30,000 in fiscal 2023, an increase of approximately 8% as a result of increasing product attach rates across our client base. We continue to attach more product at the time of sale and have realized increased success selling back into existing clients as our products, focused on the modern workforce, resonate across our entire client base with Learning Management, Recognition & Rewards and Employee Voice seeing particular success. Our sustained investment in product development allows us to continue to expand our product suite, evidenced by the release of several new premium offerings and feature enhancements in fiscal 2024, including Recognition & Rewards, Employee Voice, Advanced Scheduling, Market Pay, AI-driven personalized learning plans and our next-gen mobile app. We are pleased with the early traction of these new product offerings, highlighted by more than 30,000 market job searches within Market Pay, over 500,000 AI-assisted platform interactions and our mobile app ranking is one of the highest in the software industry with the majority of employee interactions on the platform now occurring via mobile. Our commitment to product development continues to be recognized in the market with Paylocity recently being ranked as an overall leader for 10 product categories in G2's Summer 2024 Grid Reports, listed as the Best Payroll and Software combo by Forbes Advisor, named as TrustRadius Top Rated HR Management software platform for the second year in a row and recognized in Gartner Peer Insights 2024 Voice of the Customer for cloud HCM suites for 1,000-plus employee enterprises. I would now like to pass the call to Toby to provide further color on the quarter and fiscal 2024.\nToby Williams: Thanks, Steve. As Steve highlighted, in fiscal 2024, we continued our investments in R&D to further grow our differentiated value proposition of providing the most modern software in the industry and increased our PEPY by more than 10% with the introduction of new premium products and feature enhancements. And we're excited to continue this trend with the launch of headcount planning later in fiscal 2025. In Q4 and fiscal 2024, our differentiated position was reflected in solid sales execution. And we have continued investing in our go-to-market functions to carry this momentum into fiscal 2025 across sales, marketing and channels. Coming into fiscal 2025, we expanded our sales force by 8% to 885 sales reps and will be focused on continuing to drive productivity and efficiency across our teams. Consistent with prior years, we are pleased to be fully staffed to begin fiscal 2025. We continue to successfully attract the best talent in the industry, and we believe that we are well positioned for the fiscal year. We have also continued to invest in our marketing and channel efforts to support our sales teams throughout fiscal 2025, including the recent release of our new Benefits Decision Support enhancement to help continue driving further differentiation and value to our clients and broker channel, which once again, delivered 25% plus of our new business in Q4 and fiscal 2024. Revenue retention also remained strong at greater than 92%, and we remain committed to continuing to invest in our service and support teams to deliver world-class service to our clients. The strong culture at Paylocity continued to be recognized this fiscal year as we were recently named one of Forbes' Best Employers for Diversity for the third year in a row, received ATD's BEST for Employee Talent Development Award and earned the Great Place to Work certification for the seventh consecutive year. Our strong culture, industry-leading software and exceptional sales and operational execution would not be possible without the dedication and commitment of our over 6,000 employees. As we close out a very strong fiscal 2024, I'd like to thank all of our people and teams for a fantastic year. I would now like to pass the call to Ryan to review the financial results in detail and provide fiscal 2025 guidance.\nRyan Glenn: Thanks, Toby. Recurring revenue for the fourth quarter was $324.7 million, an increase of 15%, with total revenue up 16% from the same period last year. As Toby noted, our sales team had another solid quarter, and we were pleased to come in $5.5 million above the top end of our revenue guidance with the majority of our Q4 beat coming from recurring and other revenue. Adjusted EBITDA for the fourth quarter was $120.2 million or 33.6% margin and exceeded the top end of our guidance by $13.1 million. For fiscal 2024, adjusted EBITDA was $505.6 million or 36% margin, and an increase of 35% on a dollar basis from fiscal 2023, resulting in leverage of 410 basis points. Excluding the impact of interest income on funds held for clients, adjusted EBITDA margin for fiscal 2024 was 30%, reflecting operating leverage of 280 basis points versus fiscal 2023. Additionally, we continue to show strong progress on free cash flow with fiscal 2024 free cash flow margin of 21.8%, up 340 basis points and an increase of 42% on a dollar basis from fiscal 2023. Excluding the impact of interest income on funds held for clients, we drove 170 basis points of operating free cash flow leverage in fiscal 2024 to 14.4% margin. Given our increased profitability and limited remaining NOLs and credits, we expect to become a full cash taxpayer in fiscal 2025, which will create a free cash flow margin headwind in fiscal 2025. But we remain confident in our ability to continue expanding free cash flow margin in the coming years. We continue to make significant investments in research and development and to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a combined non-GAAP basis, total R&D investments were 14.6% of revenue in the fourth quarter and on a full year basis, total R&D investments were 14.2% of revenue. On a dollar basis, our year-over-year investment in total R&D increased by 18% in fiscal 2024 when compared to fiscal 2023. We continue to believe our investments in R&D provide us with valuable product differentiation and the ability to drive future growth as we deliver the most modern platform in the industry. On a non-GAAP basis, sales and marketing expenses were 22.5% of revenue in the fourth quarter and 21.2% of revenue in fiscal 2024. On a non-GAAP basis, G&A costs were 9.6% of revenue in the fourth quarter versus 10.7% in the same period last year. Full year G&A costs were 9.3% of revenue as compared to 11% in fiscal 2023 representing 170 basis points of leverage, and we remain focused on consistently leveraging G&A expenses on an annual basis. Briefly covering our GAAP results. For Q4, gross profit was $240.4 million, operating income was $62.9 million and net income was $48.8 million. For the full year, gross profit was $960.8 million, operating income was $260.1 million and net income was $206.8 million. In regard to funds held for clients and interest income, our average daily balance of client funds was $2.8 billion in Q4 and $2.6 billion for fiscal 2024. We are estimating the average daily balance will be approximately $2.5 billion in Q1 of fiscal 2025 with an average annual yield of approximately 450 basis points, representing approximately $28 million of interest income on client health funds in Q1. On a full year basis, we are estimating the average daily balance will be $2.75 billion in fiscal 2025 with an average yield of approximately 390 basis points, representing approximately $107 million of interest income on funds held for clients. In regards to interest rates, our guidance assumes 425 [ph] basis point rate cuts during fiscal 2025 with the cut assumed in September, November, March and May reflected in guidance. Additionally, given the confidence we have in our business and our strong cash flows, we repurchased approximately 1.1 million shares of common stock at an average price of $142.82 per share for $150 million in aggregate repurchases during Q4. As a reminder, we have $350 million remaining under our share repurchase program. We also closed Q4 with $401.8 million in cash and cash equivalents on our balance sheet. In fiscal 2024, we also drove 200 basis points of leverage in stock-based compensation expense. And in fiscal 2025, we expect to drive continued leverage in stock-based compensation towards our target of less than 10% of revenue and are committed to driving incremental leverage and stock-based comp annually going forward. Finally, I’d like to provide our financial guidance for Q1 and full fiscal 2025, which includes the impact of the 425 basis point interest rate cuts in fiscal 2025, as mentioned earlier, and roughly flat workforce levels in fiscal 2025 versus fiscal 2024. For the first quarter of fiscal 2025, recurring and other revenue is expected to be in the range of $325.5 million to $330.5 million or approximately 12.5% growth over first quarter of fiscal 2024 recurring and other revenue. And total revenue is expected to be in the range of $353.5 million to $358.5 million or approximately 12.1% growth over first quarter fiscal 2024 total revenue. Adjusted EBITDA is expected to be in the range of $116.5 million to $120.5 million. In adjusted EBITDA, excluding interest income on funds held for clients is expected to be in the range of $88.5 million to $92.5 million, which represents approximately 60 basis points of leverage over Q1 of fiscal 2024. And for fiscal year 2025, recurring and other revenue is expected to be in the range of $1.405 billion to $1.420 billion or approximately 10.2% growth over fiscal 2024 recurring and other revenue. Total revenue is expected to be in the range of $1.512 billion to $1.527 billion or approximately 8.3% growth over fiscal 2024. Adjusted EBITDA is expected to be in the range of $533 million to $543 million. Adjusted EBITDA, excluding interest income on funds held for clients is expected to be in the range of $426 million to $436 million, which represents approximately 50 basis points of leverage over fiscal 2024. Despite the macro headwinds we faced in 2024, we’re pleased to finish the year with 19% total revenue growth, 17% recurring revenue growth and adjusted EBITDA margin of 36% and a rule of 55 overall performance. As we kick off fiscal 2025, we remain confident in our differentiated value proposition, go-to-market strategy, operational strength and product road map, and we have a high level of confidence in our ability to continue driving durable revenue growth and increasing margins as we execute against our multiyear goal of achieving $2 billion in total revenue. I would now like to turn the call over to Steve for final remarks.\nSteve Beauchamp: Thanks, Ryan. As announced in our earnings release, I’m excited to move into the role of Executive Chairman of the Board effective August 5. This is the natural evolution of the co-CEO model we put in place in March of 2022. I have full confidence that under Toby’s leadership as President and CEO of Paylocity, will continue its market-leading position. My role as Executive Chairman will allow me to continue to focus on product and corporate strategy while working closely with Toby and the Paylocity leadership team to continue delivering the most modern platform in the industry. As Executive Chairman, I will continue to dedicate my time and energy to Paylocity, including participating on all future earnings calls. Looking back, I’m very proud of everything we have accomplished and I’m very excited about our future opportunities. With that, we are ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question comes from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Great. Thanks very much. And Steve, it’s been a great run, and I know it will continue. Given your experience, Steve and Toby, in the market for as long as you’ve been in it, can you help frame up what’s going on? Obviously, growth has meaningfully decelerated across the industry. Is this purely cyclical? Or are there some secular issues at play here as well? Thanks.\nSteve Beauchamp: Sure. I’ll start, Brad. I think you’ve got a few things going on. So I think, first of all, we remain pretty excited about the size of the opportunity. So we obviously have a small penetration rate in terms of the available TAM. And so we still think there’s a great opportunity to be able to grow. You’ve got certainly some law of large numbers and then growing at this size and scale. Certainly has been impactful. We’ve called out the most recent impact in terms of whether it was employees on the platform or some of the economic headwind we saw in the sales cycle, we see certainly some impact from that. And so I think you get to a bit of a new normal where we still have an opportunity to be a growth company focused on that $2 billion target. And at the same time, we’ve shifted our focus to driving profitability. And so we’re balancing that equation. I think when you put all that together, we’re still pretty excited about the story that we’ve got in front of us and the size of the opportunity.\nBrad Reback: That’s great. Thanks very much.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Samad Samana with Jefferies. Your line is open.\nMason Marion: Hi. This is Mason Marion on for Samad. Thanks for taking our questions. So congrats on the move, Steve. Can you talk about why you felt this is the right time to step back in the co-CEO role and glad to hear you will still be joining us on these calls in the future.\nSteve Beauchamp: Yes. It feels pretty natural, I think, internally. Toby has been co-CEO now for over two years, and I have been gradually transitioning different functions to him. This past year, I have largely been focused on our product and technology organization. So that will obviously transition to him formally and that team will report into Toby. However, I will still be involved in the product initiatives as I have before, I’ll be involved with our corporate strategy team as we kind of chart out our course over the next several years. So I think this is the stuff that I’m the best at, to be quite honest with you. It gives me an opportunity to focus on that. And I think the second part is I’ve got a tremendous amount of confidence in both Toby and the team of executives that we have around so that I feel like I’m in a position to do that.\nMason Marion: Thank you.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Scott Berg with Needham & Company. Your line is open.\nScott Berg: Hi, everyone. And Steve, good luck on the next step. And Toby, I hope you have really big broad shoulders. You might need them. Couple of questions for me. Let’s start off with the guidance for the year. The guidance would at least to me imply subscription revenue growth of sub-10% exiting the year. How do we think about kind of breaking that down a little bit between ARPU growth and net new customer adds? Your growth between accounts and customers pretty balanced last year roughly 8% in each of those categories. But we’re going to be in the sub-10% category, how do we think about what that kind of blend looks like?\nToby Williams: Hey Scott. I mean, I think you saw a pretty balanced performance this last year, and I think that came from the result of executing pretty well from a go-to-market perspective, driving, I think, a ton of new products to market over the course of the last, call it, 1.5 years or so and having success with those products, both in terms of attached to new deals and then being able to sell back into the customer base. And I think ultimately, then we also had strong execution from an operations perspective and providing service to our clients. So I think had a pretty balanced year. As you know, those numbers in the mix has pushed around in prior years a little bit. And I think as we jump into fiscal 2025 we’re really pressing on all the same things, driving strong go-to-market execution, continuing to drive from a product execution and from an attach and penetration perspective and then ultimately, same thing from an ops standpoint, delivering world-class service to our clients. So yes, I think it has changed. The mix is different in every single year. I think we’re happy with the result from a balance perspective in fiscal 2024. And I think as we jump into 2025, it’s continuing to drive on those three things and probably expect that to be you don’t know exactly where it’s going to land throughout the course of the year, but probably expect a relative level of balance in those different factors.\nScott Berg: Understood. Helpful. And then, Toby, I think you noted that your sales capacity is up 8% year-over-year going in this year, you’re fully staffed for the busy selling season. But how do we think about your investments here going forward through the balance of your fiscal year here? What have you contemplated for capacity growth into next spring? And then how flexible are those plans assuming that the macro might potentially change both one way or the other?\nToby Williams: Yes. I think we’ve maintained a fair amount of flexibility as we go through the course of fiscal 2025. And I think that’s been – that’s certainly been our thinking and what we’ve said over the last couple of quarters. And I think the recognition coming into 2025 was that we want to be rightsized for the opportunity in front of us in terms of go-to-market capacity. And as Steve said, I think we feel really good about the opportunity out there in the market. coming in with 8% year-over-year growth in reps, I think, allows us to press on the productivity levers as well as we’ve launched a lot of new products. We feel really good about the go-to-market motion. And I think coming in fully staffed with the ability to attract, I think, the best sales and go-to-market talent in the industry, I think we feel really good about how we’re positioned coming into the year. And if we get an uplift in terms of what the macro looks like. I think we have the flexibility that would allow us to even move that up from where we’re starting and coming into the fiscal year.\nScott Berg: Great. Very helpful. Thanks for taking my questions.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Mark Marcon with Baird. Your line is open.\nMark Marcon: Good afternoon and thanks for taking my questions. Steve, it has been a tremendous run and glad that you’re going to stay and Toby, congrats in terms of taking on the sole role [ph]. I’m wondering with regards to the comments on the back-to-base motion, can you tell us how big the internal sales group is in terms of that back-to-base motion? And how much when we take a look at the bookings over the course of this year, how much was from new logos versus upsells into the existing base? And how do you think that could trend?\nToby Williams: Yes. I mean maybe just start with a little bit of the history. I think if you go back to our back-to-base motion really would have started in earnest coming off of ACA and that was coming out of, I think, 2016 general time frame wise. And I think that was really the start of that motion and being able to go after that opportunity for us. I think we’ve continued to invest in that more so every single year. And part of that is, as we’ve grown the client base. Part of that is we’ve also grown the product set that we have available to sell back into the base and deliver incremental value to our existing clients. And I think that’s been the direction of it over the last handful plus of years. And in most years, we’ve invested the headcount growth in that team has been higher than the overall coming off a smaller base than and bigger one now. But that’s been the investment philosophy. I think it’s paid off really well for us, both in terms of being able to drive incremental product attachment penetration and incremental revenue growth. But it’s still smaller on a relative basis to our focus on going after new logos and new business in the market. And I think that’s – but as we come into 2025 and even as we look forward, I think our philosophy around investing there would remain true and constant in terms of continuing to deploy dollars there. And ultimately, it’s about being able to bring back solutions to our customers who might not have bought those products or those solutions at the outset of their partnership with us and being able to just keep providing more and more value to our client base.\nMark Marcon: Can you say like how big it is in terms of the incremental bookings that you had this year relative to the total bookings and where that could ultimately go?\nToby Williams: Yes. I don’t think we’ve done that with any of our different teams. But I guess, try to give you a pretty good directional view of how we’ve thought about the opportunity. And I think from a strategy perspective and then into the execution, I think the real focus is on continuing to drive new unit growth, continuing to drive the employees on the platform and also expanding the product set to be able to continue to take advantage of that opportunity as we look forward. And again, ultimately, just being able to deliver incremental value year in and year out to our client base.\nMark Marcon: Great. And then can you just comment with regards to – you mentioned success in terms of engagement tools, LMS is getting good upsell. On some of the upsells, obviously, some of them you’re pioneering and they didn’t exist before. Not broadly available. But things like LMS, which have been around, are you displacing other players or some of your clients is basically saying, hey, this sounds like a great tool that we haven’t used before.\nSteve Beauchamp: Yes. I think as we think about our new product strategy, you can kind of fit it into a couple of buckets. So one ends up being kind of an innovation in the market where we’re often first to market, and we’re able to sell that as a new module and then the second category probably refers to kind of LMS or even think about that as scheduling plus where we have an existing offering, and we’ve enhanced it to a point where there’s additional capabilities that we think we can monetize and bundle. And so LMS was a new bundle that we had with additional content that was available from a compliance perspective for customers that they saw value in. So we have the opportunity there to sell that to new customers as they come on board, but we also have the opportunity to go back to customers. And so as we think about the product opportunity going forward, we look for both of those opportunities. How do we add more value by taking our products to the next level and coming up with new bundles and packages that offer them value and then how do we come up with new and innovative ideas that allow us to continue to be the most modern platform in the industry.\nMark Marcon: Great. Thank you.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Brian Peterson with Raymond James. Your line is open.\nBrian Peterson: Thanks, everyone. And Steve, it’s been a heck of a run. I’m glad you’re staying on and Toby I’ll echo a well-deserved congratulations. So we’ve seen growth rates moderate across the industry. I appreciate there’s still a big opportunity ahead as you look towards $2 billion in revenue. But I’m curious if there’s anything that’s changed as you’re thinking about your guidance strategy.\nToby Williams: No, I don’t think there has been. I mean, I think we’ve been pretty consistent in our guidance philosophy over the course of time. And I think we come into fiscal 2025 with that same philosophy. And yes, I think we try and call what we can see right in front of us at the beginning and evolve that as we go throughout the course of the year.\nRyan Glenn: Yes, Brian I’d agree. I think obviously, had a strong fourth quarter, particularly on the recurring revenue side, really happy with where the beat came in feel like we’ve got a lot of momentum headed into fiscal 2025. But I think to Toby’s point, as we start out any fiscal year, certainly a desire to get back to a beat and raise cadence. I think you see a higher revenue growth in the first quarter. Was that closer to us and more visible and taking a sort of prudent and measured approach as we think about the balance of the fiscal year. I think with some strong execution, we feel really good about this plan and certainly feel good about the momentum across both product and operations and sales as well.\nBrian Peterson: It’s good to hear. Maybe following up just on sales hiring. I’m curious if anything has changed in terms of the types of reps that you may be looking to bring in and anything in terms of the type of people that are available in the current environment.\nSteve Beauchamp: Thanks. Yes, sure. It's a good question. I think Toby made the call out as well that we’ve been pretty happy getting fully staffed. And I would say we had very low turnover, certainly when you think of the performing category this year. So not only were we fully staffed, but we came in with a really strong team that we were able to retain going into the year. I think that really speaks to the position that we have in the marketplace. The reps often want to be able to sell the best product in the marketplace. And so we feel good about that. We continue to hire mostly with industry experience. So that would be another point I would make. We’re able to bring on talent. Sometimes it comes from a competitor, sometimes they’ve got prior experience in the industry, but we definitely feel like those folks can ramp faster. And so that is another element of our strategy in terms of building the sales force. And so all three of those elements were clicking going into this fiscal year.\nBrian Peterson: Great. Thanks, Steve.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Jared Levine with TD Cowen. Your line is open.\nJared Levine: Thank you. Can you discuss how top of funnel activity and pace of prospective client decision-making has trended since the last earnings call?\nSteve Beauchamp: So I think we highlighted on the last couple of earnings calls that we were definitely seeing good activity top of funnel. Think about that as first-time appointment opportunities. We are definitely seeing maybe a little bit longer decision cycles, particularly upmarket. And we are certainly making some changes in that part of the sales force just to be able to drive efficiency. So we feel like going into the start of this fiscal year, we’ve been able to continue to see strong top-of-funnel activity. We’ve been able to drive, I think, a better sales process and a more efficient sales process. The reality is those larger clients take longer to implement and start. And so I think we called out last quarter that you start to see the success of that on the back half of that year. You get a fair number of starts in January. So we’re off to a good start. We feel good about the plan that we’ve got in front of us, and the activity levels are strong.\nJared Levine: Great. And then in terms of the 4Q [indiscernible], can you discuss what drove that beat there?\nRyan Glenn: Sure. I think it was, as you said, that beat really coming from recurring revenue. I think sales activity was strong in the quarter. We felt really good about where retention ended from a fiscal year perspective. We probably saw some incremental positive trends from a workforce level perspective. I wouldn’t call that out as particularly material. But was incrementally better than expectations. So I think it’s really a combination of each of those items that drove a better fourth quarter than maybe it was initially expected.\nJared Levine: Just to clarify, were client employment levels flat quarter-over-quarter? Or was there still some sequential pressure?\nRyan Glenn: Did not see the same sequential pressure that we saw earlier in the year, up a bit year-over-year sequentially. That really started to normalize.\nJared Levine: Perfect. Thank you.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Terry Tillman with Truist Securities. Your line is open.\nTerry Tillman: Great. Thanks so much for taking the questions. Steve and Toby, congratulations to you both. Curious what kind of signals you are seeing down market and in the more traditional mid-market. And then I had one follow-up. Thank you.\nSteve Beauchamp: Yes. We’ve been pretty happy with the activity levels and kind of our core marketplace. So think about that as kind of under 500 employees. That’s where we have the bulk of our sales force, where we’ve been in a long time. We get a lot of our broker referrals coming in that marketplace. And so kind of the similar comments going in really well staffed. I feel really good about the staffing levels. Ryan just called out, certainly, sales was one of the reasons we beat in fourth quarter. So coming into this year with a fair amount of momentum. And the top of funnel comments would be the same. We’re seeing good top of funnel activity in the upmarket space as well as our core.\nTerry Tillman: Much appreciated. And then if rates move aggressively over the next couple of years, does that change your thinking around long-term margin targets? And if so, are those still achievable?\nRyan Glenn: Yes. I think we obviously reset or increased our margin targets on this call last year. And as I referenced in my prepared remarks, have made significant progress, not only this year, but over the last few years, well into the profitability levels that we have today. Certainly, there’s a potential headwind there. If you look at the guidance for 2025, we have four rate cuts assumed, so pretty aggressive rate cut activity over the next 12 months. I think the way that we would think about it is you’re seeing us continue to drive leverage ex flow, right? We’ve called out what the guidance looks like outside of interest rates, we’re guiding to, call it, 50 to 60 basis points of leverage this fiscal year. So obviously, that may be a headwind over time. But I think from an operational standpoint, we expect to be able to continue to drive leverage both within adjusted EBITDA as well as free cash flow.\nTerry Tillman: Thank you.\nOperator: Thank you. Please stand by for our next question. Our next question comes from the line of Jake Roberge with William Blair. Your line is open.\nJake Roberge: Hey, thanks for taking the questions. Just on the guidance, has anything changed from a competitive environment perspective that’s impacting the guide? Or is this mainly just the macro-driven issues and the law of large numbers as you scale?\nSteve Beauchamp: Yes. So I think it’s probably more the latter. We’re seeing the same competitors in the market. It’s always been a pretty competitive environment. You’re typically competing with two or three different other competitors as the customer is evaluating that, that dynamic has not changed. As certainly the law of large numbers, not just with us is with the competitive set as well. So we’ve all gotten bigger. And so that is definitely a factor. But when we look at the size of the opportunity relative to our size today, we still feel pretty comfortable that we can not only execute on the plan in front of us this fiscal year, but we can really set our sights on $2 billion and beyond.\nJake Roberge: Okay. Helpful. And then if you just had to parse out some of the growth drivers heading into next year, with – between new logos coming from competitive displacements and then thinking new logos that are being driven from that partner channel motion, and then the last being the expansion motion back into the existing base, which do you feel kind of the most confident in heading into next year and which might maybe be a little bit more pressured in the near-term?\nToby Williams: Yes. I mean, I would say, overall, I think we feel good about our relative position coming into the fiscal year. Most of your questions is really centered around go-to-market. I think we feel good about our staffing levels. We feel great about our level of talent across all the go-to-market teams, particularly the sales teams. Yes, I think we feel Q4 and then fiscal 2024, another year of driving 25%-plus of our new business coming through our referrals from our partners. And I think have a high degree of confidence in our ability to continue to execute that play as we go through fiscal 2025. So I mean, I think we feel good about our starting point coming into the fiscal year. We think we have some momentum around go-to-market. And I think that momentum and the confidence we have is fairly well balanced across each one of the areas that you asked about.\nSteve Beauchamp: Yes, I think the only thing I would add is, and we've made this clear in the last couple of earnings calls, we focused a fair amount of time. We've grown that upmarket team pretty aggressively. We've had great success over the last several years. It certainly was a little bit of a headwind into this year. But as we go into next year, we feel very well positioned with that team. That's the one that we called out before that we focused on, and that's the one that we spent more time and attention on. And if I look back at where we are at the start of this fiscal year with that team versus last year, we are in a much better position.\nJake Roberge: Very helpful. Thanks for taking the questions.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Daniel Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Great. Thanks for taking my question. Maybe one on sort of headcount planning that's coming up this year. As you think about a solution like that, it feels like it could be used in use cases beyond just in the HR suite. And so as you start thinking about your roadmap and the opportunity to expand wallet share within your customers, how are you thinking about selling into potentially different persona in the organization, if at all?\nSteve Beauchamp: Yes. It's a great question. I think one of the real values that we offer our customers is just the way we give them a platform to manage all their employee data. And when you've got all the employees continually logging into the platform, logging on to our mobile app and using the platform for things like workflows and approvals, it really does start to open up different opportunities. As we – you think we've been first to market on so many different products, you think of video as part of the platform, that probably wasn't something I would have imagined 10 years ago. So we're really starting to look at how do we leverage that employee data that we have to be able to really help our clients offer more value. Headcount planning has a natural tie to HR as position gets replaced, where a new position gets added, there's approvals, there's workflows. You've got to then tie it into your recruiting platform, then it gets tied into onboarding. So we're going to continue to maybe push the boundaries of what might have been a traditional HCM by leveraging that data set. And we're very excited. The CFOs, the persona that we'd be selling headcount planning to largely, they're very much involved in the sale already today. So I wouldn't call that out as a new persona. They probably become more of the primary buyer than maybe the decision-maker today. But our teams are really used to dealing with that persona. They have a lot of interaction with the CFOs today. So that part is probably an easier part of the equation for us.\nDaniel Jester: Okay. That's really helpful. And then, Ryan, I think you mentioned about sort of cash tax payments that we're going to see this year, and a little bit of a headwind on operating cash flow. Did you sort of quantify what that could look like maybe relative to EBITDA margin?\nRyan Glenn: So not in the prepared remarks, Dan, but I think the way to think about that is there's sort of a two-step process for us to becoming a full cash taxpayer. And you saw it step one this year and you look – if you look on the cash flows at the supplemental disclosure, you see we paid roughly $50 million of cash taxes this year versus just a few million dollars a year prior. So that is a headwind that we faced this year. Obviously, you saw significant increases in overall profitability, working capital improvement. So we grew through that, and we continue to leverage free cash flow. Next year, we'll have a similar step up. So you may be looking at $100 million on the round of cash paid for taxes. So that was the call out. Next year, we would become a full cash taxpayer, continue to have a lot of confidence in our ability to drive free cash flow leverage going forward. But that will be a headwind in this 12-month period that we'll be fighting through. Ex float, we'd still expect to be able to drive at least flat free cash flow margins, but did want to call that out as we are entering sort of inflection point there on the cash tax side.\nDaniel Jester: Great, thank you very much.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Pat Walravens with Citizens JMP. Your line is open.\nPat Walravens: Great. Thank you. And congratulations, Steve and Toby on – it seems like a well-planned transition. Are you guys seeing any sign that as your clients adopt more AI technologies, that's going to impact client levels?\nSteve Beauchamp: Yes. So we haven't seen that yet. And it's hard for us to know what's going to happen from a macro perspective in terms of AI driving efficiency in the overall workforce. As Ryan said, this last quarter, we actually saw things stabilized pretty well. So workforce levels were better last quarter than a little better than what we would have expected and pretty stable on a sequential basis. So no early signs that, that is kind of happening in the workforce today. And yes, I think one of the things you got to remember is just a significant part of that workforce that are in industries, that will take a much longer time to be impacted from an AI perspective. And I think lots of organizations might be hiring a little bit less trying to drive efficiencies in this type of macro market. That's been evidenced by workforce levels over the last 15 months. But when we talk to our customers, and we have interactions with them, we don't really hear AI as being the primary driver of that.\nPat Walravens: All right. That's great. Just a quick follow-up. What are some examples of some of those industries?\nSteve Beauchamp: Well, we're in every – it's a great part about our business, nearly 40,000 clients. We're in every industry. You can imagine restaurants, hospitality, and we really kind of line up, if you took like the Dun & Bradstreet distribution of businesses, our client base lines right up over top of that. So more than half of our client workforce is hourly, as an example, and that's the case kind of across America. So it really lines up to what you see every day.\nPat Walravens: Thank you.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Raimo Lenschow with Barclays. Your line is open.\nRaimo Lenschow: Thank you. Thanks for squeezing me in. A lot of the questions centered – like the growth questions that you got centered around like, okay, what's the growth outlook for you. But like I want to frame it slightly bigger. Do you think there has been a change – or do you think there's a change in industry growth rate? How do you see industry growth rate? And how it's both or last season, how you think about that going forward?\nSteve Beauchamp: Well, I think if you look at earlier in our growth trajectory, we were certainly relatively in terms of what the size of that opportunity. So now you've obviously got us at $1.4 billion, you've got Paycom a little larger than that, ADP, Paychex, UKG, all still grow. And so yes, I think there is some element of the law of large numbers. And it's always – like I said, it's always been kind of a competitive environment. I think you've had a macro that's been kind of uncertain overlaid on top of that. So we are not out there saying, hey, this is – we think we can grow this business at 30% per year. We're talking about, can we continue to grow this business double-digits on a recurring revenue basis? At the same time, can we drive profitability and margin? Because I think that's also a factor. You're trying to balance the equation. And so if you put all that together, and we think we can have kind of a great business. We outlined what those targets will look like last year. We've made great progress over this past year to be able to get there. And we feel good about our starting point and kind of focus on beating and raising from there if we can execute.\nRaimo Lenschow: Yes. Okay. Perfect. Yes, that's very clear. Thank you very much for that. And then, Ryan, one for you on capital allocation and in this context of the interest, well, maybe, like can you talk a little bit about how you think about like M&A, share repurchase, et cetera, from your perspective? Maybe remind us on where you're standing there. Thank you.\nRyan Glenn: Sure. So as you remember, last quarter, we announced a $500 million share repurchase program. We repurchased $150 million of stock this past quarter. So we have $350 million remaining under that program. There's no formal expiration date. So that's something that will be available to us for the foreseeable future. So that continues to be something that we will look at closely in fiscal 2025. I think for us, we have the ability to really drive a number of different priorities from a capital allocation standpoint. So having done $150 million of repurchase in the fourth quarter, we still have $400 million of cash on balance sheet. We have access to a significant amount of cash within our credit facility, and we have increasing cash flow. So we will continue to look at sort of all aspects of capital allocation. Obviously, we've had a handful of acquisitions over the last few years, we're certainly active looking. Bar is high for us, but we're looking at things that may be strategic as well. So I feel like we're in a great position and sort of all things are on the table because of where we are from a financial standpoint.\nRaimo Lenschow: Thank you.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Siti Panigrahi with Mizuho. Your line is open.\nSiti Panigrahi: Thanks for taking my question. I just want to dig into the recurring revenue per client growth. If I see that, that's two years back growing 18% to 14% to 8% this year, I mean, FY 2024. So what are the factors influencing that? Are you seeing any kind of pricing pressure or less cross-selling, lower size – customer size? What's driving that? And how should we think about that revenue per client going forward?\nSteve Beauchamp: Yes. I think, as we've called out, we have largely been focused on really landing new customers and selling them more product. And so when you've got 8% client growth, and you're selling those customers more product, that is a big contributor, that average revenue per customer. I think when you go back four years when it was higher, then we had much higher client growth. So that's one aspect. And then on top of that, we've called out the fact that we've been able to sell back to the client base pretty effectively. And so you put that together, and that's what gives us the 8% average revenue per customer growth.\nRyan Glenn: I think, Siti, the only thing I would add is, if you're going back a couple of years, which, I think, was embedded in your question, you have periods where you saw some pretty rapid expansion within the client base from a average number of employees as companies rehired post-COVID. So that likely showed up in that year-over-year growth in recurring revenue. So you've got some elevated numbers in the fiscal 2022 and 2023 period that probably, when you start to normalize it, would make those numbers look more consistent with what you would have seen last year.\nSiti Panigrahi: Okay. That's fair. Now looking at the client growth also, it assumes – I think your guidance assumes that for the resource and client growth, so what sort of trends are you seeing among customers switching their payroll vendors? And what's really driving that? Because it's a displacement market, so what is causing them not to switch or to switch in this kind of environment?\nSteve Beauchamp: Yes. I think you're trying to get at the same question of what does the growth model look like on a go-forward basis for this business. We're at $1.4 billion in revenue, and we feel like we can continue to grow this business on a recurring revenue basis double-digits. I think that's what we're talking about doing. And at the same time, we can increase profitability. The size of the opportunity is big enough. As you mentioned, everybody has to get paid some way. So the payroll component of it is often displacement. We then try to add additional products beyond that. And so we feel like we're approaching this with a growth priority, but a fairly balanced view on profitability going forward, and we think there's still a really big TAM for us to attack.\nSiti Panigrahi: Thank you.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Kevin McVeigh with UBS. Your line is open.\nKevin McVeigh: Great, thank you so much. Following up on the 2025 guidance, it looks like the recurring is outpacing the float, but it looks like the EBITDA is a little bit better. And all things equal, we think float's a little bit higher margin. Anything to reconcile like, where is the leverage coming in? Just given it looks like on a relative basis, again, core is outpacing the float a little bit. Just any puts and takes on how that flows to the EBITDA.\nRyan Glenn: Sure. So I think in the guidance, both in the prepared remarks as well as the earnings release, we provided a recurring revenue guide, a total revenue guide. So the delta there is going to be the interest income expectations. And then we gave adjusted EBITDA as well as adjusted EBITDA ex interest income on client-held funds. So you're able to see all the puts and takes. So I think if you look at those pieces, we're guiding to about 50 basis points of adjusted EBITDA leverage ex-float. When you include the impact of the four rate cuts assumed in the guide, you do see adjusted EBITDA margins going backwards a touch because of those four rate cuts embedded in the guide.\nKevin McVeigh: Okay. Thank you.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Jason Celino with Key. Your line is open.\nJason Celino: Thanks for taking my question. Maybe if we kind of go back to Siti's logic and reasoning, so if we think about the current environment, in any normal year, would you say that there's a finite number of customers who would be willing to evaluate switching payroll providers? And then would you find that, that number, that propensity of switch has been reduced in this type of environment? In a better environment, it would kind of increase?\nSteve Beauchamp: Sure. So we have just shy of 40,000 customers. The market for us is over 1 million customers. And yes, so in any given year, there's a fair number of customers that would consider change. Sometimes you can convince a customer to change when they were not considering a change. So I'm not sure that's completely formulaic. And then there are cycles, whether they're economic cycles, we've also seen compliance cycles, where certain laws and rules come in place that create more of a burden for customers. So there can be some cyclical nature to what happens. And then, of course, macro. Maybe I'm less inclined when the macro environment is a little bit tougher. But still, a lot of customers go through change there. So yes, I think that's absolutely the case. I think we've called out over the last 12 months, it has been from a macro perspective, a little bit of a tougher environment, taking people a little bit longer to make decisions. We've called out this quarter and last quarter that top-of-funnel activity has been pretty good. And we obviously had a pretty nice beat this last quarter. So right now, we're feeling like a more normalized environment than maybe it was six months ago.\nJason Celino: Okay. And then you're a little more insulated because you have a June year-end. But do SMBs care about the election in terms of their spending or payroll intentions, not from like a hiring standpoint, but from like a software standpoint?\nSteve Beauchamp: I don't think that's something that we've necessarily observed in the past. It's probably just broader macro than specifically an election.\nJason Celino: Okay, thank you.\nOperator: Thank you. Please standby for our next question. Our next question comes from the line of Zachary Gunn with FT Partners. Your line is open. Check to see if you are on mute. Zachary, your line is open. Check to see if you are on mute. All right, no response from Mr. Gunn.\nSteve Beauchamp: Do we have any other questions?\nOperator: I'm showing no further questions in the queue. I would now like to turn the call back over to management for closing remarks.\nSteve Beauchamp: Well, I wanted to just say thank you very much for all of you with your interest in Paylocity this quarter and over the last 17 years. And my final remarks are, I'm not going anywhere. That's the big message. I'm excited about Paylocity, what we're going to be able to do. I'm excited about Toby and the team that we have, driving the success going forward. So look forward to continued conversations. Have a great day, everybody.\nOperator: Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect."
  }
]