[
  {
    "symbol": "PCTY",
    "period": "Q1",
    "year": 2024,
    "date": "2023-11-02",
    "content": "Operator: Good day and welcome to the Paylocity Holding Corporation First Quarter 2024 Fiscal Year Results Conference Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker, Mr. Ryan Glenn, Chief Financial Officer. The floor is yours.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the first quarter of fiscal '24 which ended on September 30 2023. I'm Ryan Glenn, Chief Financial Officer and joining me on the call today are Steve Beauchamp and Toby Williams Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks including statements made during the question-and-answer session contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information please refer to our filings with the Securities and Exchange Commission for the risk factors contained herein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business and there is a reconciliation schedule detailing these results currently available in our press release which is located on our website at paylocity.com, under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure, because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule Toby will attend the Stifel Conference in Chicago on November 9, Steve will attend the Needham Virtual Conference on November 16, I will attend the D.A. Davidson Tech Summit in New York on November 16 and the UBS Conference in Scottsdale on November 28, Toby will attend the Raymond James Conference in New York on December five and I will attend the Barclays Conference in San Francisco on December seven and the Needham Conference in New York on January 18. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thank you, Ryan and thanks to all of you for joining us on our first quarter fiscal '24 earnings call. Our solid results continued into fiscal '24, with total revenue growth of 25% as a differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. Recurring and other revenue was $291.7 million or 19% growth over Q1 of last year. Our growth continues to be fueled by our ongoing commitment to driving innovation and revolutionizing the way organizations engage with their employees as highlighted by the recent announcement of two new product releases, Rewards & Recognition and Employee Voice. Embedded throughout the Paylocity platform Rewards & Recognition is designed to help clients improve employee retention by automating and customizing both peer and manager feedback across work anniversaries, birthdays and every moment of achievement through personalized recognition and rewards programs. Similarly, Employee Voice combines AI with our proprietary statistically validated engagement model to improve upon our existing survey functionality and help clients aggregate analyze and act on employee feedback at a much larger scale and ultimately a driver of greater employee engagement and talent retention. Following the release of these solutions, our PEPY opportunity now sits at 550 and we remain confident in our ability to achieve our target of 600, as we continue to develop the most modern product suite in the industry. Our innovation continues to be recognized by third parties, as Paylocity was recently named an overall leader in 10 product categories in the G2 Quarterly Bridge Reports for the 20th consecutive quarter across multiple segments. One, the Brandon Hall Group HCM Excellence Award and bank's Top five Vendor across 14 User Experience and Vendor Satisfaction Categories in safe Annual HR System Report. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. In October, we held our annual Elevate Client Conference, where we hosted several thousand business leaders, representing HR, finance, IT and operations across dozens of sessions over the course of two days. At Elevate, attendees had the opportunity to earn shim credits, in addition to partnering with our product and service teams to help influence our future road map through our client as co-creator philosophy. This dynamic was exemplified by the 10 organizations that won our inaugural Elevate award honoring forward-thinking HR teams that are solving business challenges through innovative use of technology. And a big thank you to our employees, clients and partners for helping create the best Elevate conference we've had to-date. While at Elevate, we also have the opportunity to connect with several clients that are leveraging our new solutions, including an engineering firm with over 300 employees that is utilizing market pay to make data-driven decisions around employee compensation and ensure that they remain competitive in the recruitment of new talent, while also maintaining fair compensation for their existing employees. In addition to Rewards & Recognition and Employee Voice, we also announced the launch of our next-generation mobile application, which continues to redefine how our clients' employees are able to interact with key HR functions regardless of whether they are in the office working from home or on the go. Today's workforce is more distributed and reliant on mobile devices than ever before and we continue to see increasing mobile versus desktop usage. This growing demand for modern employee-driven solutions continues to be reflected in solid demand across our target market, and we're pleased with the momentum in our sales team heading into selling season. We're similarly happy with the consistency of our referral channel, which once again delivered more than 25% of our new business in Q1. The strong culture of Paylocity continues to be recognized externally, as we recently were named to Fortune's list of Best Employers for Women. Echoing Steve's comments, I would like to thank all of our more than 6,000 employees for a strong start to fiscal 2024. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2024 guidance.\nRyan Glenn : Thanks Toby. Total revenue for the first quarter was $317.6 million, an increase of 25% with recurring and other revenues up 19% from the same period last year. Our adjusted gross profit was 73.4% for Q1 versus 72.1% in Q1 of last year, representing 130 basis points of leverage, as we continue to focus on scaling our operational costs, while maintaining industry-leading service levels. We continue to make significant investments in research and development and to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 21% when compared to the first quarter of fiscal 2023 and we remain focused on making incremental investments in R&D throughout fiscal 2024 as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regard to our go-to-market activities on a non-GAAP basis sales and marketing expenses were 22.2% of revenue in the first quarter and we remain focused on making incremental investments in this area of the business in fiscal 2024 to drive continued growth. On a non-GAAP basis, G&A costs were 10.3% of revenue in the first quarter versus 12% in the same period last year and we remain focused on consistently leveraging our G&A expenses on an annual basis. Our adjusted EBITDA for the first quarter was $104.9 million, or 33% margin and exceeded the top end of our guidance range by $12.4 million and represented nearly 700 basis points of leverage versus Q1 of fiscal 2023. Briefly covering our GAAP results. For Q1, gross profit was $216.1 million, operating income was $41.2 million, and net income was $34.5 million. In regard to the balance sheet, we ended the quarter with cash and cash equivalents of $305 million and no debt outstanding. In regard to client-held funds and interest income, our average daily balance of client funds was approximately $2.3 billion in Q1. We are estimating the average daily balance will be approximately $2.4 billion to $2.5 billion in Q2, with an average annual yield of approximately 435 basis points. On a full year basis, we are estimating the average daily balance will be approximately $2.5 billion to $2.6 billion with an average yield of approximately 420 basis points. While the demand environment for new business remains solid, year-over-year employees on the platform growth came in below our expectations for Q1 providing a headwind to the quarter and the fiscal year. Finally, I'd like to provide our financial guidance for Q2 and full fiscal 2024. For the second quarter of fiscal 2024, total revenue is expected to be in the range of $322.5 million to $326.5 million, or approximately 19% growth over second quarter fiscal '23 total revenue and adjusted EBITDA is expected to be in the range of $100 million to $103 million. And for fiscal year 2024, total revenue is expected to be in the range of $1.405 billion to $1.410 billion, or approximately 20% growth over fiscal 2023 and adjusted EBITDA is expected to be in the range of $474 million to $478 million, which represents approximately 200 basis points of leverage over fiscal 2023. In conclusion, we are pleased with our Q1 results and the momentum we have across our sales and operations teams as we enter our busiest time of the year. Operator, we are now ready for questions.\nOperator: [Operator Instructions] Our first question will come from the line of Scott Berg with Needham & Co. Your line is open.\nScott Berg: Hi, everyone. Thanks for taking my questions. I guess first question is the follow up on Ryan's comments around seats count here for preexisting customers and expectations there. How much below your expectations both in the quarter and your forecasting guidance for the year? Are you expecting seat count to be I guess relative to that initial expectation?\nRyan Glenn: Hey, Scott. It's Ryan. So I think what we saw in the quarter was a little bit of softness in August and September which as we had talked about we did not assume a decline there in Q1. So a little bit light versus expectations. That obviously weighed a bit on the recurring revenue in Q1. And I think we factored that in as we looked at maintaining guidance for the full fiscal year. So probably didn't put a full dollar amount on it, but certainly a headwind in the quarter and we did factor that in as I said over the balance of the fiscal year.\nScott Berg: Knowing that you have a pretty large customer base, are you able to target any one thing in particular or vertical or kind of customer segment that might be driving some of the weakness there? Because I think the overall employment numbers are reasonably healthy, but there certainly are pockets of weakness out there?\nRyan Glenn: Yeah. Nothing that I'd highlight from a vertical or geographic perspective. I think the workforce levels are up a touch year-over-year. So similar to what you had seen some of the other players call out as far as year-over-year, but sequentially still down a little bit.\nScott Berg: Got it. Helpful. And then from a follow-up question perspective is, how should we think about your cross-sell cadence for the year? I know you all have had a pretty strong emphasis last couple of years. But cadence in the quarter kind of similar to what you've seen in the last couple of years? Or is there any notable change on how your existing customers are buying new modules? Thank you.\nSteve Beauchamp: Yeah. I would say no noticeable change at all. We have accelerated investments over the last several years and the inside sales team that is selling client - or products back to existing customers. At the same time, you can see we've accelerated our road map and we've added a lot of new product SKUs as well. And so those are being received really well within the customer base and we were pleased with the performance of that team in Q1.\nOperator: Thank you. One moment for our next question. That will come from the line of Brian Peterson with Raymond James. Your line is open.\nBrian Peterson: Thanks for taking the question. So I just maybe wanted to focus on the linearity and thinking about the recurring revenue guidance for the second quarter, because it seems like the full year implies an acceleration into the back half of the year. Is there anything in terms of enterprise mix or implementation or backlog that kind of drives that? I know we're seeing some moving parts in employment. But just kind of want to understand how you guys are thinking about linearity over the course of the year?\nRyan Glenn: Yes, Brian. I think as we called out on the August earnings call, we did say that the first half of the year probably had incrementally harder comps when you look at the recurring revenue growth that we saw in the first two quarters of last fiscal year and the normalization of workforce levels in the back half of this year and obviously some softness in the first quarter. So I think we took all that into account. Not anything else I'd call out relative to macro or the sales environment, but Steve anything you want to add there?\nSteve Beauchamp: No. I think from our perspective execution was pretty much down the middle in terms of what we expected with the exception of seeing a little bit of the softness as Ryan described kind of sequentially month-over-month with a couple of the months in the quarter. But from a demand environment and activity levels, we feel pretty good about where we're positioned. This is obviously a really important time of the year for us, because you get a lot of starts in January. It's really the biggest time of the year. This is just the first quarter obviously. And so there's a lot of execution in front of us but we feel good with the start we got off to.\nBrian Peterson: Great. And maybe just as a follow-up. Obviously, this has been a big focus on the space this week. But just understanding kind of the revenue mix in any revenue streams that may not be tied to sort of a PPEY dynamic that are more transactional or onetime in nature. I don't think you guys have broken that out previously but any your help on kind of sizing that impact? I know, it's come up a lot this week. Thanks, guys.\nSteve Beauchamp: Yeah. I know. I understand the context of the question. So I think if you go back many years ago, the industry was highly payroll-centric and it was very transactionally fee-based and that ends up being billed on a per payroll basis. That was very common. As we move to modernize our suite in many, many years ago we made the transition to really be cloud-first provider and charge on a PEPM basis and so regardless of how many payrolls a customer runs they pay us the same amount on a per employee per month basis. And so we don't necessarily see any revenue variance from that model. That is something that was pretty common in some of the providers that have been around for a longer period of time. But I think from a customer experience perspective, it's much better to know exactly what your bill is going to be. It's based off a per employee per month. And the other thing, I would note is less than half of our revenue is payroll-based today. And so it's a bundled billing situation for our customers. So, no impact.\nOperator: Thank you. One moment for our next question. And that will come from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Great. So a couple of things on the employees on the platform comment. Any sense on where that was in October?\nSteve Beauchamp: I would just say, we would provide you more color at the end of the quarter what that looks like but we obviously have factored that into the guidance on a go-forward basis. So we were able to look at the first quarter and kind of have an early look at October and factor that into the guidance but we'll give you better color when we have the quarter behind us.\nBrad Reback: Okay. And Steve on that latter point there, can you give us any directional sense on the guide if you just assumed sort of the trends you're seeing right now if you've seen things get worse? Any way to size that up just so as we see the economy we can understand how it impacts you?\nSteve Beauchamp: Yeah. So I mean, I think, we were able to obviously maintain our guidance for the year. We had a beat in the quarter. So I think just from a sizing perspective, this was not the biggest needle mover just in terms of the impact of employees on the platform. We've got essentially, a full look at the first three months and we get an early look at the fourth month and we've kind of factored that into the year, and we'll still be able to maintain our guidance for the year, and we feel pretty good about it. Knowing that, this is the first quarter of the year and in our business, there's a lot of sales that happen in the next quarter that gets started in January. So there's just -- I think traditionally if you look at the way we think about first quarter is we've got a lot of execution. We sell and implement a lot of businesses within that same quarter. And so I think it's a combination of seeing just a small amount of softness in employees on the platform and just the normal approach we take on a first quarter of fiscal year.\nBrad Reback: Perfect. Thanks very much.\nOperator: Thank you. One moment for our next question. And that will come from the line of Bryan Bergin with TD Cowen. Your line is open.\nJared Levine : It's actually Jared Levine on for Bryan tonight. In terms of the sales headcount, can you provide an update on your sales headcount growth intentions for FY '24? And then can you remind us when you typically do most of that sales headcount hiring during the fiscal year?\nToby Williams: Hey, Jared, it's Toby. Yes, I mean I think as we've said before we came into the year fully staffed sales headcount up 18%. And most of the hiring of that headcount comes in during that. We hire all throughout the year but I think you see hiring season for the sales team really in that spring timeframe. And I think as we've said, before we're really happy with the level of talent across the sales team really happy with the class that came in coming into this fiscal year. And as Steve said, I mean, we're right in the selling season. And so I think we came through Q1 really happy with the performance of the team and happy with where we sit from a staffing perspective as we came through Q1 this year and on into selling season.\nJared Levine: Great. And then in terms of the enterprise segment let's call that 1000-plus employees how are your win rates there the past 12 months? How do those compare to prior years? And can you update us in terms of like the mix of clients that fall in that enterprise segment?\nSteve Beauchamp: Yeah. So we have over the last several years focused some of our most experienced reps on some of these larger market opportunities. They were just happening more naturally in the market. We kind of always -- we're focused on those when they became available but we definitely have seen increased traction up market. I think we've called that out probably over the last two years. I wouldn't have anything from a win rate perspective to tell you. They definitely have been pretty strong for us. If I were to look at first quarter which is kind of interesting I would call it broker referrals and really our core team as being the strength of the sales force in first quarter, which is from our perspective the largest part of the market and where we focus the most. So that was a definite positive.\nOperator: Thank you. One moment for our next question. That will come from the line of Mark Marcon with Baird. Your line is open.\nMark Marcon: Hi. Good afternoon and thanks for taking my question. With regards to the sales pipeline Steve or Toby, can you describe how that sales pipeline looks right now compared to a year ago? And also can you describe what you ended up seeing during the first quarter in terms of sales conversions? Are clients acting in any way in a more hesitant manner? Or is the cadence relatively similar to a year ago in terms of being able to close sales?\nSteve Beauchamp: Yes. So I think the sales pipeline is building nicely as we are really in the throes of kind of selling season. Lots of execution in front of us. I would say nothing major, Mark. I mean maybe at the margins you might hear from spots in the sales force where it's taken a little bit longer for people to make decisions. But I wouldn't say that's uniform. I would say that we're hearing that a little bit at the margin. And that would be really the only call out.\nMark Marcon: Any change at all in terms of like who you're going up against? Or are there any new competitors that are out there? Any private players that are competing for the same clients? Anything that you're seeing that's different?\nSteve Beauchamp: I think from a competitive front, it's absolutely the same in usual suspects. It's always been a very competitive environment. That definitely has not changed. There's only a handful of private companies of any size or scale. That really hasn't changed in terms of whether we're seeing them any more or less. So we really feel good about the competitive position we're in especially with the product investments that we've made and all of the new products that we've been able to release and so that becomes a big point of differentiation just like it did last year.\nMark Marcon: Great. Thank you.\nOperator: Thank you. One moment for our next question. That will come from the line of Raimo Lenschow with Barclays. Your line is open.\nSheldon McMeans: Hey. Great. This is Sheldon McMeans on for Raimo. Thanks for taking our question. I wanted to ask about interest coming out of Elevate. You talked about several thousand clients at the event. How did that look year-over-year and the pipeline exiting that? And does that pipeline provide a level of comfort around the reiterated full year guidance? Thank you.\nRyan Glenn: Yes, sure. So I mean great call-out for Elevate. I think as I said in the prepared remarks it was our best Elevate to-date. We had thousands of attendees there. And I think we felt really good about the level of attendance and the level of client engagement both from an existing client perspective and then the level of focus on our product and our product differentiation that that gives us the opportunity to talk about with our client base. So I think overall we feel really good about the event. And I think as Steve has said feel pretty good about the momentum that we have coming out of Q1 part of that is certainly around Elevate and part of that I think is just how we're executing from an overall go-to-market perspective. So I think overall feel very solid coming out of it.\nSheldon McMeans: Excellent. And a quick follow-up if I may. It looks like you picked up a little bit of yield still quarter-over-quarter. And as you may be thinking about extending duration as rates are staying higher for longer do you -- and with the reiterated guidance between 4.5% to 4.6%, do you expect that to continue until rates go down around those levels?\nRyan Glenn: Yes. I mean, I think, we gave a fair amount of details in prepared remarks relative to average daily balance and yield. And I think we guided in a fairly tight range from a yield perspective between call it 420 basis points and 440 basis points of yield for the year. So I think we'll be in that range. We're certainly looking at the yield curve. We're looking at duration of the portion of client health funds that we do have invested. And I think as we go deeper into the year we'll update guidance accordingly if we see changes there.\nOperator: Thank you. One moment for our next question. And that will come from the line of Jason Celino with KeyBanc Capital Markets. Your line is open. \nJason Celino: Great. Thanks for taking my question. It's nice to see the PEPY go up to 550 with the two new modules. If I've got this correct. This is kind of the second quarter in a row where we've seen that current PEPY increase. I guess what's giving you this ability to accelerate the new offerings here? And how should we think about trajectory going forward?\nSteve Beauchamp: Sure. I think if you go back a couple of years ago, you can see that we've made some incremental investments in R&D. We obviously had a little bit of tailwind in terms of interest revenue increases. So, we made some platform investments. We added a whole bunch of folks. We kicked off some new projects. And I think you're seeing the fruits of that labor come to market with four new recent product SKUs. I would tell you we feel really good about the pipeline from a product perspective. You probably have heard me say many times that we have lots of ideas that we have that we think can really help our customers and we get a lot of those ideas as customers a co-creator. And so the pipeline from a product perspective is pretty strong. And I think on the flip side, you see that we're able to do that while at the same time kind of normalizing kind of those R&D investments in the quarter and that's probably the right way to think about it is just a bit of a period of extra investment and you're seeing the benefit from it. But I feel like the investment level that we're at in terms of size and scale now really allows us to really balance investing in the client experience and making sure we're reacting to their feedback still funding all sorts of new products and making platform investments so that we can stay being the most modern platform in the industry.\nJason Celino: Great. Excellent. And then really nice EBITDA beat. Any change in guidance philosophy? Is it fair to think you might be focusing more on margin expansion this year versus prior years? Thanks.\nRyan Glenn: Yes. I think that really happy with the performance in the quarter and the ability to raise the year as much as we did. I think we're guiding to an adjusted EBITDA range of about 34% -- call it 34% or so. So, just about 100 basis points short of our updated target. So, I feel really good about that progress. Nothing that I would call out as far as one-time or additional areas of focus. I think it's really a function as the business gets larger that we're able to continue to drive scale, while at the same time investing to drive growth in the future.\nOperator: Thank you. And that will come from the line of Alex Zukin with Wolfe Research. Your line is open.\nAlex Zukin: Hey guys. Thanks for taking the question. I guess maybe can you just talk about from those workforce levels were there any particular verticals that you saw either seeing anecdotally weaker workforce levels or that anecdotal commentary around taking longer around sales cycles or go lives. Anything there would be helpful.\nSteve Beauchamp: Yes, I would say again I want to just make sure that we talk about that as being kind of a small change in the workforce levels being a little bit less than we expected. So, just from an order of magnitude, this is not a huge impact. We definitely looked at other factors in terms of trying to figure out was this a pocket from a geography perspective or a vertical market. The reality was it's pretty much just across the board. As Ryan mentioned, if you look at it on a year-over-year basis it was up we expected it to be up. It just was not up the same amount. And then on a month-over-month basis, it was actually down two of the three months in the quarter. And so still a relatively small impact but something that we've kind of factored into the guidance. By no means that we think there is a whole bunch of client behavior that would be a sign of a very different environment than we're in but we definitely had that blip in the quarter.\nAlex Zukin: That's actually super helpful. And I guess to the extent I know that this question has been asked, but as we think about it from a guidance particularly for the full year and even maybe just commenting on long-term targets that you guys gave at the Analyst Day, still feel -- do you still feel really good about those targets? And in terms of the full year moderating of employment levels. Is it just fair to assume that you've taken that -- the slight difference into account? Or have you been a little bit more conservative in the employment levels for the full year?\nSteve Beauchamp: Yes. No, I mean we have not forecasted some different employment environment or some recession into what we've guided. We took what we saw in first quarter. We took the early look into October. We factored that into the balance of the year. That was certainly one of the biggest drivers in terms of just maintaining our guidance for the year versus taking that up. It's kind of all factored in. We feel good about the fact -- the execution in the business. And we're still focused on obviously those long-term objectives and we've got a rich product pipeline and a lot of momentum.\nOperator: Thank you. And that will come from the line of Daniel Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Great. Thanks for taking my question. Maybe to kind of continue on the same. Philosophically, if you do see the economy start to weaken as we go into calendar 2024, what steps are you going to do to alter your business strategy if any?\nSteve Beauchamp: Well, I think we've gone through many cycles in our history in the past. These things don't typically fall off a cliff quickly. It is a very gradual impact in a recurring revenue model. So it does give us the ability to kind of make adjustments in terms of what we're seeing in front of us. So that's the first thing that I would say. And we do have a fair amount of variable cost that really is assigned to the volume. And so it's relatively easy for us to adjust in any kind of down market if that's what we're seeing. We've actually had a lot of success selling in down markets in our past history as well. And so part of the value proposition that we're offering customers is efficiency that they gain from using a more modern platform. That value proposition does become pretty important in a tight market. And so you definitely lean into that. And I think even if you went back into COVID and the fact that we were able to sell through that which was certainly the biggest drop you've ever seen economically. So yes, I wouldn't say it doesn't affect us but I think our industry and I think the investments we've made in our product make us fairly resilient to that type of market fluctuation.\nDaniel Jester: Great. And then I don't think you've touched on this yet but in terms of new buyer behavior, are you seeing any change in the demand levels in terms of taking new modules at start relative to the past call it 12 months or so? Thank you.\nSteve Beauchamp: I would tell you that average revenue per customer increases. It has been a core part of our growth equation for a long time. And we have obviously added significantly to the product. It was $200 at the time of IPO back in 2014. So we continue with that momentum. I already called out earlier in the call that we've had great ability to sell back into the client base. The attach rates for the new products used we've been happy with and we've got a pretty rich product pipeline. And so that is and continues to be a big part of the equation and we see these new customers continuing to adopt more product.\nOperator: Thank you. One moment for our next question. And that will come from the line of Adam Bergere with Bank of America. Your line is open.\nAdam Bergere: Hey. Thanks for taking my question. So a quick one on R&D. What are some product areas or functionality you're still looking to round out to get to that $600 PPEY target?\nSteve Beauchamp: Yes. I think for competitive reasons I never like to announce a product until we're very close to launching that and bringing that to market. What I would tell you is I think we continue to have opportunities to extend the valuable data that we have about an employee's person record to be able to automate a number of internal processes for our customers. Some of those really fit right into kind of a core HR organization. Some of those start to extend outside of that where that data can become valuable. We also have opportunity to be able to add deeper capabilities and functionality, very much like Scheduling Plus which was one of our new product SKUs that allow our customers to take advantage of richer functionality and it allows us to be able to get a little bit more pricing out of that equation. And so I think it's really kind of a combination of innovating in places where we don't see our competitors go on top of actually just making our functionality deeper and better. And then lastly, sometimes it's reacting to customer feedback. I think Rewards & Recognition is a great example of client feedback driving us to launch a SKU that maybe we wouldn't imagine three or four years ago. And so it's all three of those things that drive the innovation.\nAdam Bergere: Thank you. That's very helpful. And then just a follow-up. Can you remind us what the ramp time is for the new sales headcount you've brought in this past Q1? Thank you.\nRyan Glenn: Yes. I mean I would say that I don't think we have seen any significant change in terms of the ramp time of the sales team that we would have hired in that spring timeframe, which again is sort of the main part of the hiring season, although we continue to hire reps throughout the course of the year, every single year. And I think, as I mentioned a few minutes ago, I mean I think we are – came into the new fiscal year with sales headcount up 18%. That's the same level of increase generally, we've had the last few years. And I think we feel really good about the level of talent we've been able to attract. And as Steve said a minute ago, I think we're in the heart of selling season. And I think we feel pretty good about how the momentum that we had in the course of Q1 and feel really good about where we sit from a staffing perspective and from a talent level perspective as we sit here in the heart of selling season.\nOperator: Thank you. One moment for our next question. And that will come from the line of Robert Simmons with D.A. Davidson. Your line is open.\nRobert Simmons: Hey, thanks for taking the question. So your guidance has you below the 20% growth target you've put out there. When do you think you can return to that level? And what is going to be the most likely catalyst to get there?\nSteve Beauchamp: Well, our goal is obviously to continue to focus on that 20% target from a long-term perspective. And there's been certainly a lot of noise post-COVID in some of these numbers. And in some ways even some of the comparables on the first half of the year that we've got. But we feel focused on getting there. I think if you look at the guidance overall for the year we're right at the number implied a little bit lower but not a lot lower on the last couple of quarters. I think the other thing I would say is that's guidance, right, not always actuals as well. And so if you kind of factor all that in place we feel like we're – from a guidance perspective we're pretty darn close to the target already and we're going to stay focused on that number.\nRobert Simmons: Got it. And then can you talk about the customer reaction and feedback have you had so far from the announcements you had at Elevate?\nToby Williams: Yes. I mean I think overall, we – as Steve said a few minutes ago, really good reaction at Elevate overall. But I think as it relates to some of the product announcements we've had, we've had a strong couple of quarters of new product introduction with things most recently like Rewards & Recognition and Employee Voice that Steve was talking about. And I think the overall reaction so far obviously, early days in terms of the launch of those products but the reaction so far has been great really strong. And I think those – to Steve's point a minute ago, I mean those continue to be products that we have collaborated with clients on we've gotten feedback from them and we've now delivered products that I think they are indicating of value to them. And so while it's early days I mean I think the reaction has been really strong so far.\nRobert Simmons: Thanks.\nOperator: Thank you. One moment for our next question. And that will come from the line of Terry Tillman with Truist. Your line is open.\nTerry Tillman: Yes, thanks for fitting me in as well. Maybe my first question and I did have a follow-up, either fortunately or unfortunately for you all. The first question is as we talk about growth algorithm – and Steve, I think you said it really well. I mean you've got the team on the field, you got to execute now and close business the rest of the year. So I totally get that. But what I'm curious is with what you know right now, how do you think the mix of growth in new revenue coming on would look between new units and average revenue per customer this year versus last year? Do you see any discernible potential changes in those mixes? And then I had a follow-up.\nSteve Beauchamp: Sure. Okay. So I think – I think you know this Terry but we quote our salespeople on new recurring revenue, not necessarily based off a specific number of units. I think over the last couple of years as we've had success upmarket and success with driving more product you've seen average revenue per customer play a bigger role. And the units obviously were a slightly smaller component of that. It just -- I think my reaction to that is we want to get to the number and we want the sales force to be able to go with what the customers need. And sometimes that means they're selling more customers and sometimes they're selling more product. But I think it's too early to be totally honest with you this year to be able to tell you whether we're going to see a specific mix shift.\nTerrell Tillman: Yeah.\nSteve Beauchamp: We do have a fair amount of product coming out this year. And we've leaned in a little bit more into selling back to the client base. So if I were to tell you a lean that would probably be the slight lean based off of that initiative but we're going to let the year play out.\nTerrell Tillman: Understood. Totally. And maybe just a follow-up question and maybe this is easier said than done but you all have done a lot in terms of these add-on products that drive that PEPY. But have there been learnings when you bring these newer products out that somehow you can just get the quicker kind of attach rates of that like 20% plus target et cetera with the newer products just because from learnings from the prior add-on products? Or is it not that simple to be able to have all that kind of testing and learning?\nSteve Beauchamp: Yeah. So I mean these are obviously -- you're talking products that can be maybe $1 PEPM up to several dollars PEPM. And so as you look to add those you first typically see a fair amount of movement with new customers coming on board. So you launch it to the sales force. The two new products we just talked about are available for January starts. So we're already tracking sign-ups for those two products, as we speak. And so that ends up being what I would say is a fairly normal ramp-up rate that has been pretty consistent with various products overtime. So I don't see a big opportunity to move that. We have gotten better over the years though as we sell back to the client base. And that team has scaled and the performance of that team has been really strong. And so I think there's still opportunity for us to continue to improve and drive utilization whether that's things like free trials and better description of the product and just having more headcount talking to our customers. And frankly designing products that customers actually want, so when you put all that together I think the sales back to the client base continues to be an opportunity that we will gradually improve overtime.\nTerrell Tillman: Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Pat Walravens with JMP Securities. Your line is open.\nSteve Beauchamp: Hey Pat. Are you there?\nPat Walravens: Sorry about that, I was on mute. Steve, you've always said the market is big enough for all the cloud vendors to keep shrinking along at the expense of the legacy players. But at some point that would come to an end and you start taking share from each other. Where are we in that process? How far away are we from that?\nSteve Beauchamp: Yeah. It's a good question Pat. I mean, I think there's still one million targeted business in our target market. We've obviously expanded that target market a little bit on the low end and on the upper end. So that has grown since our IPO in 2014. It still feels like a big market opportunity. I look at the activity levels of the sales force and how many people are they meeting every single week and those remain fairly consistent which tells me that there's a lot of opportunity still out there. And I think on top of that we've had really great success of adding product and a history of innovation so that that average revenue per customer part of the equation is something that we can have confidence in. So I still think there's a ton of opportunity for us to be able to grow this business. We'll be a little -- about $1.4 billion forecasted this year. We're very much focused on what does it take to get to $2 billion and then continue to grow beyond that. So still feels like a large opportunity.\nPat Walravens: Thank you.\nOperator: Thank you. I'm showing no further questions in the queue at this time. I would like to turn the call back over to management for any closing remarks.\nSteve Beauchamp: Well as usual I just want to thank all of you for your interest in Paylocity and echo, Toby's sentiments from the prepared remarks. Thanks to all of our employees for all the effort to a good start to our fiscal year. Have a good day.\nOperator: This concludes today's program. Thank you all for participating. You may now disconnect."
  }
]