[
  {
    "symbol": "PCTY",
    "period": "Q3",
    "year": 2024,
    "date": "2024-05-02",
    "content": "Operator: Good day, and thank you for standing by. Welcome to the Paylocity Holding Corporation Third Quarter 2024 Fiscal Year Results Conference Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ryan Glenn. Please go ahead.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the third quarter of fiscal 2024, which ended on March 31, 2024. I'm Ryan Glenn, Chief Financial Officer, and joining me on the call today are Steve Beauchamp, and Toby Williams, Co-CEOs of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained in other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there's a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure because the information, which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, Toby will be attending the Cowen Annual Technology Media and Telecom Conference in New York on May 29. I will be attending the Jefferies Software Conference in Newport on May 30. Toby will be attending the Baird Global Consumer Technology & Services Conference in New York on June 6. Steve will be attending the William Blair Growth Conference in Chicago also on June 6, and I will be attending the BMO Virtual Software Conference on June 11. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thanks, Ryan, and thanks to all of you for joining us on our third quarter fiscal 2024 earnings call. Q3 represented another quarter of solid results with total revenue growth of 18.1%, driven by our differentiated value proposition of providing the most modern software in the industry, continuing to resonate in the market, particularly among the next generation of workers. With Gen Z set to overtake baby boomers as the dominant generation in the workforce this year, we have continued to invest in meeting the needs and expectations of the modern workforce to deliver the most integrated and intuitive experience in the industry. Most recently, we released a number of new enhancements to our talent acquisition suite to help our clients recruit, train and retain members of the next-generation workforce. In particular, our new text to scan and two-way texting features will better enable recruiters to directly communicate with candidates and receive key metrics on engagements, visits, application rates and higher data in real time. Additionally, new AI-driven smart groups within community will help new hires automatically integrate into their teams, promoting collaboration and integration. All of these new features are accessible directly via our top-rated mobile app, which enables employees to stay connected, access essential information and contribute effectively from anywhere. Our commitment to product development also continues to be recognized in the market with Paylocity recently placing as an overall leader in 10 product categories in the G2 Spring 2024 Grid reports. Additionally, Paylocity ranked number two overall on TrustRadius' 2024 Most Loved List. And once again, listed as top 10 HR Solution in G2's 2024 Best Software Awards. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. Solid sales and operational execution in Q3 helped drive our total revenue to $401.3 million or 18.1% growth over Q3 of last year, beating the high-end of our guidance by $2.3 million. We remain confident in our sales team and go-to-market motion as well as our strong competitive position in the market, and we continue to be pleased with our top of funnel activity and how – are resonating in the market. While we continue to see elongated sales cycles at the high-end of our market during the quarter, we remain focused on driving sales rep and go-to-market productivity in Q4 and into fiscal 2025. We also saw another strong quarter of channel performance as channel referrals, primarily from benefit brokers and financial advisers, once again represented more than 25% of new business for the third quarter as we continue to leverage the strong source of referrals. Our topline performance, coupled with continued operational efficiency helped drive adjusted EBITDA of $167.9 million or 41.8% margin, which exceeded the high-end of our guidance by $11.4 million. Lastly, Q3 represents our busiest time of year as we work to support our clients through other year-end processing and annual tax form filings. I'd like to say a huge thank you to our more than 6,000 employees who live and represent our values every day and who work so hard to support our clients. The strong culture at Paylocity continues to be recognized externally as we were recently named one of Forbes best large employers for America in 2024. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2024 guidance.\nRyan Glenn: Thanks, Toby. Total revenue for Q3 was $401.3 million, an increase of 18.1% with recurring other revenues up 16.8% from the same period last year, and we were pleased to come in $2.3 million above the high-end of our Q3 revenue guidance. Our adjusted gross profit was 75.9% for Q3 as we continue to drive focus on scaling our operational costs on an annual basis while maintaining industry-leading service levels. We continue to make significant investments in research and development and to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 13.4% when compared to the third quarter of fiscal 2023 and we remain focused on making incremental investments in R&D as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities. On a non-GAAP basis, sales and marketing expenses were 19.2% of revenue in Q3, and we also remain focused on making incremental investments in this area of the business to drive growth going forward. On a non-GAAP basis, G&A costs were 8.5% of revenue in the third quarter versus 10.4% in the same period last year, representing 190 basis points of leverage in Q3. Our adjusted EBITDA was $167.9 million or 41.8% of revenue for the quarter, which exceeded our guidance by $12.9 million at the midpoint and represented 340 basis points of leverage versus Q3 of fiscal 2023. Briefly covering our GAAP results. For Q3, gross profit was $285.3 million. Operating income was $106.3 million and net income was $85.3 million. In regard to the balance sheet, we ended the quarter with cash, cash equivalents and invested corporate cash of $492.7 million and no debt outstanding. We continue to be pleased by our ability to drive increased profitability through leverage and adjusted gross margin, adjusted EBITDA and free cash flow while also maintaining strong revenue growth. Our increased adjusted EBITDA guidance for fiscal 2024 represents 35.2% margin, implying 330 basis points of margin expansion over fiscal 2023 or 190 basis points of margin expansion when excluding interest income and client-held funds. As we look forward and acknowledging the uncertain interest rate environment, we also remain confident in our ability to drive continued margin expansion when excluding interest income on client-held funds in fiscal 2025 and beyond. As a result of our strong profitability and cash flows, the confidence we have in our business and our focus on driving shareholder value, our Board of Directors has authorized a $500 million share repurchase program. In addition to managing dilution through our newly authorized $500 million share repurchase program, we are also increasingly focused on driving leverage and stock-based compensation expense on an annual basis with a target stock-based comp level of less than 10% of revenue, which we expect to achieve in the coming years. In regard to client-held funds and interest income, our average daily balance of client funds was $3 billion in Q3, and we are estimating the average daily balance will be approximately $2.8 billion in Q4 with an average annual yield of approximately 450 basis points to 455 basis points. Please note that our fiscal 2024 guidance does not include the impact of any future interest rate changes. In regard to client workforce levels, year-over-year employees in the platform growth was in line with our expectations in Q3. And given continued macro uncertainty, we are taking a measured approach to Q4 expectations. With that said, I'd like to provide our financial guidance for Q4 and full fiscal 2024. For the fourth quarter of fiscal 2024, total revenue is expected to be in the range of $347.8 million to $351.8 million or approximately 13% growth over fourth quarter fiscal 2023 total revenue. And adjusted EBITDA is expected to be in the range of $104.1 million to $107.1 million. And for fiscal 2024, total revenue is expected to be in the range of $1.393 billion to $1.397 billion or approximately 19% growth over fiscal 2023. And adjusted EBITDA is expected to be in the range of $489.5 million to $492.5 million, implying an adjusted EBITDA margin of approximately 35.2% and representing leverage of 330 basis points versus last fiscal year. Based on the interest income assumptions provided earlier in my prepared remarks and our total revenue guidance, our implied recurring revenue growth for Q4 is approximately 13%. Our focus remains on driving strong revenue growth, increasing productivity and profitability levels on an annual basis and continuing to drive shareholder value. Against an uncertain macroeconomic environment and with guidance of nearly $1.4 billion of revenue this fiscal year, our focus is aligning all aspects of our organization towards achieving $2 billion of revenue as the next key milestone of our evolution as the most modern HCM provider in the industry. In addition to aligning our focus on achieving $2 billion of revenue, we are reconfirming our other current financial targets as followed. Our adjusted gross margin target of 75% to 80%, our total research and development target of 10% to 15% of revenue, our sales and marketing target of 20% to 25% of revenue, our general and administrative target of 5% to 10% of revenue, our adjusted EBITDA margin target of 35% to 40% of revenue, our free cash flow margin target of 20% to 25% and our newly added stock-based comp target of less than 10% of revenue. Operator, we are now ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question is going to come from the line of Scott Berg with Needham & Company. Your line is open. Please go ahead.\nScott Berg: Hi, everyone. Nice quarter here. I guess, probably two brief questions here. But Steve or Toby, I wanted to start off with commentary on the – just the overall demand environment for net new sales, not necessarily the cross-sell opportunity. But what do you kind of see in the quarter relative to your expectations? And how do you compare Q1 versus maybe a year ago? Thank you.\nToby Williams: Hey, Scott, it's Toby. I mean I think overall, I would say that expectations were met in terms of the demand environment in the quarter. I mean, I think overall, I mean, our value prop and strategy, I think, continues to resonate. I think we were overall pleased with what we saw from a channel contribution perspective, still maintaining north of 25% of new business. I think the top of funnel activity, I think, was in line with what we thought it would be. And I think overall, continuing to attract and retain strong talent from a go-to-market perspective. So I think, overall, probably in line with what we had seen last quarter and what we expected to see in this quarter.\nScott Berg: Excellent. Helpful. And then given kind of the state of the environment where your growth rate is, how should we think about your hiring and ramp of maybe new sales reps as we get through the balance of the calendar year? Are you still looking to hire or expand your sales force on a roughly 20% year-over-year basis? Or if you maybe tweaked what those [indiscernible]? Thank you.\nSteve Beauchamp: Hi, Scott, it's Steve. No, I think building on our comments from last quarter, we definitely think there's an opportunity for us to really drive on productivity. We talked about some of our new financial targets. We've had a really good year from an adjusted EBITDA expansion and making sure that we're really balancing a focus on growth is the number one priority, but really a close second is driving profitability targets. And we think as we go into the next year, we have an opportunity to not hire quite at that same rate. We'll give you the exact percentage as we go into the next earnings call, but to really focus on productivity improvements in the sales force, which we're happy with the initial that are in place.\nScott Berg: Great. That's all I have. Thank you for taking my questions.\nOperator: Thank you. [Operator Instructions] And our next question comes from the line of Brian Peterson with Raymond James. Your line is open. Please go ahead.\nBrian Peterson: Hey, congrats on the quarter and thanks for taking the question. So Steve, I know you've been asked this in the past, but does now potentially feel like the right time to focus a little bit more on the back-to-base motion. Any thoughts on that sales effort?\nSteve Beauchamp: Yes. We do get that question fairly often. And I think we have made improvements in our ability to go back to the base. That has grown faster than we've grown kind of the new ARR revenue consistently for the last several years. And I think that opportunity is still ahead of us, and we'll continue to do that. I don't see that being an order of magnitude change. We've expanded that every year. That's worked pretty well for us. That team has done really well this year. They continue to do well, and we expect to be able to grow them above kind of our growth rate of our outside field organization, but I wouldn't call it any type of giant step function. It's about gradually adding product, making sure that product is adopted by our clients and then making sure that we've got a nice cadence and rhythm where we're pushing the products back to the clients who need it, but not necessarily going overboard with it because it becomes really scalable for us over time to be able to continually gradually increase it.\nBrian Peterson: Got it. And maybe just on the share repurchase authorization, the $500 million. I'm just curious why now? Any update to the potential M&A strategy that you guys might be looking at? Thanks, guys.\nToby Williams: Yes. I don't think there's any real update from an M&A strategy perspective. I think we've been fairly consistent with that over time. We've been focused on product-oriented or technology-oriented deals that we've done that have mostly been on the smaller side. I think in terms of the timing, I mean, we ended the quarter with almost $500 million in cash on balance sheet, and you can see the strong progress we made from a free cash flow perspective. And obviously, we also have a ton of revolver capacity. So I think we felt like this was a reasonable time to put a repurchase program in place. And I think when you look at the trading multiples and where those are right now sort of at or around multiyear lows, while the business continues to perform really well. I think it's a decent time to continue using that lever to drive shareholder value and doing the buyback. And I think you also get some offset from a stock composition perspective, which we're also obviously focused on with the inclusion of SBC as a target. So I think those are probably all the things that went into the mix.\nBrian Peterson: Make sense. Thanks, Toby.\nOperator: Thank you. [Operator Instructions] And our next question is going to come from the line of Samad Samana with Jefferies. Your line is open. Please go ahead.\nSamad Samana: Hi, good evening. Thanks for taking my questions. I wanted to maybe ask one and just getting clarity on the long-term outlook. I just wanted to understand on the 20% long-term growth target. Is that just for looking in the near-term? Or should we still think about 20% over a longer period? Is it still comparable? Is it against the $2 billion target previously? I just wanted to make sure we had clarity on that.\nSteve Beauchamp: Yes. I think if you look at where our growth rate is this past quarter and then what we're guiding to in fourth quarter, it is definitely below the 20%. And so we've been below that target for a little while. I think where we think the business is we are still growth as the number one priority. 20% is probably not the right target in terms of where we sit today. We'll focus on growth as that number one priority. And at the same time, we've introduced SBC and really focused on the profitability target. So you see a little bit more of a balance than maybe where we were three or four years ago. And so setting a $2 billion milestone for the company, certainly is where we're going to stop, but seems to be a better way to focus on growth versus that 20% target that probably isn't really the right fit for us in terms of what we've seen recently and how we think the business will evolve over time.\nSamad Samana: Okay. Great. And then maybe just one more question. As I think about where you guys are in size and scale, I'm curious if you've started to see in the pipeline or in deals that you're winning, where it's more replacements of potentially other cloud solutions? Or is it still that mix that we've seen historically where it's replacing maybe some of your larger incumbents that were there or if you're seeing more of maybe your cloud competitors [seed share] to Paylocity as well?\nSteve Beauchamp: Yes. I think that's a question that we've gotten before, and it's really just a function of our growth, plus the other cloud competitors growth. We still have a relatively low share of the market. Everybody does payroll in some way, shape or form, and they buy some subset of the HR module. So all of our sales are replacement for an existing method. Sometimes that software, sometimes that is the big players, the legacy players that have been around a long time. And then as we grow and the cloud players grow, we do start to run into each other a little more. The take rate to and from still isn't a very large percentage, it's still relatively low. We probably see each other more competitively in deals than anything else.\nSamad Samana: Okay. Great. Thank you so much for taking my questions.\nOperator: Thank you. [Operator Instructions] And our next question comes from the line of Andre Childress with Baird. Your line is open. Please go ahead.\nMark Marcon: Hey. This is Mark Marcon, not Andre. Good afternoon and congratulations on the strong quarterly performance. I was wondering you've posted a number of quarters here with really strong growth. I'm kind of wondering a little bit about the guide for the fourth quarter. And are there any hints that you can give us in terms of thinking about the next year? Because it sounds like productivity is improving. It sounds like the pipeline continues to be robust. You continue to win share. Any thoughts – preliminary thoughts in terms of factors that could impact the growth in fiscal 2025 just as people start setting expectations.\nToby Williams: Maybe I'll start off. Mark, it's Toby. I mean I think overall, when you look at the environment overall and you look at how we're positioned and how we performed so far throughout the course of the fiscal year, and then overall, the guide in Q4 and the guide for fiscal 2024. I mean I think overall, we're definitely pleased with the mix, as Steve was saying a minute ago, of growth and profitability that we've been able to deliver. I think we're really happy with the level of innovation that we've been able to deliver over the last 12 months, launching so many new products, and getting over that 550 mark in PEPY. And I think then overall, just again, focused on productivity and still driving growth, focused on productivity, focused on profitability and the authorization on the buyback. I mean I think there's a lot of good things that we've been able to deliver throughout the course of this fiscal year and that are coming with Q4. And I think to some degree, Q4 is probably the starting point for when you start to think about 2025.\nRyan Glenn: Yes. I guess, Mark, this is Ryan. The only thing I would add to that is obviously, as I referenced in the prepared remarks, I think we continue to be fairly thoughtful on expectations and impact from the macro standpoint. So the third quarter came in consistent with what we expected. So we're still expecting some level of softness in Q4. We'll see if that's how things turn out. But I think that's one of the variables that we try to be pretty measured on given the uncertainty in the environment. More broadly speaking to Toby's point, as you think about 2025, obviously, we'll provide formal guidance on the August call. But we continue to see some level of elongation in sales cycles with larger clients. I think we're seeing progress there. We're certainly happy with some of the things we're doing from an up-market standpoint. But I think we'll take all that into consideration as well as update where the macro environment sits when we guide fiscal 2025 in August.\nMark Marcon: Great. And then can you talk a little bit about the talent solutions that you're rolling out? Or would those always be sold with the full platform? It sounds like they could end up being pretty interesting as stand-alones as well.\nSteve Beauchamp: Yes. So we've been really pleased with kind of our talent category in terms of the penetration rates that have increased every single year. Some of these new recruiting features that we touched on really will allow us to drive higher penetration and also be more competitive at the upper end of the market with our recruiting platform. So those have been really well received early on. And then if you think of what we're doing with things like community and driving collaboration and communication, that is available for all of our clients is not an extra fee for a lot of those capabilities. And so that really is a core part of our differentiated story about being the most modern platform in the industry. So I think you're going to see us continue to add additional modules that we can monetize. At the same time, we will look to add new interesting features based off our client feedback that really creates differentiation in the sales process and allows us to drive strong win rates, really in all size customers across our target market.\nMark Marcon: Great. Thank you.\nOperator: Thank you. [Operator Instructions] And our next question comes from the line of Raimo Lenschow with Barclays. Your line is open. Please go ahead.\nRaimo Lenschow: Hey. Thank you. Thanks for squeezing me in. Two things. First, Can you speak a little bit of what you hear in terms of AI, and I'm sorry to kind of ask this kind of very generic question. But like in the context of HR, is that kind of for you guys an opportunity in the short-term? Or is it in hindrance because people are focusing on something else at the moment and you guys kind of are suffering from that? And then the second question is on as you broaden out with the talent offering, et cetera. What does it mean for your go-to-market motion in terms of going back to your installed base, upselling, cross-selling potentially [indiscernible] you have more products driven. Thank you.\nSteve Beauchamp: Yes, I'll start with the first one. I think from an AI perspective, there's certainly lots of moving parts. It's a fast-changing market. We do think there's many opportunities from an HR perspective when you start really taking advantage of the capabilities that AI can drive. We have embedded AI capabilities across our product suite. Sometimes that appears to our customers in terms of personalization and recommendations, other times that appears in terms of writing assistance. Other times that appears in forecasting models. And we think there's plenty of opportunity for us to be able to continue to do that and innovate. And that really will help us reinforce our value prop of being the most modern platform in the industry. We also think HR platforms can be challenging sometimes for users to figure out all the different modules, they're buying more product from us. And so just from a serviceability of the product and being able to help our customers, we think that represents a big opportunity from an AI perspective that we're also investing in. And then the other part of your question is, do we think that maybe customers were not making decisions about HR platforms because they were investing in AI. I guess I don't know the answer to that. We certainly called out elongated sales cycles on the last earnings call. We've got initiatives really driven towards that. That's really more at the upper end of our market. We feel like we're making good progress there. We feel really good about our win rates overall in that market and the size of the pipeline. So I don't know what was necessarily causing that. I think the feedback we get from customers was more uncertainty in the economy than anything else, but it certainly could be a factor.\nRyan Glenn: I think maybe on the other part of your question, just relative to back-to-base sales or cross-sell or upsell. And I think we – the team, as Steve was referencing a few minutes ago, I mean, I think the team has done a great job of being able to take both the products that have been in existence for a while, but also take the new products that we've developed and rolled out over the last handful of years and be able to add that value back to our existing customers and sell and cross-sell back into the base. So I think that's a multiyear effort that really started after the time of ACA. And I think we've continued the traction with that as we've launched and delivered the incremental products that we have, growing the PEPY from 200 at the time of the IPO to 550 where it sits today. So that's been a fairly – it's been a growing but fairly consistent motion over the course of the last handful of years.\nRaimo Lenschow: Yes. Perfect. Yes, makes sense. Thank you.\nOperator: Thank you. [Operator Instructions] And our next question is going to come from the line of Jared Levine with TD Cowen. Your line is open. Please go ahead.\nJared Levine: Thank you. Can you help us with sizing the 3Q annual form filings revenue to give us a sense of that sequential headwind for 4Q?\nRyan Glenn: Sure, Jared. This is Ryan. I think we've probably talked about it in the past. We haven't given a specific number there. I guess, obviously, as you're aware, that is priced on a per form basis. You have an idea of number of clients and employees we have. Obviously, there's an impact relative to turnover at those clients. I guess the way that I would think about modeling that is if you look at where that has moved sequentially over the last several years and what that tick up is and then down into the fourth quarter, I think you'll get a pretty good idea of what that impact is. But we haven't disclosed the number specifically.\nJared Levine: Okay. And then in terms of the 3Q excellent revenue guide be, can you discuss what the primary drivers of that was? And were there any assumptions that came in below your expectations?\nRyan Glenn: I think all in, a pretty solid quarter across the board, certainly from a profitability standpoint. But I think specific to recurring revenue, probably saw incremental upside across the board. I think we felt good with the sales execution activity in the third quarter. You saw that flow through to revenue. I think we were happy to be able to raise the full-year by the beat in Q3 plus a little bit into the fourth quarter. And I think workforce levels came in as expected. And overall, a pretty solid quarter from top to bottom.\nJared Levine: Great. Thank you.\nOperator: Thank you. [Operator Instructions] Our next question is going to come from the line of Pat Walravens with Citizens JMP. Your line is open. Please go ahead.\nAustin Cole: Hey, there. This is Austin Cole on for Pat Walravens. Appreciate you taking my question. I wanted to follow-up on a comment made about what you guys are seeing upmarket specifically and just about how competitive dynamics are changing. I know kind of at a high level, the competitive environment may not change all that much. But you have companies like Workday that are moving down market. And I just wondering – I know their customers might look a little bit different. But I'm just wondering who you're running into what win rates are and how getting new logos is going up market.\nSteve Beauchamp: Sure. So we have been expanding upmarket over the last several years. We expanded that target market up to 5,000 employees a couple of years ago. And have really had great success over the last couple of years. If you look at the growth rate last fiscal year and the year before, we would have called up market as being one of the segments that was a real strong performer for us. This year as we entered it has gotten much bigger. We expanded pretty rapidly because we saw great receptivity. And from a customer perspective, we were really happy with our win rate, and we expanded that a fair amount. And I think what we saw and we called this out last quarter, is it took a little bit longer for some of the new reps to be able to ramp up than we expected. And we just saw elongation in the sales cycle really in the first couple of quarters of the year. As we sit here today, we feel really good about the initiatives that we've had to kind of improve that throughput, we're not all the way through that, but we certainly are in the middle of it. And I think you saw the performance in the quarter. I think we'd tell you we're having success across the board to be able to get to that level of performance. We feel good about where we sit right now. And we don't feel like the competitive environment is such that we can't be successful. Our win rates have been consistent over time, and we feel really good about the investments we've made in product and the feedback we're getting for customers in that segment.\nAustin Cole: Thanks.\nOperator: Thank you. [Operator Instructions] And our next question is going to come from the line of Adam Bergere with Bank of America. Your line is open. Please go ahead.\nAdam Bergere: Hey, thanks for taking my question. Just digging into the linearity a bit this quarter, were January through March, all fairly consistent in terms of demand and as a brief follow-up, did you see some incremental pressure towards the tail end of the quarter that's informing the deceleration to 13% for Q4? Thank you.\nSteve Beauchamp: So maybe just on the linearity and then I'll let Ryan can handle the other one. From a bookings perspective, there's just like a natural seasonality to this business that occurs. So you typically see clients start at the start of each quarter. So January ends up being a big start month for us. April ends up being kind of a big start month in July and October. So that's just a natural progression. The months in between can be relatively even. So no real callouts on those, and we didn't see anything abnormal from a seasonality perspective in the quarter.\nRyan Glenn: Yes. I guess I would just add relative to the question on the fourth quarter. I think if you look at what the implied Q4 guidance was when we guided in February, I think it's probably come in a touch such better than that. And I think that's all relative to the performance we saw in the third quarter from a sales execution standpoint. So nothing that I would call out that was necessarily a surprise on the fourth quarter, and I think you see that flow through from a guidance standpoint.\nAdam Bergere: Thank you.\nOperator: Thank you. [Operator Instructions] And our next question is going to come from the line of Daniel Jester with BMO Capital Markets. Your line is open. Please go ahead.\nDaniel Jester: Great. Thanks for taking my question. Maybe a couple for Ryan to start. Just on that last point about what's baked into the fourth quarter guide, if I remember correctly, you had a rate cut baked into that. And so I guess, one, correct me if I'm wrong, and two, how you are viewing that now in the fourth quarter guidance? And then on the third quarter gross margin, you've had basically two consecutive years of really strong expansion year-over-year there, but looks like gross margin was kind of flatish year-over-year, and so anything you call out for investment or how should we be thinking about gross margin going forward? Thanks.\nRyan Glenn: Sure. So I guess relative to your first question, I did reference in my prepared remarks that we do not have a rate cut now assumed in the fourth quarter. You are correct that when we guide in February, we did call out a Q4 rate cut. We have taken that out based on latest forecast. And I think you've seen that flow through from an implied interest income in the fourth quarter. So we took up total revenue guide by about $8.5 million and I think, call it, $6 million or so of that was an interest income raise. So that is certainly, the performance we saw in Q3 within interest income as well as the removal of that rate cut, which helped the fourth quarter. I think relative to your question on gross margin, I think it can move around quarter-to-quarter. Year-to-date, I think we're up about 40 basis points on adjusted gross margin. Obviously, we've seen some headwind year-to-date relative to some of the workforce level headwinds that we've seen for the first nine months of the year. But I think if you look at back and sort of think about that holistically across a 12-month period, we'd expect to drive leverage year in and year out. Not always linear right? You're not going to get the same leverage each year. But as you step back and look at it on a longer-term basis, we continue to believe that there's the ability to scale adjusted gross margin. And I think that goes for the balance of the P&L. You saw some really significant leverage in G&A, not only in this quarter, but year-to-date, obviously, we raised adjusted EBITDA guidance by, call it, $15 million and almost 100 basis points. So continue to feel really good, as we said earlier in the call, not only about strong revenue growth and execution. But things like free cash flow being up 50%, large ranges in adjusted EBITDA and the ability to return value to shareholders through the buyback.\nDaniel Jester: That's great. Thanks. And then if I can just sneak one more in. You've added a lot of new products the platform over the last year and some change. Maybe just an update in terms of customer uptake of the new iteration of products and maybe compare and contrast to some of the things that you've launched in the past is the velocity of attach rate similar or different? Or anything you'd call out there? Thank you.\nSteve Beauchamp: Yes. We've been really happy with the products that we've launched. Really, if you think about this past fiscal year, you've got Scheduling Plus, which is an advanced scheduling capability. That has certainly been received very well, probably skewed slightly average size customer being a little bit larger for those capabilities, but that's really helped us in that market, and we are continuing to develop new features for that Scheduling Plus skew. So we think that, that remains an opportunity going forward. Employee voice and rewards and recognition really great differentiators for us in the sales process. We always talk about trying to make sure when we build something, we can get to 10% to 20% market penetration within a reasonable time. I think – all of those products are kind of on track to hit those targets relative to what we've seen with other modules that we've built in the past. So we feel really good about the receptivity. And I think the other point I would make is really nice differentiators as well. So it's not just about actually driving the incremental PEPY but it's also about creating and adding value to the differentiated story that we're telling in the market.\nDaniel Jester: Great. Thank you very much.\nOperator: Thank you. [Operator Instructions] And our next question comes from the line of Jason Celino with KeyBanc Capital Markets. Your line is open. Please go ahead.\nJason Celino: Great. Thanks. And I think this might be the first time you've mentioned being the modern HR platform, resonating with Gen Z customers specifically. Would you say this focus is a trend that others are also pursuing? Or is this a differentiator that Paylocity is leading on?\nSteve Beauchamp: That's a good question. Well, I think, obviously Gen Z is a growing part of the workforce, and that will continue to be the case. I think the other call out is Gen Z often has very different demands on HR departments. And those demands are things like they really want to be able to have a voice in decisions that are made. They want to understand how things are being – they want things to be communicated in a much more realtime basis. They really like a multimedia type approach to be able to understand what is really going on. And they really what to know what the organization culture is and their values, because the reality is still a very tight labor market, and they have options from a job perspective, and they don't have a problem looking from one to the other. And so organizations have to spend a significant amount of time not only on things like compliance and making sure payroll is right, making sure you're onboarded, but really trying to find connection, really developing career paths, making sure there's training opportunities. And so if you think about all of those challenges that all the HR teams have, many of the products that we have built over the last several years have really tried to provide unique capabilities for HR departments to be able to handle the dynamic nature of a multigenerational workforce that everybody is dealing with in a tight labor market. And so I think that message has resonated for the last several years, and I think it certainly does today. And we wanted to just call it the fact that many of our features including our mobile app and the ratings and the intuitive nature feedback – the intuitive nature of the product has really gotten us great feedback in terms of how customers are managing the growing Gen Z population.\nJason Celino: Okay. Great. And then maybe just a quick one for Ryan. I think it sounds like the workforce levels moderated in line with what you expected last quarter. But the Q4 guide for recurring revenue also continued to take in further moderation in the workforce levels? Thanks.\nRyan Glenn: Yes, yes, I think that's correct. So Q3 came in consistent with expectations, which was some level of further moderation and then we did bake in beyond that, some additional moderation in Q4. And given I think that there is still some uncertainty out there from a macro standpoint, we did not update that assumption. We'll obviously see how that plays out, but that is the expectation going into Q4 from a guidance standpoint.\nJason Celino: Perfect. Thank you.\nOperator: Thank you. [Operator Instructions] And our next question is going to come from the line of Alex Zukin with Wolfe Research. Your line is open. Please go ahead.\nAleksandr Zukin: Hey guys, thanks, uh, for taking the question. Congrats on the best payroll print this season. I guess maybe just two quick ones for me. First, can we put a finer point on what gives you the confidence or conviction that these longer sales cycles at the higher end of the market are a kind of a macro versus micro or competition dynamic?\nSteve Beauchamp: Yes, it's a good question. So what we really look at is we look at first the pipeline at the top end. And so first-time appointments, demo appointments that we're having with prospects, and then we track the duration of all of the various stages in the sales cycle. And so when things are challenging from a macro perspective, things stay in each of those stages for longer. So if it usually took us 35 days to go from one stage to the next, and all of a sudden it's taking us 55 days that's an indicator. And as long as you're not losing them off the bottom and your win rate is staying relatively similar, that's how we really kind of come to the conclusion that there's some macro uneasiness going on there. And so that's really what we've seen there's initiatives that you try to drive towards that, right? You get more teams involved with that. You really try to understand what an organization's concerns might be. You try to help move them along through the funnel. So it’s not like there's nothing we can do about that. And that's what we called out last quarter. Sometimes it's training reps to be able to have to manage those situations, making sure all the right people at the prospects are involved in the decision. And we've done a lot of that over the last quarter. And we feel like those initiatives are absolutely going to have an impact. And even if the market stays a little bit soft in terms of people making decisions. We feel like we've got the right solution. We're getting the right feedback. We like the win rates that we're driving. And we've got initiatives driving back to the team, so they're just going to be better at handling it.\nAleksandr Zukin: Got it. That makes sense. And then the second question is it's going to be a little bit long winded, but bear with me. If you look at the last kind of time you guys talked about that $2 billion target and that 20% growth rate. Yes, you kind of had you getting there roughly in fiscal 2026. And now if you think about the exit growth rate for Q4 and kind of playing that through the numbers that roughly has you getting there in about one year later. So is it fair to assume that like you're looking at the growth rate of your overall business as like a large growing x and the kind of core growing y. And that moderation in that large growth rate is what's driven that kind of one year out – or to push that target one year out or help us understand maybe if we kind of again break it apart into those two categories, how to think about it?\nSteve Beauchamp: Yes. I think we would really look at the growth rate across our different segments have been fairly uniform on a go-forward basis. We did call out the fact that it was faster for several years, but it's really kind of getting in line with kind of our core segment as well as the larger upper end. I mean I think this is a little bit of a function of being a $1.4 billion business hitting scale, sometimes – even though there's a large market opportunity, it's a competitive market, and it can and it can be more challenging to be able to grow at that same rate when you were half the size. And so we're still prioritizing growth. We're still going to focus on doing everything we can to be able to grow as fast as we can. And at the same time, we think we can kind of balance all the profitability targets. And so I think it becomes a little bit more of a balanced story than just only growth. And we feel like that's the right thing to do to deliver the most shareholder value.\nAleksandr Zukin: Got it. Perfect. Thank you guys.\nOperator: Thank you. [Operator Instructions] Our next question comes from the line of Siti Panigrahi with Mizuho. Your line is open. Please go ahead.\nSitikantha Panigrahi: Thanks for taking my question and congrats on a good quarter. So Ryan, if I look at your Q3 sequential growth rate for recurring and other revenue 23%. That was better than last year Q3 whereas Q1 and Q2 sequential growth are way below last year. So in the Q3, was there any kind of annual price increase for form filing or any kind of pull forward of any go live? Or was there any inorganic revenue contribution like Trace or anything like that?\nRyan Glenn: No, nothing that we would call out from a onetime or unexpected source of revenue in the third quarter. I did get this question in some of the after quarters last quarter relative to sequential revenue. And I think where we sat guiding and I think February 7 or so. We obviously had a really good idea of what started in January. We had a very solid number from a W-2 and form filings perspective. And I think we're able to take all that into account in the quarter. So certainly came in incrementally better than expectations. But on $366.8 million number, we're really about $300,000 or so above the top end of the range. So incrementally better, yes, but relative to that size, I think we were certainly pleased with the results, but nothing I'd call out is material and onetime nature.\nSitikantha Panigrahi: And just to clarify that, when you say – is there any form filing this year was different, the reason I'm asking is the recurring versus form filing. I know you guys don't split, but how should we think about when we think about next year, Q3? Was there any onetime big flow for form filing?\nSteve Beauchamp: Yes. So this is Steve. So form filing is going to be built based off of the number of employees that you have in the previous calendar year. And if you think about that, that's going to kind of grow with the number of employees on our platform. We're also selling them a lot more product. So if anything, on a year-over-year basis, form filing typically doesn't always grow as fast as the rest of our revenue. So it's not actually a tailwind from a growth rate perspective. If anything, it's a slight headwind. And there was nothing out of the ordinary this year.\nSitikantha Panigrahi: Correct. Thank you.\nOperator: Thank you. [Operator Instructions] And our next question comes from the line of Matt VanVliet with BTIG. Your line is open. Please go ahead.\nMatthew VanVliet: Hey, good afternoon. Thanks for taking the question. I guess as you look at the progress of some of the go-to-market corrections or strategies you put in place over the last several months and the improvement is clearly showing here. I guess sort of two parts. One, how much more do you feel like you have to go or just sort of get the reps and the time-based elements through the system there? And then maybe more importantly, how is this impacting your head count planning, especially on the sales front, not only through the end of this year, but as you're planning fiscal 2025 and maybe how that shaped up in light of the improvements over the last few months.\nSteve Beauchamp: I don't think it changes our approach. I think we called out last quarter, we would be focused on productivity opportunities, the balance of this year and as we go into next year. So that's been factored into our thought process around head count. We definitely think there's opportunities there. We like some of the signs that we're seeing in terms of early in those opportunities. I think the only call out I would say is if you think of our average sized customer you can sell that by the time they agree to go on its four to six-week implementation, all that revenue happens pretty quick. When you go up market and you're kind of above 1,000 employees, you definitely can have people committing, call it, four to five or even six months ahead of time starting. So you do – you have these initiatives. You start to see the value of those, you start to see that in terms of clients signing up, but the start dates obviously can be several months out. And so it does have a little bit of a longer time period between driving the initiatives, seeing the improvements and then actually being able to kind of recognize that revenue has started. And so if I'm sitting here today, I would tell you that our big Super Bowl every year is January. And so a lot of these large initiatives will have large clients start every month. But certainly, we are focused on driving improvements throughout the balance of this calendar year and getting ready so that we've got a great January of next fiscal year. And that is typically the cadence when you're upper end of the market.\nMatthew VanVliet: Okay. Very helpful. And then I guess just quickly on the uptake of additional products and sort of customers taking on more of the platform. Are you seeing any differing trends, whether it's down market or upmarket in terms of customers' willingness and desire to take on more product?\nSteve Beauchamp: No. I think – I don't think we've seen any real shift in that. I mean, I think we've been both happy with the amount of PEPY that we've been able to realize over time. I mean, even as we've driven that from 200 to over 550, your realization rate or realized PEPY has been at or north of 50%. I think that's been fairly consistent. And I think part of the reason that's the case is you get broad-based adoption across each part of the market. And I think that's in the case over the last few years. And I think that continues to be the case as we think about fiscal 2024.\nMatthew VanVliet: All right. Great. Thank you.\nOperator: Thank you. I'm showing no further questions at this time. And I would like to hand the conference back over to management for closing remarks.\nSteve Beauchamp: Sure. Thank you so much. Just wanted to say thank you to everyone for your interest in Paylocity, and I also wanted to give a special thank you to all of our teams across Paylocity and especially our operations team for a great job supporting all of our clients in the course of Q3. So thank you, everybody, and hope you have a great night.\nOperator: This concludes today's conference call. Thank you for participating. You may now disconnect."
  }
]