[
  {
    "symbol": "PCTY",
    "period": "Q2",
    "year": 2025,
    "date": "2025-02-06",
    "content": "Operator: Good day, and welcome to the Paylocity Second Quarter 2025 Fiscal Year Results Conference Call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question and answer session. To ask a question during the session, you will need to press star one one on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, press star one one again. Please be advised that today's conference is now being recorded. Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker, Mr. Ryan Glenn, Chief Financial Officer. Please go ahead.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the second quarter of fiscal 2025, which ended on December 31, 2024. I'm Ryan Glenn, Chief Financial Officer. Joining me on the call today are Steve Beauchamp, Executive Chairman, and Toby Williams, President and CEO of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question and answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks, and uncertainties which could cause actual results to differ from the results implied by these or other forward statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission, for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure business. And there's a reconciliation schedule detailing these results currently available on our press release which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to the directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to the upcoming conference schedule, I will be attending the Wolfe Software Conference. Toby and I will be attending the Raymond James Institutional Investors Conference, and Toby will be attending the Stifel Technology one-on-one conference. Let me know if you'd like to schedule time with us at any of these events. With that, let me pass the call over to Steve.\nSteve Beauchamp: Thank you, Ryan, and thanks to all of you for joining us on our second quarter fiscal 2025 earnings call. Our strong results continued in Q2 with recurring and other revenue growth of 17%, as our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. Total revenue grew 16% over Q2 of last year. Our sustained multiyear investment in R&D has resulted in strong product differentiation and significant expansion of our product suite, which has helped drive durable revenue growth and expanded average revenue per client. The recent launch of benefit decision support and our expansion into the office of the CFO with our integrated headcount planning product has increased our max PEPY from $550 to $600, achieving the target we set in August 2023. And this does not yet include any AI-based products. We also remain confident in our ability to drive further product expansion and further expansion of our average revenue per client across new and existing clients with new HCM and office of the CFO products over time. Additionally, our new AI assistant chatbot is now generally available to all Paylocity client admins, and we are pleased with early levels of adoption. Since launching in October, we have seen a 30% increase in utilization, and key features such as natural language search capabilities, which are available in our reporting product, have driven an over 20% reduction in time required for our users to find reports. We are encouraged by the benefits our AI-related investments are driving for our clients and excited to continue adding additional AI-enabled functionality and key use cases over time. Our ongoing commitment to product innovation continues to be recognized by third parties, as Paylocity was recently awarded the TrustRadius Buyer's Choice Award and named overall leader in ten HCM product categories in G2's Winter 2025 Grid Reports. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. As Steve highlighted, the momentum seen in Q1 continued into the second quarter, resulting in solid selling season performance and increased revenue and profitability guidance for fiscal 2025. Our results are driven by strong sales and operational execution, continued product differentiation, and a more stable macroeconomic environment. We also continue to be pleased by our ability to add talented sales reps and solution consultants, and our ongoing investments in training and development across our sales team helped contribute to another quarter of strong go-to-market execution, including continued traction upmarket. Additionally, we are pleased to see another quarter of strong performance across the broker referral network, which once again delivered more than 25% of our new business in Q2. The sustained success of our broker channel is driven by our modern platform, marketplace ecosystem, third-party integration and API capabilities, and because we do not compete against our broker partners by selling insurance products. We remain committed to investing in and supporting the broker channel going forward, with the goal of continuing to deliver real value and true partnership and support to our referring brokers and clients. Overall, we are pleased with Q2 results and believe we are well-positioned heading into the back half of the fiscal year, which is reflected in our increased guidance for fiscal 2025. While still in the very early days, we're pleased with the reception of the Airbase acquisition from both existing and prospective clients, and we will continue driving the integration process across our teams and our platform. From our early conversations, the value proposition of having a single platform through which all payroll and non-payroll related spend can be managed with a robust set of integrations with key third-party systems is resonating with decision-makers across our target market. We are also pleased with the ability to collaborate with mutual clients to drive a combined roadmap that delivers incremental value to businesses across our target market. Finally, this time of year is a very busy time for all of our teams as they work closely with clients on year-end processing of payrolls, W-2s, 1095, and annual tax form filings to federal, state, and local agencies and on the implementation of new clients. I want to thank all of our employees for their hard work and dedication to our clients during this very busy time of year. The strong culture at Paylocity also continues to be recognized externally as we recently were named to Forbes list of America's Most Trusted Companies and Fortune's list in 2024 Best Workplaces in Technology in addition to being recognized as one of America's Greatest Places for Workplaces for Diversity by Newsweek for the second consecutive year. I would now like to pass the call to Ryan to review the financial results in detail and provide our increased fiscal 2025 guidance.\nRyan Glenn: Thanks, Toby. Q2 recurring and other revenue was $347.7 million, an increase of 17%, with total revenue of $377 million, up 16% from the same period last year. Our strong Q2 results were primarily driven by another solid quarter for our sales team, allowing us to come in $8 million above the top end of our revenue guidance, and resulting in a raise for our fiscal year guidance by more than our beat for the second consecutive quarter. Our adjusted gross profit was 73.8% for Q2, versus 72.7% in Q2 of last fiscal, representing a 110 basis points of leverage as we continue to focus on scaling our operational costs while maintaining industry-leading service levels. We continue to invest in research and development and understand our overall investment in R&D. It is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 16.2% compared to the second quarter of fiscal 2024, and we remain focused on making investments in R&D throughout fiscal 2025 as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities, on a non-GAAP basis, sales and marketing expenses were 21.7% of revenue in the second quarter. And on a non-GAAP basis, G&A was 9.8% of revenue in the second quarter, and we remain focused on consistently leveraging our G&A expenses on an annual basis. Our adjusted EBITDA for the second quarter was $126.2 million, or a 33.5% margin, exceeding the midpoint of our guidance by $8.2 million. Excluding the impact of interest income on funds held for clients, adjusted EBITDA was $96.9 million, also exceeding our guidance for Q2. Briefly covering our GAAP results for Q2, gross profit was $252.4 million, operating income was $46.6 million, and net income was $37.5 million. In regard to the balance sheet, we ended the quarter with cash and cash equivalents of $482.4 million and $325 million in debt outstanding related to the funding of the Airbase acquisition. In regard to client-held funds and interest income, our average daily balance of client funds was approximately $2.8 billion in Q2. We're estimating the average daily balance will be approximately $3.2 billion in Q3, with an average annual yield of approximately 360 basis points, representing approximately $29 million of interest income in Q3. On a full-year basis, we are estimating the average daily balance will be $2.9 billion with an average annual yield of approximately 390 basis points, representing approximately $113 million of interest income. In regard to interest rates, our guidance reflects all Fed cuts to date with an additional 25 basis point rate cut assumed in May. Additionally, given the confidence we have in our business and our strong cash flows, we continue to utilize our share repurchase program with $8.6 million or approximately 40,000 shares of common stock repurchased in Q2 at an average price of $197.90 per share. As a reminder, we have approximately $341 million remaining under our share repurchase program and anticipate continuing to execute against the program over the remainder of the year. Finally, I'd like to provide our financial guidance for Q3 and full fiscal 2025. Note that as a result of strong selling season and continued momentum across our sales team, our fiscal 2025 recurring and other revenue guidance increased by $15.5 million and our total revenue guidance by $20.5 million at the midpoint, which includes the full impact of our guidance beat in Q2, and a further increase in back half fiscal 2025 revenue guidance. Additionally, we continue to realize success driving increased profitability across our business, resulting in increased adjusted EBITDA guidance, which includes the full impact of our guidance beat in Q2 and increased profitability expectations for fiscal 2025. With that said, for the third quarter of fiscal 2025, recurring and other revenue is expected to be in the range of $410 million to $415 million, or approximately 12% to 13% growth over third quarter fiscal 2024 recurring revenue. And total revenue is expected to be in the range of $439 million to $444 million, or approximately 10% growth over third quarter fiscal 2024 total revenue. Adjusted EBITDA is expected to be in the range of $171 million to $175 million. Adjusted EBITDA excluding interest income on funds held for clients is expected to be in the range of $142 million to $146 million. And for fiscal year 2025, we are increasing all aspects of our guidance as follows. Recurring and other revenue guidance is now expected to be in the range of $1.445 billion to $1.455 billion, or approximately 13% growth over fiscal 2024 recurring and other revenue. Total revenue guidance is expected to be in the range of $1.558 billion to $1.568 billion, or approximately 11% growth over fiscal 2024. Adjusted EBITDA is expected to be in the range of $542 million to $550 million. And adjusted EBITDA excluding interest income on funds held for clients is expected to be in the range of $429 million to $437 million. In conclusion, we are pleased with our Q2 results and the momentum we have across our sales and operations team as we exit our busiest time of the year. Operator, we are now ready for questions. Thank you.\nOperator: To withdraw your question, please press star one one again. Due to time restraints, we ask that you please limit yourself to one question and one follow-up question. Please stand by while we compile the Q&A roster. And our first question will come from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Great. Thanks very much. Not sure who it's for, but with the M&A coming in the market and Acorn getting taken out, they clearly had a big broker channel. They're now gonna be competing with those brokers. Do you see that as an opportunity to accelerate your broker go-to-market?\nToby Williams: Hey, Brad. It's Toby. I mean, think if you look at what's made us successful over time, with the broker channel, it's been the investments that we've made to build those relationships to provide, you know, a meaningful technology to them, visibility into their business. It's being able to provide integrations that matter and ultimately, I mean, we don't compete with the broker channel with the sale of insurance products. And so I think those are the things that have made us successful and helped us build meaningful relationships with that channel. And I think that's, you know, that's what we wanna be able to do as we look forward. And, you know, I think if there's any disruption that comes from a deal like that, that's where we want to be to provide those types of relationships with brokers that are successful.\nBrad Reback: And just a quick follow-up on that, Toby. As you build broker relationships, does it typically take months, quarters, or longer to get them productive?\nToby Williams: Well, I think a lot of the relationships that we have have been built over time with our sales force in the field. And I think when those relationships exist, they tend to be productive. You know, it doesn't take years to get them to be productive. It's all about our ability to build those relationships, make the connection, and then being able to communicate the value that I just ran through. And when we can do that, we can usually make those productive in the near term. I think I was mentioning, Brad, just to add to that is, yeah, no problem, is oftentimes the broker relationships are not necessarily exclusive, meaning, you know, they might refer to Paylocity, they might refer multiple providers. We obviously wanna be that premier provider in each of these relationships. And so if there happens to be less competition in the market and fewer options available, then I think to Toby's point, we feel like we are really well-positioned since we've been doing that really from the very start of Paylocity. With a great reputation in the market to take advantage of that.\nBrad Reback: Excellent. Thanks very much.\nOperator: Thank you. One moment for our next question. And that will come from the line of Scott Berg with Needham. Your line is open.\nScott Berg: Hi, everyone. Nice quarter. Thanks for taking my questions. Steve and Toby, I guess as I track your prescriptive remarks maybe this quarter and last quarter, I get a sense that you have a maybe a renewed sense of optimism in the business. Sounds like you're able to call payrolls properly, and it seems like deal flow is kinda stabilizing. Is that the right way to view, you know, some of your comments that you made here today? Or is that maybe something I'm making up in my head, I guess?\nToby Williams: Well, I mean, I think we would hope that you would hear a lot of consistency in our approach. So I mean, I think we have always been optimistic about our ability to continue to grow and serve clients well and, you know, as we're just talking about delivering value to the broker channel, and so yeah. I think that's been a pretty consistent approach from a strategy perspective and approach to the growth algorithm, and I think you continue to hear that today. And I think Steve and I both have, I think, tried to communicate that over time, and I think that still holds true.\nScott Berg: Understood. And now that we're through your obviously busy selling season in the fall and we're into calendar Q1. How do you think about sales hiring this year during calendar 2025 as you start to think about 2026? I know not all your plans are certainly made for next fiscal year, but when you think about sales capacity, hiring, does it change much from how you viewed last year? I know this is typically when you start to hire more at least into the spring for the busy selling season. Thanks.\nToby Williams: I think we, so if you go back to, really, the hiring season and coming into this fiscal year, we had come in growing sales headcount by around 8%, and we talked about at the time was that, you know, we would that would be our starting point. And the focus was really on, you know, driving productivity across our go-to-market teams. And that if we, you know, saw a market change in the macro, I mean, we still would have room to be able to continue to invest throughout the course of the year if leaning in made sense. And I think as we sit here, you know, coming through, you know, the first half, I think we performed well in selling season. We feel good about the momentum that our go-to-market teams have had, and I feel like it's been a more stable environment than we would have seen last year. And so, you know, I think we feel good about the investments that we made coming into the year and still, you know, remain optimistic about our ability to be a destination for talent, particularly in go-to-market, in the industry, and, you know, I think when those opportunities present themselves, we're ready.\nScott Berg: Excellent. Nice quarter again. Thanks for taking my questions.\nOperator: Thank you. One moment for our next question. And that will come from the line of Samad Samana with Jefferies. Your line is open.\nSamad Samana: Hey, guys. Thanks for taking my questions and good to see the strong quarter. Just one note for my good friend, Scott. Dumbledore said it could be happening inside your head. But doesn't mean it shouldn't be real on earth either. So just remember that, Scott. So Toby and Steve, for you guys, I want to ask about Airbase. And I know you're talking about the early impression that you're getting from customers that it's been well received. I guess, can you maybe just help us understand what for the customers that you've sold it to since the acquisition, have you seen them buy it upfront along with the rest of the suite, or are you seeing them engage in conversation? And put it as something down the road. Maybe just help us understand what that level of receptivity has been and how that's manifested in the numbers.\nSteve Beauchamp: Sure. So, obviously, you know, all under, you know, Airbase is still a relatively small revenue stream when you look at our overall business. But having said that, we are pleased with the early indications in both scenarios. First, interactions with our sales team that are bringing clients on board upfront. We're seeing some activity there where customers are interested in having that conversation about how Airbase products can help them as they look at modernizing their HCM suite. So some good examples there. And then at the same time, as we go back to our existing customers and we talk to them about this acquisition and how we might be able to help them, we're also seeing some interest. That's all being done as we're working on the product integration, which we think will only increase the value proposition over time. So I think we're happy early on with both the team that we brought over with Airbase and the early reception from both our customers and prospects in the market.\nSamad Samana: Great. And then, Ryan, maybe a follow-up for you. Can you give us an idea of what the contribution from Airbase was in the quarter? And just as I think about the upward revision to the guidance, that's because that's a really positive outcome. And how much of an influence did Airbase have on that, or was that all for the core business?\nRyan Glenn: Yeah. I would think of the contribution from Airbase being consistent with how we sized it last quarter, which is roughly 1% of revenue or so this fiscal year. So to Steve's point, I think that business is performing as expected and relative to the overall business is fairly small. So when you think about both the results in Q2 and the larger guidance raised in the back half of the year, I would view that as really driven by core Paylocity overperformance.\nSamad Samana: Alright. Excellent. Thanks, guys, and congrats on a great quarter.\nOperator: Thank you. One moment for our next question. And that will come from the line of Mark Marcon with Robert W. Baird. Your line is open.\nMark Marcon: Hey. Good afternoon. Thanks for taking my questions, and let me add my congratulations. Great quarter. Wondering if you can talk a little bit about what you're seeing just in terms of the differences between the mid-market relative to the upper end of your target market. In the past, you had talked about longer decision cycles in the upper end. Are you seeing any change in tone? And what are you seeing in terms of receptivity or areas of strength and any areas that are more or less competitive?\nToby Williams: Yeah. Mark, it's Toby. I think if you go back to this time last year, you know, we were talking about the fact that we had seen longer sales cycles, particularly in the upper end of the market. And part of that was due to more, I think, cycles through with decision-makers and seeing more demos, etcetera, things like that. And, yeah, I think as we came through the third quarter and then through the fourth quarter of last year, we also started to see a little bit more stability in the market. I think as we came into this year, you know, that's really how we set the year up. I think that's what we saw through Q1, and I would say, you know, stable through Q2. I don't think we saw any significant change in the dynamics in the market, but we did feel like it was more stable. And I think, you know, coming through selling season, you know, really proud of how our teams executed. And I think they carried some momentum from, you know, from Q1 into Q2, and, you know, I think it was a strong execution quarter for the teams in selling season.\nMark Marcon: That's great. And then it sounds like, you know, both the benefits decision support and headcount planning are off to a good start. Can you give us a little bit more of a feel in terms of the level of receptivity, how much are you getting in terms of new sales, who's that appealing to? Particularly in terms of headcount planning, which goes into the office of the CFO. Anything there would be helpful.\nSteve Beauchamp: Yeah. So I think we're definitely happy with the start for headcount planning. As you mentioned, it is the first product in that office of the CFO category and being able to deliver that to oftentimes both new customers, many of those who are starting in January and probably haven't fully taken advantage of headcount planning yet, but also back to the base and getting some of our existing customers. That's probably where we've gotten even more feedback from existing customers as they're going through an annual cycle, going through their planning cycle, you know, they were able to use that tool to do, you know, better headcount planning than they would have oftentimes been doing in spreadsheets and manually. So off to a good start. As you know, Mark, we always try to target these new products to get them into the 10% to 20% penetration range over time, get them off to a good start. And I would say that that's certainly the case with both these products. I think the benefit decision support has a little bit of cyclical nature to it. You know, benefit enrollment happens throughout the year, but it is a little bit more concentrated in the fall. We were able to get some great feedback from customers that used that tool in the fall. And, you know, we think we've got momentum as new customers are coming on and they plan on using our benefit enrollment tool both throughout the year, but again this fall that it's going to deliver a much better experience for employees and also has some real nice value to brokers.\nMark Marcon: Excellent. Great job.\nOperator: Thank you. One moment for our next question. And that will come from the line of Brian Peterson with Raymond James. Your line is open.\nBrian Peterson: Can you test call over Brian? I have a quick question. So you're saying that your PEPY has reached your target of $600 and you've reached this goal. What is a high-level thought on how you're now recalibrating, rethink about a new target going forward?\nSteve Beauchamp: Sure. I'll take that. So, yeah, we're really proud of being able to reach that goal back in 2014 at IPO. We tripled the amount of product that we've been able to sell. And so we also see a big opportunity for us to be able to do that. The PEPM model is certainly one that works very well when you think of HCM products as we move into the office of the CFO, some of those might not be that same pricing model. However, I don't think that changes the mix of new units and ARPU over time. So you'll see us continue to focus on that average revenue per customer growth, which might be priced a little bit differently depending on the product category. But it's the same model that we've really kind of operated. And so we'll have to give some thought in terms of how we discuss that on a go-forward basis. But as I mentioned earlier, we're still very early innings into the Airbase acquisition. And so I would expect more color over time, but no change in focus. Continue to drive more new products back to the existing customers and new customers continue to drive both units as well as ARPU as the formula for growth.\nBrian Peterson: Thanks. And then also speaking about Airbase a little bit, I know it's early days still on this integration, but a little bit curious. I hear things keep on next twelve to eighteen months of this integration pass, how are you balancing the prioritization of integrating Airbase versus continuing driving these new product launches and continuing driving the penetration with existing products.\nSteve Beauchamp: Yeah. I would say at our current scale, you know, roughly one and a half billion dollars in revenue, we've consistently continued to invest a similar percentage back into R&D that has been part of our belief that the product differentiation is what's really driving the performance over time. And so we will balance the investment both in terms of enhancements and features to our customers with existing products, new HCM products, innovation capabilities with things like AI, and then at the same time make investments into new categories. I think we've had a pretty good history of being able to do that and been first to market in many of those categories. And so we feel like we're well-positioned to be able to do that. Oftentimes and most of the time, that's organic. In some cases, we've made some strategic acquisitions where we think it's a great fit. We spend the time to integrate that product so the customer experience mirrors something that we would build. And we've got to continue to balance our portfolio of investments from an R&D perspective. But certainly, increased size and scale allows us to do that.\nBrian Peterson: Got it. Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Daniel Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Great. Good evening, everyone. Thank you for taking my question. Ryan, great outcome on the EBITDA line. If I look at the free cash flow of the business, doesn't look as expansive on a year-over-year basis. My guess is that Airbase is kinda muddying the waters a little bit there. So can you help us think about the conversion of EBITDA to free cash flow for the rest of the year? Any puts and takes we should be considering, we're working through our model.\nRyan Glenn: Sure. Yeah. Obviously, we don't guide to free cash flow specifically and certainly quarter to quarter that number moves around with timing of spend. So nothing that I would call out that would be concerning or one-time to your point. There's obviously a headwind this fiscal year relative to the Airbase acquisition, which we've characterized as roughly a hundred basis point headwind for adjusted EBITDA. I think the headwind to free cash flow is pretty similar. So when you think where we are today, on a TTM basis, free cash flow roughly 21% margin, we do have the headwind over the balance of this fiscal year. I think we will end up somewhere north of 20% this year. That's not formal guidance, but I think when you look at where this goes going forward into 2026 and beyond, expect to be able to continue to drive leverage going forward. But wouldn't have any specific current concerns relative to Q2, just some timing of when some of the cash flows hit within the year.\nDaniel Jester: Okay. That's great. Thank you. And then, you said in the past, Airbase is certainly gonna be something that you're gonna try to push back into your current customer base. Sounds like headcount planning is also something that your current customers are very interested in. As you think about sales investments going forward, do you think about changing the mix between sort of hunters and gatherers in your sales organization and, you know, what could potentially that look like if it were to emerge?\nToby Williams: Hey, Dan. It's Toby. I mean, yeah, we have called this out over time, and we have invested in both. So I think going back to 2015, 2016 time frame, started to invest in a team to sell back in the customer base and that's grown over the course of time since then. I think the mix has continually shifted in terms of, you know, higher percentage of growth in that team that's selling back into the base relative to the field. But it's, I think to Steve's comments a few minutes ago, the focus has absolutely been from a go-to-market spend standpoint to focus on new units. That's a really important part of the growth algorithm while also focusing on our ability to and investing in our ability to go back to the client base as our product set has expanded now to $600 in PEPY. So that's certainly been both have been important and that's some color on the mix.\nDaniel Jester: Great. Appreciate it. Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Patrick Walravens with Citizens. Your line is open.\nAustin Cole: Great. This is Austin Cole on for Pat Walravens. Appreciate you taking the questions. Nice results. Steve, more high-level question here, but would love to get your just general thoughts on the Paychex Paycor deal. Why do you think Paychex wants to buy Paycor? How do you see this market evolving? Going forward.\nSteve Beauchamp: Yeah. So certainly have no inside information but I think just from a macro perspective, there has been consolidation in this industry over time. It is, you know, businesses that can drive pretty high margin. So as you're able to do that, you can typically take some cost savings out. I think they called some of that out in their press release in terms of targeting some cost savings. I think Paycor has focused a little bit of a larger size customer than Paychex historically. So I think you put all that together and that's, at least, is the rationale that I would think about. And I think from our perspective, we're gonna continue to do what we were doing before. You know, it's really about innovating. We've fared very well against both those competitors. They're strong competitors, for sure. But they're someone that we've had success with over time. And so we feel like if there's a change in their strategy, if there's any type of disruption, then that could be incrementally beneficial to us. Otherwise, we're gonna continue to do what we do and deliver the most modern experience to our customer.\nAustin Cole: Great. Appreciate that perspective. Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Sitikantha Panigrahi with Mizuho. Your line is open.\nSitikantha Panigrahi: Thanks, and congratulations on an excellent quarter. Going back to Airbase again, so is your plan now to run this as an independent group or even keep that product in the same form, or are you planning to, you know, rebuild on the Paylocity platform before you go to your Paylocity customer base to cross-sell this? Basically, my question, when should we start thinking about cross-sell opportunity of, you know, Airbase into Paylocity?\nSteve Beauchamp: Yeah. So I think stepping back from a long-term perspective, our goal will be to integrate those platforms over time so that we're delivering a very unified and holistic experience as well as all the spend management capabilities. That will certainly take some time. Having said that, our customers can still benefit from some of the integration that already exists and that we're gonna be adding over time. And so we will continue to sell new customers. We will sell back to our customer base in such a way that we'll grow over time. And so as we go into next fiscal, I would say, you know, throughout next fiscal and throughout the back half of next fiscal, I would imagine we start to gain some momentum with product integration. It'll be a multiyear effort. But the bigger opportunity from our perspective is really this that you will continue to grow standalone revenue within Airbase. But the bigger opportunity is the cross-sell. And to your point, that in you look at our history, that will take us twelve to eighteen months, this a little bit larger acquisition. Wouldn't surprise me if that's more in the twelve to twenty-four months. But what I'm really happy about is even without all the benefit that we're gonna be able to deliver from a truly integrated platform, we're still seeing good receptivity from both prospects as well as existing customers. So off to a really good start.\nSitikantha Panigrahi: That's great. And then, Ryan, a follow-up to your guidance. You know, you had a pretty strong first half, and if I look at your Q3 guidance, it implies that your Q4 recurring revenue will be probably 10% or below. Is there anything that we should think about or is it conservatory some year?\nRyan Glenn: Yeah. See, that I probably characterize it, I think, a few different ways. If you step back and think about how we set up the initial guide for this fiscal year, I think we were really clear that we felt like we wanted to return to a beat and raise cadence and I think we viewed it as if we had strong execution across the sales team and from an operational standpoint, we'd be in a spot to be able to beat and raise. And we're halfway through the year. We've raised both quarters. We've raised both quarters by more than the beat. And I think within our guidance philosophy, our view is we have raised pretty significantly, if we continue to see strong sales performance, then you've heard from us here today relative to the momentum we feel like we have in that team that come May earnings call, we'd be in a spot to potentially raise again. I think probably the one thing I would call out relative to Q2 versus Q3 is while the vast majority of the overperformance we saw in Q2 was sales-driven, we did see pull forward of call it, a handful of million dollars of recurring revenue that we would have typically expected to see in Q3. And that's really driven off of some client starts that came in a little bit earlier. So both new and some of the upsells we have to existing clients, being able to get those in a couple of months earlier. Net positive, I think, both from our perspective as well as clients that, you know, get the product in the hands of the clients earlier, the implementation process is smooth, and for us, it's all recurring revenue. So we did see that slight pull forward between Q2 and Q3. But, you know, when you think about the guide both third quarter and to the fourth quarter, again, we feel like if we perform well, we should be able to beat and raise over the balance of the year.\nSitikantha Panigrahi: Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Raimo Lenschow with Barclays. Your line is open.\nRaimo Lenschow: Hey, thank you and congrats for me as well. Two quick questions. First, have you like, can you talk a little bit about the labor market? Obviously, you remember last year was actually was almost a year before where, you know, we had issues on new hiring, etcetera. Have you seen any change, especially if you look at the small business index post-election? You know, that's kind of going up every week. Improvements there? What are you seeing there in that market? And I had one follow-on.\nRyan Glenn: Yeah. I think broadly speaking, we've seen a really stable macro, and I think that that's, you know, from a macro standpoint across the board within employees in the platform. You know, as you know, we probably had a, you know, a touch of conservatism or prudence into the guidance. We did not assume any increase, and, you know, I'd say there's probably modest upside to that in the first half of the fiscal year. Not particularly material, but net net and overall positive. I think relatively the guide in the back half of the year, we continue to take a prudent approach. So to the extent you see a little bit of upside there, that would potentially provide some modest upside to revenue in the back of the year. But overall, it's been pretty stable. Nothing I'd call out as particularly, you know, materially different versus expectations.\nRaimo Lenschow: Yeah. Okay. But and then can we talk a little bit about gross margin Q2 obviously saw a really strong improvement ex-float. Can you talk a little bit about the drivers there and how we should think about that going forward?\nRyan Glenn: Yeah. Absolutely. I mean, we've been pleased with the expanded gross margins we had really last year, but certainly the first half of this fiscal year as well. So I think Q1 was a strong quarter. And I think for us, continued to balance investments across our operational team to make sure we are driving that industry-leading service levels. But at the same time, we're working hard to make sure we're prioritizing spend, making sure that we're driving efficiencies and automation. I think we've been able to balance that. We feel really good about where we are from a retention and implementation standpoint, but at the same time, we're able to take advantage of our size, our scale, and the fact that we're investing across people, process, and technology to be able to drive some pretty healthy margin leverage while not having to sacrifice on the service side.\nRaimo Lenschow: Perfect. Thank you.\nOperator: Thank you. And one moment for our next question. And that will come from the line of Jared Levine with TD Cowen. Your line is open.\nJared Levine: Thank you. Can you discuss the level of client interest in your Gen AI functionality and thoughts on your ability to monetize in the future?\nSteve Beauchamp: Yeah. Sure. As we mentioned in the prepared remarks, we were pretty happy with the launch of our internal chatbot that our customers are using. So probably gives the ability to really create a better experience overall. And so we're seeing some pretty nice increases. We still want them there for them when they call us and email us or interact with them, but it gives them really quick answers and maybe built-in advice over time. And so that's been really strong. We've got a number of other use cases that use generative capability. Things like writing announcements to all of your employees or job descriptions, we've got some things in rewards and recognition and performance. And so our approach overall is really to embed the AI capabilities to really make everyday processes even better for our customers. So sometimes that means faster, sometimes that means higher quality, sometimes it means it's just much easier for them to be able to get their jobs done. And we have a number of modules that we think we continue to enhance to do that. We think that's the bigger opportunity, both great service experience and differentiation embedded into the product. From a longer-term perspective, we'll certainly keep an eye out for monetization opportunities. But from a near term, it's really client satisfaction, efficiency, and differentiation.\nJared Levine: Great. And then in terms of retention, can you provide some color on your January retention performance just given the significance of that for the year and how that compared to year on year in relative to historical levels?\nToby Williams: Yeah. I mean, as you know, this is a really important time of year for us. With all the volumes that our teams handle going into December and then through January from both a service standpoint and from an implementation standpoint. And I would say, you know, similar to the remarks I made earlier about our success in the selling season, really proud of the efforts of our team at Paylocity in service and implementation going through and serving our clients really successfully in December and January. So, you know, obviously, you know, we'll kind of flush out how Q3 comes together, but I think sitting here today at the beginning of February really happy with that, really proud of our teams and all the effort they put in to serve our clients in the busiest time of year.\nJared Levine: Great. Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Terry Tillman with US Securities. Your line is open.\nTerry Tillman: Yeah. Hey, good afternoon. Congrats for me on the quarter. I'm running out of questions to ask. I mean, they're relegated to SuperVO picks or maybe an upmarket traction question. So I'll go for the latter so it doesn't get into a sensitive topic on picks. As it relates to the upmarket traction, I think that was in the prepared remarks. Maybe you could just share a little bit more about are you seeing any evolution on attach rate of other products beyond core and payroll? And what are you getting in terms of some early signals on their propensity to buy these office of CFO products maybe versus more of smaller mid-market or smaller customers. Thank you.\nSteve Beauchamp: Yeah. So I think the first part of the question, we are definitely seeing continued increases in attach rates. I would describe them as gradual increases in attach rates as we bring on some of the customers in the upper end of our market. And I would probably credit much of that to better execution on our part. We called that out a year ago, felt like there were a number of things that we could do, you know, training, staffing, different roles that support the sales organization. I think we've executed well on all those things, and we saw the benefit of that through selling season. I think you saw that with the guidance raise. I think that's probably the bigger element. We've seen product continue to perform well upmarket and continue to gradually increase attach rates. I think the second part of your question, one of the things we really liked about Airbase was the customer overlap. So the average size customer that they had was very much similar to our average-sized customer. So more than a hundred employees, but their average-sized customer wasn't, you know, ten thousand employees or in the enterprise space. So we think it's a nice product market fit. And therefore, you see us having the strategy of taking that product, getting feedback from customers, using that voice of the customer to continually enhance capabilities. And as we enhance the capabilities, just like we have in HCM, you'll start to continue to expand that target market, and it'll appeal to maybe slightly larger clients over time. And so I think you'll see the best receptivity early on in the core part of our market where we have the bulk of our customers and the bulk of our revenue. So that's certainly the strategy, and it'll certainly take us time to be able to execute upmarket, but we do think that that opportunity exists.\nTerry Tillman: That's helpful. Thank you.\nOperator: Thank you. One moment for our next question. And that will come from the line of Steve Enders with Citi. Your line is open.\nSteve Enders: Great. Thanks for taking the questions here. Guess maybe just to start, you know, I think based on the commentary around seeing strong sales momentum and macro maybe stabilizing to improving a bit. I guess, maybe how is that potentially manifesting in what you're seeing either in sales cycles or top of funnel or the number of that you're saying just would be helping a little bit more, I guess, detail around some of those things.\nToby Williams: Hey, Steve. It's Toby. I mean, I guess I would say that I wouldn't call out any significant movement in any of those things. I would more characterize it as as we came into this fiscal year, you know, after, you know, some after the overhang that we all saw across enterprise software and in our industry from a macro perspective, our of last fiscal year, we started to see that stabilize in Q4. And I think that's, you know, that's how we talked to you all about the setup coming into the fiscal year for Q1, and I think that's what we saw materialize in Q1 as well. It was just a level of stability in the demand environment that we hadn't seen during most of the prior year, and I think that really continued into Q2, and I think that put our go-to-market and sales teams in a really good position to, you know, talk to prospects about our value prop, and I'm, you know, talked earlier about the momentum that we saw in that and just, you know, really proud of their execution in the quarter.\nSteve Enders: Okay. Perfect. No. That's great to hear. And then I guess just on, you know, maybe some of the Q2 versus Q3 dynamics, appreciate calling out some of those earlier starts here hitting in Q2. But anything else that we should kinda keep in mind for seasonality or maybe, you know, going through filing season, how should we be thinking about some of the impacts from that perspective between the quarters?\nRyan Glenn: Yeah. Yeah. It's a good question. I think that has largely tracked consistent with expectations. Maybe the one thing I'd call out relative to form filings is that typically grows a touch less than recurring revenue. It grows more consistent with client growth or employee and the platform growth. So I think it's coming in consistent with expectations. Obviously, we're able to raise the fiscal year pretty significantly. But that's probably one when you look at the core recurring revenue versus form filings that would be, you know, a touch of a headwind into the third quarter. And then I think the other thing I'd mention would just be the contribution from Airbase doesn't have the same seasonal impact as our business. So from a growth standpoint, within year over year, you would see Airbase year over year have a little bit of a less impact to growth in Q3 versus Q2 or Q4 because you don't have that same seasonal bump that the core Paylocity business does. Outside of that, there's really nothing I'd call out as material.\nSteve Enders: Okay. Perfect. Thanks for the questions.\nOperator: Thank you. One moment for our next question. And that will come from the line of Jason Celino with KeyBanc. Your line is open.\nJason Celino: Hey. Thanks for taking my questions. Just a couple quick ones. Don't wanna get too ahead of my skis here, but you know, on paper, it looks like the Q2 recurring revenues accelerated. But if we strip out Airbase, then we strip out a little bit of that pull forward, would Q2 have really just been more similar to the 14% growth you saw in Q1? Or did you see any, you know, a little bit of acceleration there?\nRyan Glenn: No. I think that's a fair characterization. I think when you control for those two items, I think it would be, you know, spot on or almost, you know, very close to what the Q1 recurring revenue growth would be.\nJason Celino: Okay. And then the pull forward of those clients from Q3 to Q2, you said it was start related. Was it election related possibly? I'm just trying to understand why something would be earlier.\nRyan Glenn: No. Not election related at all. I think when you think about the momentum we've talked about from the sales organization really in Q4 of last year in the first half of this fiscal year. Really strong bookings momentum. And, you know, those clients get slotted into a start period, and to the extent we're able to pull them earlier, it would really be that type of scenario versus anything tied to the election. And again, right, you've got to characterize this. Not particularly material on a $375 million quarter. We're talking about a handful of million dollars of impact. But it would really be those touch earlier starts versus anything election related.\nJason Celino: Okay. Perfect. Thanks.\nOperator: And one moment for our next question. And that will come from the line of Alex Zukin with Wolfe Research. Your line is open.\nAlex Zukin: Hey, guys. Thanks for taking my question. A lot of might have been asked but maybe just on workforce levels, I think some of your peers called out impacts from holidays and weather. Just curious kinda what you're seeing out there, what you saw, what you're seeing out there, and how you're thinking about that for the rest of the year, and then I've got a quick follow-up.\nRyan Glenn: Yeah, Alex. This is Ryan. Nothing that we would call out relative to weather or holidays that would have any material impact to that. I think as I mentioned earlier, probably a touch better than expectations in the second quarter. We've had a pretty prudent approach to workforce levels, the balance of this fiscal year. So net net a positive wouldn't call it out as particularly meaningful to results. And I think guidance within the back half of the fiscal year continues to have a level of prudence around workforce levels.\nAlex Zukin: Perfect. And then maybe just on the competitive side, you know, we continue to hear about some well-capitalized, you know, call it private competitors. Specifically down market. Have you seen any kind of do you see those guys more often? Any change in win rates? Any ARPC pressure or just anything to call out in general?\nToby Williams: I don't think there's anything particularly we would call out. I mean, I think the commentary that we would generally provide is this has always been a really competitive space, and continues to be today. And I don't think we've seen any material shift in the mix of competitors in any given deal, but certainly, you know, no doubt it's competitive out there. And I think, you know, going back to some of Steve's earlier comments, I mean, our strategy has been that we wanna be able to provide the most modern platform in the industry to our clients and prospects and, with the broadest and deepest solution set. I think we're really well-positioned to do that today, and I think that remains the strategy.\nAlex Zukin: Perfect. Seems like it's working.\nOperator: That will come from the line of Jake Roberge with William Blair. Your line is open.\nJake Roberge: Yeah. Thanks for taking the questions and congrats on the results. Just wanted to follow-up on the go-to-market front. Sounds like you're looking to add more reps in the back half of the year. Just given the strong selling season. I know it's early days with Airbase, but as you move more into the office of the CFO, does the profile of seller you're looking for change at all there?\nSteve Beauchamp: I think we'll evolve the go-to-market motion for the Airbase model. So don't wanna give you the impression that we have that all figured out. However, we do have a lot of experience in terms of selling back to the customer base for a variety of products. And so we're gonna leverage that experience to be able to do something similar. So that ends up putting less of the burden on that front-end seller and allows us to have more specialized knowledge and more of an inside team type of model. So that is likely the motion that we certainly start with. And therefore, that allows us to continue to hire HCM experienced reps driving productivity over time while being able to leverage some level of office of the CFO experience to be able to help them when they are able to generate interest in the prospects. More likely the model than changing our hiring profile.\nJake Roberge: Okay. That's helpful. And then great to hear the productivity gains with the new AI assistant. I know it's not being sold as a separate today. But now that we're shifting more into kind of the agentic AI season, is that something you're looking to also add to your platform? And could that potentially be an unlock for monetization on the AI front?\nSteve Beauchamp: Sure. Yeah. So the interesting thing about our client's business and what they use us for is there are a lot of workflows. There's a lot of approvals. If you think of things start with an employee, they go to a manager, they have to be routed across the organization based on certain rules, they get approved. And so there are opportunities to be able to provide AI use cases that are really automating these experiences and or really maybe shortening the experience by leveraging the historical data that we have to be able to provide insights, skip some of the steps, do some of the work on behalf of our customers. I think we're in the early innings of that. And so yeah, we definitely feel like that is an opportunity over time. Whether that gets translated into pure monetization, better, more modern software that allows us some pricing power, or just differentiation, we think it's the right area of investment.\nJake Roberge: Sounds great. Congrats again on the solid results.\nOperator: Thank you. One moment for our next question. And that will come from the line of Arvind Ramnani with Piper Sandler. Your line is open.\nArvind Ramnani: Hi. Thanks for taking my question. You know, you've certainly been talking about Gen AI and some of the investments you've made and some of the benefits over the last few quarters. You know, the big question I have is, you know, hasn't started to kinda show up in terms of, like, improved win rates or in terms of kind of, like, ability to charge folks more or better margins? Like, where is sort of the Gen AI basically showing up in terms of your financials? And then the second thing is, you know, with some of these announcements made from kind of DeepMind kind of last week, does it change anything? Or does it matter to you at all?\nSteve Beauchamp: Yeah. So I don't think it changes anything in terms of how bullish we are on being able to create unique experiences leveraging whether it's machine learning algorithms, whether it's generative AI models or other types of agentic use cases, I think those are all opportunities for us. And I think the easy answer is, oh, all of a sudden we have something that we're gonna monetize and we can clearly talk about it. But I don't think that's really the way it's going to necessarily work. That may happen over time, but I think the bigger opportunity is us to leverage AI to continue to drive a better client experience, to increase margins over time, to be able to create more differentiation so that we can continue to grow recurring revenue and add units. Those all so I think AI has to be embedded throughout the organization and be in all parts of the business. Driving productivity, driving efficiency, driving client experience. And if we do that, that really helps us really deliver the vision of being the most modern platform in the industry is by embedding AI across the organization, and that's the approach that we're taking versus maybe being focused on some AI module that we would try to singularly monetize.\nArvind Ramnani: Okay. Yeah. That's helpful. And, you know, I also had a broader level question. You know, you had this kind of, you know, elevated growth rates, you know, obviously, you know, in the last few years and then, you know, Paylocity, but also others in the industry, particularly kind of the cloud players have kind of, you know, kind of growth rates have taken kind of a step back. And, you know, I'm just trying to figure out, you know, is it because of some of the legacy players getting more competitive? Or kind of saturation of market and what I'm really trying to get to is, like, you know, do we ever get back to those, you know, kind of well above 20% growth rates either for you or for your peers in the industry.\nToby Williams: Yeah. I think, you know, you gotta look back over time a little bit, you know, just to there's been the ups and downs that have gone along with COVID. And, you know, certainly, no doubt, you know, all the cloud players that you referenced are on bigger today than they would have been pre-COVID. At the same time, I think from a strategy perspective, you know, our consistent strategy has been to, you know, bend the deliver of the most modern platform in the industry. We think, you know, we're doing that today. It's what's helping us win. It's what's helping us be, you know, the highest growth player out there. And, you know, I think that'll continue to be the focus as we look forward. And think everything that we're doing today, whether it's, you know, with respect to Airbase or the development of the new modules that we've released and talked about and or whether it's some of the AI investments that we've made that Steve just walked through. I think those are all the elements that go into being able to provide the most modern platform out there and ultimately beat the competition.\nSteve Beauchamp: And the only thing I would add, Toby, is at the same time, we've really been focused on delivering value from a shareholder perspective in terms of improved EBITDA and free cash flow as Ryan mentioned. And so it's really about growth as our number one priority, but very close second behind that is making sure that we're delivering both top line and bottom line improvements. And we feel very comfortable being able to execute that strategy on an ongoing basis.\nArvind Ramnani: Perfect. And, you know, congrats on a good print and looking forward to more of the use as the year progresses.\nOperator: Thank you. I'm showing no further questions in the queue at this time. I would now like to turn the call back over to management for any closing remarks.\nToby Williams: Thank you very much. I'd just like to say thank you to everyone for your interest in Paylocity. Thanks for joining the call, and a special thank you to all of our employees for making it a great quarter and taking great care of our clients. Everybody, and have a good night.\nOperator: Thank you all for participating. This concludes today's program. You may now disconnect."
  }
]