[
  {
    "symbol": "PCTY",
    "period": "Q3",
    "year": 2025,
    "date": "2025-05-02",
    "content": "Operator: Hello, and welcome to Paylocity Holding Corporation Third Quarter Fiscal Year 2025 Earnings Conference Call. At this time all participants are in listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] I would now like to turn the conference over to Ryan Glenn. You may begin.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the third quarter of fiscal 2025, which ended on March 31st, 2025. I'm Ryan Glenn, Chief Financial Officer and joining me on the call today are Steve Beauchamp, Executive Chairman; and Toby Williams, President and CEO of Paylocity. Today we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business. And there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to their directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, we will be attending The Cowen Annual Technology Media & Telecom Conference, The BMO Virtual Software Conference, The Jefferies Software Conference, The William Blair Annual Growth Stock Conference, and The Mizuho Tech Conference. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thanks, Ryan and thanks to all of you for joining us on our third quarter fiscal 2025 earnings call. Q3 represented another quarter of strong results with recurring and other revenue growth of 15%, driven by our differentiated value proposition of providing the most modern software in the industry continuing to resonate in the market. Total revenue grew 13% over Q3 of last year. Our sustained multiyear investment in R&D has resulted in continued product differentiation and a significant expansion of our product suite, which has helped drive durable recurring revenue growth and continued expansion of our average revenue per client. In addition to our entrance into the Office of the CFO with the acquisition of Airbase and the introduction of headcount planning, we have continued to build on our HCM industry leadership position on AI with a focus on driving a better client and user experience. For example, our AI assistant can now leverage a client's employee handbook to answer policy-related questions such as, what is my organization's PTO policy? Additionally, our AI assistant is able to reference publicly available resources to answer common compliance-related questions like, what sick pay laws apply to my organization? These automated instantaneous solutions are examples of the early AI use cases that we believe will drive tangible efficiency gains for our clients. We also recently launched several new features to connect and streamline the employee recruiting and onboarding process. Clients can now embed background checks and skill assessments from third-party vendors into our recruiting module through seamless API integrations. We believe continued investment in our broad ecosystem of third-party partners will provide our clients with the tools needed to run and grow their business. Combined with our ongoing investments in both HCM and finance, we are confident we will continue to drive higher average revenue per client over time, which is now how we think about the economic opportunity associated with our product growth given that not all of our new products will be priced in a PEPY model. But all of our products will contribute to a higher average revenue per client over time. Our commitment to product development also continues to be recognized in the market with Paylocity recently being named to TrustRadius' list of best loved software for 2025 and an overall leader in 10 HCM product categories in G2's Spring 2025 Grid Reports. Additionally, Airbase by Paylocity was named a Visionary in the 2025 Gartner Magic Quadrant for Accounts Payable Applications. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks Steve. Solid sales and operational execution continued in our busiest time of the year, helping to drive another quarter of strong recurring revenue growth and increased revenue and profitability guidance for fiscal 2025. Recurring and other revenue of $421.1 million grew 15% over Q3 of last year and beat the high end of our guidance by $6.1 million. We remain pleased with our sales execution and our strong competitive position in the market, and we continue to see our product strategy resonating with clients and prospects. We also saw another strong quarter of channel performance as channel referrals, primarily from benefit brokers and financial advisers, once again represented more than 25% of new business for the third quarter as we continue to leverage the strong source of referrals. The sustained success of our broker channel continues to be driven by our modern platform, third-party integration and API capabilities and because we do not compete against our broker partners by selling insurance products. We remain committed to investing in and supporting the broker channel going forward with the goal of continuing to deliver real value and true partnership and support to our referring brokers and clients. While still in the early days, the Airbase team is now fully integrated within Paylocity, and we're pleased with the progress we've made towards integrating the platforms from both a product and go-to-market perspective. The value proposition of having a single pane of glass through which all payroll and non-payroll-related spend can be managed with a robust set of integrations with third-party systems is resonating with existing and prospective clients. We expect this area will serve as a meaningful point of competitive differentiation, continue to build off the workforce planning capabilities offered as a part of our headcount planning solution and help to expand our average revenue per client going forward. Lastly, Q3 represents our busiest time of year as we work to support our clients through all their year-end processing and annual tax form filing needs. I'd like to say a huge thank you to our more than 6,500 employees who live and represent our key values every day and who work hard to support our clients. The strong culture at Paylocity continues to be recognized externally as we were recently named by Newsweek as One of America's Greatest Workplaces for Women. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2025 guidance.\nRyan Glenn: Thanks Toby. Q3 recurring and other revenue was $421.1 million, an increase of 15%, with total revenue up 13% from the same period last year. Our Q3 results were primarily driven by another solid quarter for our sales team, allowing us to come in $10.5 million above the top end of our total revenue guidance and resulting in a raise to our fiscal year guidance by more than our quarterly beat for the third consecutive quarter this year. Our adjusted gross profit was 77% for Q3, an increase of 110 basis points from Q3 of last fiscal year as we continue to focus on scaling our operational costs while maintaining industry-leading service levels. We continue to make significant investments in research and development. And to understand our total investment in R&D, it is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 14.6% when compared to the third quarter of fiscal 2024. And we remain focused on making investments in R&D as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regard to our go-to-market activities on a non-GAAP basis, sales and marketing expenses were 18.2% of revenue in Q3. On a non-GAAP basis, G&A costs were 8.4% of revenue in the third quarter. Our adjusted EBITDA for the third quarter was $197.1 million or 43.4% of revenue for the quarter and well exceeded the high end of our guidance, while adjusted EBITDA excluding the impact of interest income on funds held for clients was $163.6 million, also significantly exceeding our guidance for Q3. Briefly covering our GAAP results. For Q3, gross profit was $324.7 million. Operating income was $127 million, and net income was $91.5 million. In regard to the balance sheet, we ended the quarter with $477.8 million in cash, cash equivalents, and invested corporate cash and $243.8 million outstanding on our credit facility related to the Airbase acquisition with approximately $81 million repaid on our outstanding balance in Q3. Additionally, given the confidence we have in our business and our strong cash flows, we continue to utilize our share repurchase program with $84.9 million or approximately 429,000 shares of common stock repurchased in Q3 at an average price of $198.13 per share. In total, through April 30th, we have repurchased $150 million or approximately 800,000 shares of common stock this fiscal year at an average price of $190.16 per share. As a reminder, we have approximately $200 million remaining under our current share repurchase program and anticipate continuing to execute against the repurchase program going forward. In regard to client-held funds and interest income, our average daily balance of client funds was $3.6 billion in Q3. We are estimating the average daily balance will be approximately $3.1 billion in Q4 with an average annual yield of approximately 350 basis points, representing approximately $27.4 million of interest income in Q4. On a full year basis, we are estimating the average daily balance will be approximately $3 billion with an average yield of approximately 400 basis points, representing approximately $120 million of interest income. In regard to interest rates, our guidance reflects all Fed cuts to-date with an additional 25 basis point rate cut assumed in next week's FOMC meeting. Finally, I'd like to provide our financial guidance for Q4 and full fiscal 2025. Note that as a result of our strong third quarter, we are increasing our fiscal 2025 recurring and other revenue guidance by $12.5 million and our total revenue guidance by $19.5 million at the midpoint, which includes the full impact of our guidance beat in Q3 and a further increase in Q4 revenue guidance. Additionally, we continue to realize success driving increased profitability across our business, resulting in increased adjusted EBITDA guidance, which includes the full impact of our guidance beat in Q3 and increased profitability expectations for fiscal 2025. We continue to be pleased with our ability to drive operating leverage in our business with our updated guidance reflecting 100 basis points of adjusted EBITDA leverage, excluding interest income on funds held for clients, versus fiscal 2024, and representing approximately 200 basis points of organic operating leverage in fiscal 2025, well more than offsetting the approximately 100 basis point headwind in fiscal 2025 from the Airbase acquisition. With that said, for the fourth quarter of fiscal 2025, recurring and other revenue is expected to be in the range of $358.1 million to $363.1 million or approximately 11% growth over fourth quarter of fiscal 2024 recurring and other revenue. And total revenue is expected to be in the range of $385.5 million to $390.5 million or approximately 9% growth over fourth quarter fiscal 2024 total revenue. Adjusted EBITDA is expected to be in the range of $118.7 million to $122.7 million. And adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $91.3 million to $95.3 million. And for fiscal year 2025, we are increasing all aspects of our guidance as follows. Recurring and other revenue is now expected to be in the range of $1.460 billion to $1.465 billion or approximately 14% growth over fiscal 2024 recurring and other revenue. Total revenue is expected to be in the range of $1.580 billion to $1.585 billion or approximately 13% growth over fiscal 2024. Adjusted EBITDA is expected to be in the range of $571 million to $575 million. And adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $451 million to $455 million. In conclusion, we are pleased with our Q3 results and the momentum we have across our sales and operations teams as we head into the final quarter of the year. Operator, we are now ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question comes from the line of Scott Berg with Needham & Company. Your line is open.\nScott Berg: Hi everyone. Really nice quarter here. My first question, Steve, is about a comment that you made around future modules maybe not being in a PEPY kind of model. I guess how does that change your conversations with customers? HR -- and I know you're starting to do more outside of just the traditional HR role, but I think about how HR managers kind of think about managing their budget, historically been a very much a per-employee basis conversation. Do some of the things that you're bringing to the market today, does it really change that conversation? Is it something that they're kind of accustomed to? Maybe help us think about how that might be different.\nSteve Beauchamp: Yes, it's a good question, Scott. I think you're right. The HR buyers are definitely used to per employee per month translating to a per employee per year model. And if you look at our HCM portfolio, that is the way we've priced it historically, and that's the way we're going to continue to price it going forward. I think the call-out is as we move into Office of the CFO, you often see per user model. There may be certain features in there that have transactional fees associated with it. And so our goal is to replicate pricing that the personas are used to, whether that's a CFO or an HR leader, and make sure that we've got a competitive solution not only with features but from a pricing perspective. And that will require different pricing models for different solutions and different personas. I don't think it's a problem from a go-to-market perspective because it's really a land-and-expand strategy that we're executing. And so our existing sales force will certainly be leading with the HCM products. We will leverage the additional products from a differentiation perspective, but I think the bigger opportunity is to sell back to the client base with those products, which would be a different sales force.\nScott Berg: Understood. Helpful. Thank you, Steve. And then, Ryan, your operating expenses were, I don't know, much lower than I would have expected in the quarter even with your typical kind of outperformance cadence. Was there any one thing -- or one-time items that kind of contributed in the quarter to kind of drive that? Because operating expenses were basically flat quarter-over-quarter, and that's not your typical Q2 to Q3 seasonality?\nRyan Glenn: Yes, Scott, nothing that I'd call out particularly one-time. I think you can always get a little bit of timing within the fiscal year relative to some of the hiring but then some of the non-labor expenses as well. I think if you look at for the first nine months of the year, R&D spend is up really consistent with revenue growth in the low teens. Sales and marketing spend, I think, is about 12% first nine months of the year. So a little bit of timing. I wouldn't read into that other than just about when the costs may come in throughout the fiscal year.\nScott Berg: Excellent. Really nice quarter. Congrats again guys.\nOperator: Thank you. Our next question comes from the line of Brad Reback with Stifel. Your line is open.\nBrad Reback: Great. Thanks very much. Maybe from a macro perspective, you can talk to what you're seeing in real-time?\nToby Williams: Yes. Brad, it's Toby. I mean I think from a macro standpoint, we've seen things be -- I think if you go back to the end of last fiscal year, we would have said things were starting to stabilize. And I think that was the case in the first two quarters of this fiscal year. I think what we started to see in Q3 was probably some continuation of that stability. But I think there's definitely starting to be some reflection of that in some of the deals. And I think that goes back to a little bit of what we would have seen last year where you just started to see a little bit of pause entering into the mindset of buyers. And I think I wouldn't lean into that too far, but I think that's some of what we're starting to see again in the market. But I think in Q3, I mean, still strong performance, and I think had a really good January and pleased with overall with how the team executed through the course of the quarter and up to this point in the year.\nBrad Reback: Great color. And with that as the backdrop, any sense how that might impact your hiring plans for quota-carrying capacity as you head into fiscal 2026?\nToby Williams: Well, we haven't -- we certainly haven't finalized the plans for heading into 2026 yet. But I think we're watching pretty closely what we're seeing on a day-to-day basis across the business and certainly with respect to our go-to-market efforts. I mean I think -- if you think about how we came into this fiscal year, the situation wasn't entirely different. And I think we came in with a focus on slightly lower headcount growth and the view that we'd be able to drive productivity throughout the course of the year. And I think that's really what we've been able to do so far in the first three quarters of fiscal 2025, and I think our mindset is probably in a similar spot, at least at this point at the very start of Q4. But like I said, we're kind of going through the cycle right now of putting the plans together. And I think overall, I would just say I feel pretty good about how we've executed from a go-to-market perspective throughout the course of the first three quarters.\nBrad Reback: Great. Thanks very much.\nOperator: Thank you. Our next question comes from the line of Brian Peterson with Raymond James. Your line is open.\nBrian Peterson: Just adding my congrats on the strong quarter. So Toby, I wanted to follow up on some of the macro commentary. Is there anything that you're seeing that's separate depending on certain size of your customer base, with the larger or smaller customers? Or just any more color on what you could say if people are maybe hitting the pause button a little bit?\nToby Williams: No, I mean I think it's -- I think we are starting to see the very beginnings of things like that. I don't think -- I wouldn't call it out in any other way really. I mean I think last year, when we got into Q1 and Q2, we started to see more thoughtful decision-making, probably taking a little bit longer, particularly in the enterprise space. I mean I think coming through the end of last fiscal year and into this fiscal year, I think we have shored up some of our execution. And I think the investments that we've made, particularly in the enterprise part of the market for us, have really been paying off. And I think you saw a lot of that coming through in the strength that we had in January. But I think it's -- we're kind of in the early days of what I described, and no other real comments.\nRyan Glenn: Hey Brian, the only thing I would add relative to the client base is we're seeing a lot of stability. So as I look at client workforce levels, they're actually up a touch year-over-year. We're seeing some of the same seasonal growth that we would see in a normal cycle where some of the clients that have seasonal employees are hiring in that April and May, June timeframe. So I agree with Toby's point, but I think at the same time, within the client base, we are seeing a lot of stability and seeing some of that natural seasonal movement that we would typically see.\nBrian Peterson: Got it. And maybe just a follow-up, Ryan, on the margins. Like as we think about the longer-term lens given what you guys just did with the 2 to 3 points of margin expansion, excluding float, what's the right way to think about that cadence of margin expansion longer term? Thanks guys.\nRyan Glenn: Yes, I think we obviously have been really pleased with the first nine months of this year, the ability to take up the guidance, and as I said in my prepared remarks, guiding operating adjusted EBITDA, so ex float, to 100 basis points of leverage, which is really north of 200 when you factor in the headwind from Airbase. And that's on the back of fiscal 2024 where we had 280 basis points of operating EBITDA leverage. So tremendous amount of leverage we've driven across the business, particularly over the last 24 months. Would certainly not expect to drive that level of overperformance in the normal cycle. And I think we've always thought about this on really a multiyear basis. So you may enter periods where you have a little bit of incremental investment across the business, especially when you significantly overperformed. So, we'll keep all of those elements in mind as we think about what 2026 and beyond would look like. But no question, over the medium and long-term, we continue to have a lot of confidence in our ability to drive adjusted EBITDA and free cash flow margins higher as the business continues to scale.\nBrian Peterson: Thanks Ryan.\nOperator: Thank you. Our next question comes from the line of Samad Samana with Jefferies. Your line is open.\nSamad Samana: Hi, good evening and thank you for taking my questions. Maybe first, just -- I know the company has been very, very consistent in the approach to the guidance framework. But I just wanted to ask some context given some of the answers you've given in the Q&A, which is -- because the increase being more than the beat is obviously a great sign. But is that point in time based on what you've already experienced? Or does it incorporate some of the early signs maybe that you're pointing out that may have been a -- shows maybe a touch of weakness maybe out there? Just help us understand how you guys kind of qualitatively thought about the guidance?\nRyan Glenn: Yes, I think we -- as you said, we have had a lot of consistency when we think about guidance, and we have had the same approach for Q4. So I think to my comments a minute ago, we're seeing a lot of stability in the client base. I agree with Toby's comments that we're certainly seeing the volatility out there. There's some level of uncertainty, but would not say that there's been any material impact to the momentum we've seen in the business for the first nine months of the year. So, I feel like we've taken all the factors into account and feel really good about the Q4 guidance. And I think similar setup to how we've talked about the first three quarters of the year, which is feel like that's a prudent level of guidance. And if the team continues to deliver strong results, we'd be in a position to potentially beat and raise.\nSamad Samana: Great. And then maybe just a follow-up. I know Scott asked about just the seasonal trend in OpEx. But if I zoom out, as a follow-up, sales and marketing expense has actually been relatively flat or it's only slightly melted up since March of 2024, right? And I think that's pretty impressive given what you guys have been putting in terms of top line numbers. So how much of that is the focus on productivity that you guys have called out? Obviously, sales team seems to be doing a great job there versus you guys deploying maybe some of these new AI technologies internally to be more efficient or offset maybe headcount growth there. Just help us understand given that it has really plateaued over the last several quarters?\nToby Williams: Fairly broad question there, Samad. I mean I think overall, I would just step back and say -- go back to a few comments that I made a minute ago. I mean I think what you're seeing from us is a focus on really being able to drive productivity. And I think part of -- a big part of the sales and marketing line is certainly our sales headcount. And we came into this year with a lower level of growth in overall headcount year-to-year than we would have the prior few years. And I think our ability to hold that line from an expense standpoint and produce the results that we're putting up for the first three quarters of the year are broadly reflective of our focus this year just on trying to drive a higher level of productivity. So, I know there's a few parts to your question, but that would be the overall sort of sentiment in terms of how we came into the year, the investments that we were making and what we thought we'd be able to produce with those investments.\nSamad Samana: Understood. Thank you so much.\nOperator: Thank you. Our next question comes from the line of Mark Marcon with Robert W. Baird. Your line is open.\nMark Marcon: Let me add my congratulations for the really strong results. You mentioned early in the call that Airbase is fully integrated and the value is resonating. I'm wondering -- I know it's really small, but can you talk a little bit about what you're seeing qualitatively in terms of discussions? And can you quantify a little bit what the contribution is from a top line perspective? I know it's small, but just wondering what rate of growth you're seeing, how confident you're starting to feel about the future, how we should think about that from a longer-term perspective?\nSteve Beauchamp: Yes, I think the most important part for us to focus on is how do we feel about the product and that resonating in the marketplace. As you know, it typically will take us 12 or 18 months before we phase in an integrated offering. And we're making good progress on that front, and we're excited about that opportunity. But the great part about Airbase is it's a great product on a stand-alone basis. And so we've been able to continue to sell that in the market. In some cases, those are Paylocity customers. In other cases, they're not Paylocity -- existing Paylocity customers. And so that has gone probably slightly better than our expectations. At the same time, we think the bigger opportunity still stands in front of us. And that's as we complete integration, which will certainly happen in phases, the value proposition becomes even stronger because we start to leverage the data set across the combined portfolio. And as we've had conversations and some of those sales going back to the client base, the idea of being able to have all of your spend in a single spot and track it and manage it with the same workflows, leveraging employee of record, all of that message is resonating. So, I would tell you, we're probably waiting to push too hard on that until we get past this first phase of integration. That will happen over several phases. But early signs in terms of are we happy with the product that we bought, is it resonating the market, the answer is absolutely yes.\nMark Marcon: That's great. And then you dedicated a little bit more space both in terms of the press release as well as your comments with regards to the broker channel and what you're seeing there. I'm wondering, are you seeing any sort of evidence given the recent competitive moves that there's even more brokers that are looking to work with you? Or what are you seeing from that front?\nToby Williams: Yes, I mean I think, Mark, as you know, we've always had a really substantial focus in our business on the broker channel and try to develop broad and deep partnerships with referring brokers across the U.S. And I think that's been -- the value that we've been able to bring to the broker channel has, I think, helped make that sustainable at the level that we've been able to maintain over the course of the last decade plus. And I think our strategy around being a really good and value-added partner to brokers is no different today than it's ever been. I think you've seen us remain committed to our investments in those channels, to our investments with those brokers. And I think our message to the broker community has been one of consistency and one of true partnership, whether that's from a technology perspective or otherwise. And I think that message has continued to resonate in the market in the face of some industry events with consolidation where they might face different challenges or some disruption. And I think we're sort of the steady hand in all that to partner with them throughout whatever it is they might experience. And I think that's broadly been our message to the market. That's been our message to brokers. And I think that has resonated particularly well over the last handful of months.\nMark Marcon: Great. Thank you very much.\nOperator: Thank you. Our next question comes from the line of Daniel Jester with BMO Capital Markets. Your line is open.\nDaniel Jester: Great. Good afternoon and thank you for taking my question. Steve, in the beginning of your prepared remarks, you touched on all of the AI innovations that you've launched. I guess I'd love a little more color about sort of the engagement with your customers with those innovations. Have they gotten more comfortable, more enthusiastic about it? And how should we be thinking about sort of the broad strokes of adoption maybe as this year progresses?\nSteve Beauchamp: Yes, it's a great question. We really look at the opportunity from an AI is really embedding use cases across our product that will make our customers more efficient, add additional context and insight, make it easier to find their way across the applications. There's just so many use cases. And so we are definitely seeing an increase in the number of use cases. I mentioned a couple in the prepared remarks in terms of employee use cases, where they can get answers to things that they might have to hunt for in a handbook and have that instantaneously available on a chatbot-type interaction. We're also seeing pretty significant increase in utilization just in our chatbot utilization, which is really the clients themselves, asking questions, using it for way finding, finding insights. And we're also excited about bringing third-party data into the equation, so we can deliver additional insights. So employees can reference compliance-oriented information. Rather than going online, they can do it right in our product in another type of interaction. And so you'll see this across our platform, whether it's in scheduling plus and pre-populating schedules. Our strategy is to embed AI in as many use cases as possible. And we think that's the right way to approach a modern platform. And it also doesn't create angst and anxiety when you do it that way. It's not like you've got the side AI thing that is an overlay. It's actually embedded in things that you do, and it makes their everyday lives easier. And for us, that we think that's a big opportunity.\nDaniel Jester: Great. Thank you. And then just on the comment about growth in average revenue per client is certainly a key driver going forward. Is that -- should we interpret that as maybe an incremental push upmarket? Or is this moving more horizontally and capturing more wallet share for the customer across HCM and also the CFO? Thank you.\nSteve Beauchamp: Yes, I think if you look at our history, we've had a really good success if you take average revenue per customer and you look how that has grown and how that is correlated to the amount of total product that we've had available. We've always characterized that as total PEPY. And that's because we price it on a per employee per month, so it's pretty easy to understand. I think what we're trying to emphasize here is the actual growth in average revenue per client becomes an even more important metric for us going forward because not all of our products are actually going to be priced on a PEPY basis. And so that will happen with this horizontal expansion into other areas. But by no means do we think that takes away from the opportunity for us to further expand both existing products into HCM as well as add new SKUs to HCM. So, really we're going to try to do both of those things.\nDaniel Jester: Very clear. Thank you.\nOperator: Thank you. Our next question comes from the line of Jared Levine with TD Cowen. Your line is open.\nJared Levine: Thank you. I wanted to double-click on the margins here, too, but more focused on the gross margin side here. So year-to-date, you have had some strong expansion within that ex-float gross margin here. Can you detail what are the primary drivers there specifically? And then any reasons why that 4Q gross margin ex float should be different than the 1Q levels here -- excuse me, the first half levels?\nRyan Glenn: Yes, Jared, I think we continue to execute against the playbook that we've talked about for the last handful of years, which is to say that as we continue to grow, we think we can drive scale and efficiencies across the entirety of our operational spend while at the same time continuing to invest in those teams to be able to drive strong client retention. And I think we've, as I said, executed on that playbook. So, it is everything from being able to take advantage of economies of scale with third party and software spend as our business grows, being able to reduce manual effort, being able to make sure that we're really putting the dollars to the best use. And obviously, having strong revenue performance as well helps gross margin, too. So I feel good about the progress we made. I feel like there's the ability to continue to drive margin forward as well.\nJared Levine: Got it. And then in terms of Airbase, how could the recent increase in macro uncertainty impact the near-term growth outlook for that business? I know part of that business is transaction fee driven. Are you kind of seeing any softness to-date in terms of this increasing macro uncertainty? Has it been pretty consistent there in terms of what you're seeing on the transaction side of that business?\nSteve Beauchamp: Yes, I think one of the key messages is how we can save our customers' time, save them money and make them more efficient, which I think does resonate when there's uncertainty in the market. And a large -- the majority of the revenue really in Airbase is software-oriented revenue. So, we don't necessarily see any material impact at the moment from any macro changes. And of course, we haven't really seen macro changes yet. So, I think overall, both HCM and Airbase, we've sold in different markets, whether that's growth markets or whether you got flat markets or whether you've got recession. I think the value proposition historically has resonated, and I'm pretty confident that Airbase will as well.\nJared Levine: Got it. Thank you.\nOperator: Thank you. Our next question comes from the line of Raimo Lenschow with Barclays. Your line is open.\nSheldon McMeans: Hi, this is Sheldon McMeans on for Raimo. Thanks for taking our question. Another one on the macro, perhaps from a slightly different angle. It does seem like we're all operating in a tougher and more uncertain macro, particularly relative to last year. And you've been through various cycles in the past. And probably, could you speak to any learnings that you've had on what resonates more in this sort of environment? And given the likely heightened focus on cost control for your customers, do you see an opportunity to lean more heavily on the Office of the CFO side? And are you making any minor adjustments to your sales script here to account for that?\nSteve Beauchamp: Yes, I think we've always tried to balance the message with our customers between kind of innovation, engaging with employees, driving the right culture to be able to retain them but at the same time giving them a platform that just fundamentally makes them more efficient. And so do you lean sometimes a little bit more on the engagement side versus the efficiency? You certainly do. Different customers have different priorities. But we're in a great position because we can really help them solve either and/or both. And so you do see sometimes with certain customers where they are maybe more focused on the ROI that they're going to get the efficiency. We don't feel like we have to make changes from a scripting or sales force training. I think we're pretty equipped to do that. That's something that we do on a regular basis. As you mentioned, we've seen different cycles in our past. I think it's one of the great things about what we offer, is you've got value even if the market is a little bit soft because everyone is looking to be more efficient, and we can help them do that.\nSheldon McMeans: Excellent. Thank you.\nOperator: Thank you. Our next question comes from the line of Patrick Walravens with Citizens Bank. Your line is open.\nAustin Cole: Great. This is Austin Cole on for Pat. Appreciate you taking the questions. I guess -- this has been a good Q&A. Just I guess stepping back, Toby, as you look ahead to FY 2026 here, if you were to boil down to one thing, what do you think it will be that's most important for Paylocity to get right?\nToby Williams: Well, I think we've been able to execute, I think, better and better over the course of the last year or so from both a go-to-market perspective and from an ops perspective. And I'm really proud of our teams and how they've delivered over the course of the first three months -- or first three quarters of this year. And I think we're on a good trajectory in terms of how we have guided the close of the year. And I think that sets us up to continue to deliver in both of those groups as we tee up fiscal 2026. And then I think when you overlay a lot of the comments that Steve has made with respect to our product momentum, whether that's in the context of some of our really exciting AI initiatives or whether that's in the context of being able to lean into Airbase and that product set more as we get into fiscal 2026. And I think that's probably the combination that is -- that's the opportunity that's before us to continue delivering in fiscal 2025 and the path that we've been on but then I think probably lean into some of those things a little bit harder yet as we kick off 2026. So I think that's what's in front of us.\nAustin Cole: Great. Thank you.\nOperator: Thank you. Our next question comes from the line of Terry Tillman with Truist Securities. Your line is open.\nBobby Dee: Great. Thanks for taking the questions. This is Bobby Dee on for Terry. Just one two-parter from me again on the product. Curious to get an update on how you're thinking about the add-on product innovation/development cadence for the rest of the year? And separately, on recent product launches, what's moving the needle at the point of sale at this point? Thank you.\nSteve Beauchamp: Yes, I'll take the last part first. So if you look at kind of maybe the wave of products that we have released, they continue to increase adoption rates, both back to the base to customers as well as our sell-through rate on the front end. And so pretty happy with things like rewards and recognition, employee voice, scheduling plus, learning plus, really some of these enhancements that we've made to the core HCM platform that really helps our clients gather feedback and engage with employees, driving culture and higher retention. Those have all continued to do well at higher penetration rates over time. I think we're very early on some of the newest products when you think about the Office of the CFO. So, I think FY 2026 becomes a year where we start to measure greater success as we start to roll out integration between the two platforms. But overall, we've really been happy with the increase in average revenue per customer that we've been able to drive across our portfolio.\nBobby Dee: Thank you.\nOperator: Thank you. Our next question comes from the line of Siti Panigrahi with Mizuho. Your line is open.\nUnidentified Analyst: Hey, this is Phil on for Siti. I just wanted to circle back on Airbase. I guess once you guys complete the integration, is it going to be like -- are you going to have one sales team that's selling both the HCM payroll offering and the Airbase? Or will there be separate Airbase-focused reps? Thank you.\nSteve Beauchamp: Sure. Yes. So, we have had a model historically where our outside sales force is largely in charge of landing new customers and new units. We get them implemented. We get them onboarded, hopefully, with as many products as they need. And then over time, those customers often find that they're very comfortable with Paylocity, doing a great job from a service perspective, and they add additional products over time. We will really, from an Airbase perspective, look for both opportunities. So we will look for our sales team to identify need upfront, and then we'll have experts that will be inside that will help navigate that purchase process for the customer. And then at the same time, we'll have those same folks be calling back into the customer and then being able to add that on. We think that some of that purchase might happen at the same time, but realistically, they'll probably have different implementation time frames. So you end up with some different expert resources, which is the same way we do things like TPA and other products. So it's a model that we've run for many years and we feel very comfortable with.\nUnidentified Analyst: Got it. Thank you.\nOperator: Thank you. Our next question comes from the line of Kevin McVeigh with UBS. Your line is open.\nKevin McVeigh: Great. Thanks so much. Hey, was any of the revenue outperformance in the quarter any change in terms of kind of competitive dynamics just given some of the consolidation that's been occurring in the industry?\nToby Williams: I don't think so. I mean I think really pleased with the execution that we saw from the go-to-market teams in the quarter, and certainly a big lift from both our implementation and service teams. But I think that was the main driver of the performance in the quarter from a revenue standpoint versus anything that we would have seen specifically from a competitive landscape perspective.\nKevin McVeigh: And then it sounds like the fundamentals are obviously still really, really strong. But any of the client -- I don't know if it's caution or just kind of initial change at the margin. Is that any particular segment? Or is it across more mid- to down market as opposed to up? Any thoughts around that?\nSteve Beauchamp: Yes. I think as Toby said, I think we would put this in the qualitative bucket. As we talk to kind of the sales reps and we're looking for some decisions, they would have examples here and there where people are -- based on uncertainty in the overall macro market, it's been sometimes a little bit harder to get decision. It's a fairly recent comment. You obviously don't see any of that in our results, and we feel pretty confident that is not going to impact our next quarter. But I think it's just natural with, I think, some of the uncertainty in the market that you would hear that. But we certainly don't think that, that has any impact to the results so far or the guidance that we gave.\nKevin McVeigh: Thank you.\nOperator: Thank you. Our next question comes from the line of George Kurosawa with Citi. Your line is open.\nGeorge Kurosawa: Hey, thanks for taking the question, this is -- I'm on for Steve Enders. Just wanted to kind of circle back on that last comment about some of the cautious tone from customers being more qualitative at this point. I mean does that kind of hold true across the metrics that you guys are looking at? I'm thinking about maybe some more forward-looking indicators like top of funnel. Have you seen any indications of incremental softness in April in any of those type of indicators?\nSteve Beauchamp: No, we really have not. I think it's really a qualitative comment that certainly might be isolated, but it's one that we watch. And I think it's, I think, prudent for us to at least mention. But we feel pretty good about the momentum that we've got in the business even if we look at the pipeline from top of funnel all the way through.\nGeorge Kurosawa: Okay, that's helpful. And then you guys called out some relative strength in the broker channel. Maybe you could just talk through kind of the investments and initiatives you have there. It sounds like you're leaning into that space. So just anything where you guys are putting dollars to work?\nToby Williams: Yes, I think you see a lot of consistency in our approach there. So probably no call-out in the moment. I think the consistency in our approach has been one of adding value to brokers by being a great technology partner to them, one that doesn't compete with them for their insurance business. And I think you see a steady set of investments from us over time that are focused on building those relationships and making sure that we stand by them and support them in partnership and continuing to invest in the technology that adds value to them and to their clients.\nGeorge Kurosawa: Great. Thanks for taking questions.\nOperator: Thank you. Our next question comes from the line of Jake Roberge with William Blair. Your line is open.\nJake Roberge: Yes. Thanks for taking the questions and congrats on the great results. With this being the largest recurring revenue beat of the year in Q3, could you talk about what drove even that incremental outperformance this quarter? Was that more related to some of the broker channel comments that you've been making or maybe the better-than-expected uptake of Airbase? Would love to just kind of flesh out what drove the even higher upside this quarter.\nToby Williams: Yes, I mean I think building off some of the comments that we've mentioned so far, I mean, I think we saw really strong execution across the business. And I think that started with coming into the year with a fair amount of momentum from a go-to-market perspective. I think the sales team did a great job in selling season. I think you saw really strong performance from our ops teams in terms of getting new business started in January and supporting our clients in the busiest time of their years from a December, January perspective. And I think that all came together to produce what we saw in the quarter, which again, I think we feel really good about in terms of how we're executing across the business.\nJake Roberge: Okay, that's helpful. And then it sounds like things have been going fairly well for Airbase thus far. I know you're still largely selling that on a stand-alone basis. But for some of the cross-sell logos that you've already landed, could you talk about what's working well, either from a go-to-market playbook perspective or just from a customer profile that it may be resonating with? That would be helpful. Thanks.\nSteve Beauchamp: Yes, sure. So, I think there's various parts to the value proposition that resonate. So, there is this opportunity for them to manage their spend, provide the rules and automation so that all of that spend can be managed. And there's an ROI on that, right? They can manage that spend down. I think there's also efficiencies that can be gained in terms of closing their books, integrating into their general ledger. We integrate a lot with general ledger from a payroll perspective, so this is obviously a different type of transaction. But that has also really been valuable. And then there's an employee experience component to it, which is virtual cards and card payment and being able to make sure that that's super easy and easy for them to then create expense reports. And so I think those are probably maybe the three highlights that I would surface when we got feedback from our sales team who are having these conversations with the customers. And I think in many cases, all of those value propositions get even better as we integrate the platforms.\nJake Roberge: Very helpful. Thanks for taking the questions and congrats on the great results.\nOperator: Thank you. Our next question comes from the line of Jason Celino with KeyBanc Capital Markets. Your line is open.\nJason Celino: Perfect. Thanks for fitting me in. Maybe just on the workforce levels. It sounds like it was up a touch in the quarter, and you're seeing stability in the base and seasonal hiring. Maybe can you just remind us what the expectation is for workforce levels contemplated in the Q4 guide?\nRyan Glenn: Yes. So, consistent approach with how we've approached guidance in the first three quarters, which is flat workforce levels in Q4. And I think as we've said, for the first nine months, if that were to turn incrementally positive, then that would be a touch of upside. But we have assumed flat workforce levels and I think feel good about that assumption and feel good about where the base is from workforce levels through the time of the call.\nJason Celino: Okay. Thanks Ryan. And then I acknowledge it's probably premature given the backdrop, but when I look at your implied Q4 recurring guide and if we strip out Airbase, it implies an exit of like 10% organic for recurring. Is that a good place to start as we think about next year? Or is it still just too hard to say?\nRyan Glenn: Yes, still early. So, on next earnings call, we'll obviously give formal guidance for Q1 of 2026 and full year. But I think as we've talked about in prior years, that's, at this point, a reasonable proxy to potentially think about how next year may set up. Obviously, we have a different level of prudence when you think about what an annual guide might look like versus a near-term quarter. But I think similar to how we played out this year, we will take all those data points into account over the next handful months and provide you more detail on the Q4 call.\nJason Celino: Awesome. Thank you.\nOperator: Thank you. Our next question comes from the line of Alex Zukin with Wolfe Research. Your line is open.\nUnidentified Analyst: Hey, this is Jason on for Alex. Thanks for taking the questions. So I want to touch on the pricing dynamics a little bit. And how are you approaching the integration of CFO office products into the broader platform from a pricing perspective given the different pricing models involved? And how confident do you feel about your current pricing structure against competitive offerings and potentially market uncertainties around the macro?\nSteve Beauchamp: Sure. So, I think just overall pricing, the market is competitive, certainly. It has been for a long time. I wouldn't call it any change to that competitive environment, and we haven't seen anything abnormal from a pricing perspective. And so we feel good about the price point and the value that we're offering to customers. And I would call it no change there. I think the reason that we mentioned this in the prepared remarks is, in Airbase, those products are definitely priced differently than HCM products. So, our goal is to replicate a competitive pricing model when we approach Office of the CFO, just like our competitors would have, versus trying to force-fit something into an HCM pricing model. We are already doing that. It's in market that is resonating pretty well. And then as we integrate the platform, you would just end up with HCM pricing that would be by module on a per employee per month basis, and then potentially a different pricing model depending on the product set in the Office of the CFO is something that we feel fairly comfortable being able to manage and already have had these conversations with customers because you have different bio personas, and it's the way they expect it to be priced. It has gone relatively smooth.\nUnidentified Analyst: Thanks. That's very helpful. And one quick follow-up on the sales rep capacity. Could you update us on the sales rep hiring progress? Have you planned incremental hiring for the selling season? And how is the overall sales productivity trending comparing to maybe 90 days ago? Thanks.\nToby Williams: Yes. We came into this fiscal year with about 8% rep headcount growth. And I think our focus at the time that we described was coming in feeling good about the new hire class that we had in and really believing that we had an opportunity to drive efficiency and productivity across the sales team. I think that's what we've been able to deliver so far throughout the course of the fiscal year. And I think our general viewpoint would be very similar as a starting point, is we're still finalizing the plans of how we would go into fiscal 2026. But I wouldn't call out any major change in terms of how we're thinking about that approach.\nOperator: Thank you. Our next question comes from the line of Allan Verkhovski with Scotiabank. Your line is open.\nAllan Verkhovski: Hey guys. Congrats on the strong quarter here. I wanted to just ask a quick follow-up to Jason's question about growth rates on a go-forward basis. Are you looking to have the same level of beat and raise cadence in fiscal 2026 as you initially set fiscal 2025 guidance to have? And then I got a quick follow-up.\nRyan Glenn: Yes. Hey Allan, I think the way -- we're pleased with how fiscal 2025 has played out. Obviously, as we've talked about through the now 3 earnings calls of this fiscal year, we've had a lot of sales momentum overperformance from that team. And you've seen that result in upwards of $50 million increase to recurring revenue guidance from what we provided today versus August. Obviously, a piece of that is Airbase, but the majority of that is going to be overperformance in the sales team. So, wouldn't necessarily start a fiscal year expecting that level of overperformance. But if you step back and think about guidance philosophy, yes, we would expect to have a very similar cadence next fiscal year. As I mentioned on my earlier comment, you have more visibility to the near-term quarter, so that one may result in slightly higher guidance. And then when you're thinking about guiding 12 months out, you obviously have an incremental level of prudence or conservatism because of the uncertainty that comes with guiding further out. So we, again, we'll take all those into account and provide more detail on the next call.\nAllan Verkhovski: Perfect. That's helpful. And then on Airbase, you previously mentioned about two-thirds of the $22 million fiscal 2025 recurring revenue guide increase was attributed to Airbase. So, about $15 million. Is that still an expectation for Airbase revenue this year? And maybe can you just opine on what kind of outperformance you've seen this year relative to that expectation, if there has been any? Thank you.\nRyan Glenn: Sure. So, I don't think we provided a specific dollar amount for Airbase. I think we've characterized it as roughly 1% of revenue this year. And I would continue to believe it would be in that range. So feel good about the progress as we talked about throughout this call, but yes, still roughly 1% of revenue for the year.\nAllan Verkhovski: Awesome. Congrats guys. Thanks.\nOperator: Thank you. Our next question comes from the line of Zachary Gunn with FT Partners. Your line is open.\nZachary Gunn: Hey there. Thanks for taking my question. I also just wanted to ask on Airbase here quickly. I appreciate it's a great product, a large opportunity. I just want to understand what gives you the confidence in competing against likes of large players, Brex, Ramp? American Express also just made a big acquisition in the space. So just trying to understand what gives Airbase the right to win in the space? Thanks.\nSteve Beauchamp: Sure. Yes. So, I think it's, on a stand-alone basis, a very strong product set that has gotten good feedback in the marketplace. It's definitely targeted at much more of our average-sized customer. So if you think of our average-size customer being over 100 employees, and obviously, we have different segments. But the overlay of their customer base really is at the core of our market. And they've got the feature sets associated with that customer size in terms of things that CFOs would be looking for, efficiencies that it drives, some of the rules that can be more complex. So we feel really good about that. I think the other thing is there's an employee experience element to this. So employees are using the cards. They're accessing this information. They're providing -- they're submitting for approvals. More and more spend is being driven at an employee level. We have a ton of utilization on our mobile app already for core things like either punching in, checking your check, PTO. So when you can really mirror this employee experience with all the features that exist with Airbase and then be able to, on the back end, give them that single pane of glass from a reporting perspective, we think that actually ends up being a pretty unique value proposition as we complete all the phases of integration, and we start to sell it more as a unified platform.\nOperator: Thank you. Ladies and gentlemen, I am showing no further questions in the queue. I would now like to turn the call back to management for closing remarks.\nToby Williams: We just want to say thanks to everybody for your interest in Paylocity. Thanks for joining the call. And I wanted to say a special thank you to all of our employees for all of their efforts to take care of our clients during the busiest time of the year, and thank you for supporting a great Q3. Have a good night.\nOperator: Ladies and gentlemen, that concludes today's conference call. Thank you for your participation. You may now disconnect."
  }
]