[
  {
    "symbol": "PCTY",
    "period": "Q4",
    "year": 2025,
    "date": "2025-08-06",
    "content": "Operator: Good day, and thank you for standing by. Welcome to the Paylocity Holding Corporation Fourth Quarter 2025 Fiscal Year Results Conference Call. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ryan Glenn, Chief Financial Officer. Please go ahead.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the fourth quarter and fiscal year '25, which ended on June 30, 2025. I'm Ryan Glenn, Chief Financial Officer. And joining me on the call today are Steve Beauchamp, Executive Chairman; and Toby Williams, President and CEO of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we are unable to reconcile any forward-looking non-GAAP financial measure to their directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, we will be attending the KeyBanc Technology Leadership Forum and the Stifel Technology Executive Summit. Please let me know if you'd like to schedule time with us at either of these events. With that, let me turn the call over to Steve.\nSteven R. Beauchamp: Thanks, Ryan, and thanks to all of you for joining us on our fourth quarter and fiscal '25 earnings call. Our differentiated value proposition of providing the most modern platform in the industry continues to resonate in the marketplace and helped drive recurring revenue growth of 14% and total revenue growth of 12% in Q4. For fiscal '25, recurring revenue growth grew 15% and total revenue grew 14% as we ended the year with $1.6 billion of revenue. Our sustained multiyear investment in R&D has resulted in continued product differentiation and a significant expansion of our product suite, which has helped drive durable recurring revenue growth and continued expansion of our average revenue per client. Most recently, we announced the launch of Paylocity for Finance, expanding our market-leading modern workforce platform for HCM into the office of the CFO and bringing both finance and HR together through a unified system grounded in the employee record. With the addition of Airbase and our previously launched headcount planning solution, Paylocity for Finance delivers a comprehensive suite of tools that connects day-to-day spend management with strategic workforce planning, reflecting our vision to equip leaders with modern AI-powered solutions that bridge the gap between HR and finance on our single unified platform. Going forward, our clients can now manage both payroll and non-payroll spend in a single platform and eliminate disconnected systems, manual processes and approval bottlenecks. Product expansion has been a key part of Paylocity's growth algorithm for over a decade, and we believe Paylocity for Finance, together with the continued expansion of our HCM portfolio, will drive further growth over time in our average revenue per client, which reached just over $35,300 in fiscal '25 compared to $32,800 in fiscal '24, an increase of approximately 8%. We believe Paylocity for Finance represents a significant multiyear opportunity for both new clients and to cross sell back into our 41,650 existing client base, which grew 7% from fiscal '24. Our commitment to product development also continues to be recognized in the market, with Paylocity recently winning a TrustRadius top-rated award in HR management software for the third year in a row. I would now like to pass the call to Toby to provide further color on the quarter.\nToby J. Williams: Thanks, Steve. In Q4 and fiscal '25, our differentiated position in the market was reflected in solid sales execution, and we have continued investing in our go-to-market functions to carry this momentum into fiscal '26 across sales, marketing and channel referrals. Coming into fiscal '26, we expanded our sales force by 8% to 952 sales reps, and we'll be focused on continuing to drive productivity and efficiency across our teams. Consistent with prior years, we are pleased to be fully staffed to begin fiscal '26, and we continue to successfully attract the best sales talent in the industry, positioning us well for durable recurring revenue growth. We also saw another strong year of channel performance, primarily from benefit brokers who once again represented more than 25% of new business in fiscal '25. The sustained success of our broker channel continues to be driven by our modern platform, third-party integration and API capabilities and because we do not compete against our broker partners by selling insurance products. We remain committed to investing in and supporting the broker channel with the goal of continuing to deliver real value and true partnership in support of our referring brokers and their clients. Revenue retention also remained consistent at greater than 92% in fiscal '25, and we remain committed to investing in our operations teams to deliver world-class service to our clients. As Steve highlighted, we are excited about the opportunity with the recent launch of Paylocity for Finance, which represents the natural evolution of our mission to simplify work through innovation and empowers finance teams with AI-powered automated solutions seamlessly integrated into the Paylocity platform, including headcount planning, expense management, AP automation, corporate cards and guided procurement. By unifying data and connecting critical workflows, we're delivering enhanced visibility, improved efficiency and an exceptional user experience that drives increased value across HR and finance teams and their employees. Employees will now be able to submit expense reports and spend requests in the same system they already use for payroll, time tracking and benefits, while managers will benefit from a single centralized task list for all approvals, whether for time off, expenses or purchases. This unified experience minimizes friction, accelerates financial processes, provides better controls and ultimately drives increased value from a single platform. For example, an early adopter has consistently struggled to manage approvals and spend requests across multiple disconnected systems, leading to bottlenecks and delayed decisions, sometimes taking up to 45 days to complete a purchase. After implementing Paylocity for Finance, including AP automation and guided procurement, the client was able to streamline their approval cycle by eliminating numerous manual steps and integrating seamlessly with their existing critical systems, driving greater efficiency and generating time savings for their finance teams. With features like invoice matching, they now have full confidence that incoming invoices align with preapproved spend, ensuring every purchase is backed by clear accountability and real-time visibility. Our strong culture, industry-leading software innovation and exceptional sales and operational execution would not be possible without the dedication and commitment of our employees. As we close out a very strong fiscal '25, I'd like to thank all of our people and teams for a fantastic year. The strong culture at Paylocity also continues to be recognized externally as we recently were named by Newsweek as one of America's Greatest Workplaces for Gen Z, listed by Time as one of America's Best Midsized Companies and included in the Association for Talent Development's 2025 Best Award Winners list. I would now like to pass the call to Ryan to review the financial results in greater detail and provide an initial outlook on fiscal '26.\nRyan Glenn: Thanks, Toby. Recurring revenue for the fourth quarter was $369.9 million, an increase of 14%, with total revenue up 12% from the same period last year. As Toby noted, our sales team had another solid quarter, and we were pleased to come in $10.2 million above the top end of our revenue guidance, with the majority of our Q4 revenue beat coming from recurring and other revenue. Adjusted EBITDA for the fourth quarter was $130.7 million or 32.6% margin and exceeded the top end of our guidance by $8 million. For fiscal '25, adjusted EBITDA was $583 million or 36.5% margin and an increase of 15% on a dollar basis from fiscal '24, resulting in leverage of 50 basis points. Excluding the impact of interest income on funds held for clients, adjusted EBITDA margin for fiscal '25 was 31.2%, reflecting operating leverage of 120 basis points versus fiscal '24 and approximately 220 basis points of organic operating leverage when excluding the impact of Airbase. Additionally, we continue to show strong growth on free cash flow with fiscal '25 free cash flow margin of 21.5%, representing an increase of 12% on a dollar basis from fiscal '24 despite facing material headwinds as we transition to full cash taxpayer status, the impact of lower interest rates and the headwinds from the Airbase acquisition. Excluding the impact of interest income on client-held funds, we expanded free cash flow by approximately 19% in fiscal '25, representing margin expansion of 50 basis points. We continue to have confidence in our ability to further expand free cash flow on a go-forward basis. We continue to make significant investments in research and development. And to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a combined non-GAAP basis, total R&D investments were 14.3% of revenue in fiscal '25. And on a dollar basis, our year-over-year investment in total R&D increased by 14% when compared to fiscal '24. We continue to believe our investments in R&D provide us with valuable product differentiation and the ability to drive future growth as we deliver the most modern platform in the industry. On a non-GAAP basis, sales and marketing expenses were 23.1% of revenue in the fourth quarter and 21% of revenue in fiscal '25. On a non-GAAP basis, G&A costs were 9.7% of revenue in the fourth quarter. And on a full year basis, G&A costs were 9.3% of revenue, and we remain focused on continuing to drive leverage in our G&A expenses on an annual basis. Briefly covering our GAAP results. For Q4, gross profit was $271.9 million, operating income was $66.2 million and net income was $48.6 million. For the full year, gross profit was $1.1 billion, operating income was $304 million and net income was $227.1 million. In regard to funds held for clients and interest income, our average daily balance of client funds was $3.1 billion in Q4 and $3 billion for fiscal '25. We are estimating the average daily balance will be approximately $2.85 billion in Q1 of fiscal '26 with an average annual yield of approximately 390 basis points, representing approximately $27.5 million of interest income in Q1. On a full year basis, we are estimating the average daily balance will be $3.15 billion in fiscal '26 with an average yield of approximately 350 basis points, representing approximately $110 million of interest income. In regard to interest rates, our guidance assumes 4 25 basis point rate cuts during fiscal '26 with a cut in September, December, March and April reflected in our guidance. Additionally, given the confidence we have in our business and our strong cash flows, we repurchased approximately 315,000 shares of common stock at an average price of $178.21 per share for $56 million in aggregate repurchases during Q4. In total for fiscal '25, we repurchased approximately 800,000 shares of common stock at an average price of $190.16 per share for roughly $150 million in aggregate repurchases. In July, our Board increased our share repurchase authorization by an additional $500 million. In addition to the increased authorization, as of June 30, we had approximately $200 million remaining under the existing repurchase program and anticipate continuing to execute against the repurchase program going forward. In fiscal '25, we also drove 140 basis points of leverage in stock-based comp expense and achieved our target of less than 10% of revenue as stock-based comp expense was down year-over-year on a dollar basis for the second consecutive year. In regards to the balance sheet, we ended the fiscal year with $398.1 million in cash, cash equivalents and invested corporate cash and $162.5 million outstanding on our credit facility related to the Airbase acquisition, with approximately $81 million repaid on our outstanding balance in Q4. Finally, I'd like to provide our guidance for Q1 and full fiscal year '26, which includes the impact of 100 basis point interest rate cuts in fiscal '26 and flat workforce levels in fiscal '26 versus fiscal '25. For the first quarter of fiscal '26, recurring and other revenue is expected to be in the range of $370 million to $375 million or approximately 12% growth over first quarter fiscal '25 recurring and other revenue. And total revenue is expected to be in the range of $397.5 million to $402.5 million or approximately 10% growth over first quarter fiscal '25 total revenue. Adjusted EBITDA is expected to be in the range of $131 million to $135 million and adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $103.5 million to $107.5 million. And for fiscal '26, recurring and other revenue is expected to be in the range of $1.597 billion to $1.612 billion or approximately 9% growth over fiscal '25 recurring and other revenue. Total revenue is expected to be in the range of $1.707 billion to $1.722 billion or approximately 8% growth over fiscal '25. Adjusted EBITDA is expected to be in the range of $608.5 million to $618.5 million and adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $498.5 million to $508.5 million, representing approximately 20 basis points of leverage at the midpoint. In conclusion, as we kick off fiscal '26, we remain confident in our differentiated value proposition, go-to-market strategy, operational strength and product road map and believe our predictable business model and execution, durable recurring revenue growth and prudent approach to guidance sets us up for a strong fiscal '26. A combination of industry-leading recurring revenue growth and free cash flow margin, a long track record of strong and consistent revenue retention, expanding both our client base and average revenue per client, we have a high level of confidence in our ability to continue to drive sustainable revenue growth and increase margin on a multiyear basis as we execute against our goal of surpassing $2 billion in total revenue. Operator, we're now ready for questions.\nOperator: [Operator Instructions] And our first question will be coming from Scott Berg of Needham & Company.\nScott Randolph Berg: Really nice quarter. A couple of them, I don't know who wants to take this between probably Steve and Toby, but how do we think about the demand environment right now? I kind of look at your results and ARPU growth remained really strong in the year. Customer growth is normalizing towards mainly pre-pandemic level, maybe a little bit elevated from that, but a really consistent number right now. Is this how we should view the environment that's kind of baked in your guidance into '26? Are there any puts and takes with the ability to maybe move that customer acquisition kind of number maybe up or down in the year?\nToby J. Williams: Thanks for the question, Scott. So I mean, I think relative to the demand environment, I think we saw a fairly stable demand environment across the course of the year, and that's what we continue to see in Q4 as well. And to your comment -- or part of your question, I think we saw relative stability in the year-to-year growth in units through '25 and then the same thing with respect to ARPU with ARPU growth and unit growth being fairly evenly distributed through the course of '25. And so ultimately, with all those things, really happy with the execution from a go-to-market and from a sales team perspective throughout the course of '25, which is where I think you saw some of the overage come from.\nScott Randolph Berg: Understood. And then, Ryan, if I look at the financials, pretty much in line with my expectations from what we heard in the quarter, but your sales and marketing expense had a kind of a significant jump quarter-over-quarter. Maybe kind of help us understand what the difference there is. I don't know if it's bonus payments or some new investments in some programs here going into this year, but any color there would be helpful.\nRyan Glenn: Yes, Scott, I think it's your typical Q4 year-end timing where you do have a little bit of movement of bonus payments and some additional programs that we may try to get into the end of the year. Obviously, as Toby mentioned, we came into the year fully staffed as well. So a fair amount of hiring in the fourth quarter as well. So it's really just timing within the year. I would say, as we look at the sales and marketing spend over the course of '25 and headed into '26, we came in consistent with expectations.\nOperator: And our next question will be coming from Daniel Jester of BMO Capital Markets.\nDaniel William Jester: Maybe we'll go with Paylocity for Finance. I appreciate all the context there. Does this mean that the integration of Airbase is basically complete? Or is there more work to be done on that part? So that's part number one. And then number two is, are you shifting any more resource in your sales organization to attack sort of the back to the base opportunity here. It seems pretty large relative to maybe just adding another module or 2 on the HR side.\nSteven R. Beauchamp: Sure. I think as we had mentioned after we had made that acquisition that we would anticipate doing the integration in phases. We certainly put out the press release indicating we've completed the first phase of that integration, which is certainly probably the most meaningful step. However, we do view opportunity to continue to integrate that platform over time. And we're excited about that opportunity and getting user feedback and continue to look for the leverage that we believe we can drive from an employee record perspective across HCM and finance. And so product is in market, I would say, a fully integrated version with new opportunities coming, and we'll probably see enhancements to that realistically every quarter is our goal. I think on the second point, with our go-to-market motion, we are just in the process with that product just being released, getting our field sales organization up to speed and knowledgeable with the integrated product offering such that they can refer an inside sales team of experts to then be able to take those opportunities across the finish line. And we've also got that inside sales team of experts looking at back to the base opportunities. And so all that has just been launched with the press release that you saw from an integration perspective.\nDaniel William Jester: That's really helpful. And maybe, Ryan, I know you don't guide to free cash flow, but I'd appreciate it. Are there any puts and takes as we think about the free cash flow outlook for fiscal '26? Obviously, float is going to change. Maybe there's some R&D tax credits we should consider. But anything you'd share on that would be very helpful.\nRyan Glenn: Yes, Dan, I think to your point, as I said in my prepared remarks, really pleased with where we've taken profitability as a whole, and that includes both adjusted EBITDA and free cash flow. I think we've expanded free cash flow margin by, call it, 400 basis points just over the last 2 years and continue to have a lot of confidence that we'll be able to do so in '26 and on a go-forward basis. I think probably the only note I would make is you do have the likelihood of some tailwind relative to the new tax legislation. We're still working through what that impact would look like specifically, but a high likelihood that, that will reduce our federal taxes in fiscal '26, and that will have a knock-on effect or a tailwind to free cash flow. So we'll be able to provide more details as we get more clarity, but that's probably the one item I would note. We're now full cash taxpayer status outside of that new legislation and have a lot of confidence that, that free cash flow margin and EBITDA will continue to move forward in '26 and beyond.\nOperator: And our next question will be coming from Mark Marcon of Baird.\nMark Steven Marcon: Great quarter. So two questions. One, just on Paylocity for Finance. Can you tell us a little bit about -- I know it's extremely early, but what sort of expectations are you kind of building in for that? And can you talk a little bit about the pricing, the types of clients that would probably be the most likely to adopt the experiences of the clients that you've talked to thus far. I remember during our conference, Toby was very optimistic about how things were going there.\nSteven R. Beauchamp: Yes. So I think early on, we are getting good feedback from customers. They see the value in the integrated platform, the ability to leverage the employee data that we have so that it's easy to request spend, easy to put in rules around spend, make sure that, that approval process happens relatively quickly. All of that leads to a much faster close process on the back end. And so I think the integration is getting us a really good feedback. We're also very pleased with the stand-alone product capabilities that we purchased and our ability to be able to continue to move those forward and enhance those based off client feedback. So I think that has gone pretty well. As you mentioned, we are still early. We are setting up our first clients on the integrated offering kind of as we speak. And so we're excited about that opportunity. But I think what I would say is one of the questions we get a lot of is, how is that sales process going to translate from a decision-maker capability. That's another area that I would say we're pretty happy with. The CFO is definitely involved in a payroll and HR purchase, although sometimes they're not the primary decision-maker, but we have certainly had opportunities, either via referrals or back-to-base conversations, to have pretty easy access into that conversation from a CFO perspective. And they've got appreciation for what the integration offers as well as the opportunity to get a singular support structure as well. And so early on, good success. I would say our expectations are that it takes a little bit longer than maybe an additional module from a sales process because it is a bigger purchase price, as you mentioned. So it might take us a little bit longer to get to the same penetration rates as additional HCM modules, but we feel confident that our over 40,000 customers represent a great opportunity to sell back into.\nMark Steven Marcon: I mean, do you think, Steve, that we can still get to somewhere in the 15% to 25% penetration rate over time? And can you remind us of how you're pricing this solution? Because obviously, it's going to end up adding a lot more than the typical $1 to $2 per month.\nSteven R. Beauchamp: That's correct. So I think over time, we've always talked about modules getting into that 10% to 20% penetration rate. That would still be the goal with this. As I mentioned, it may take a little bit longer. However, the revenue per client is much higher. And so it can certainly be more impactful than most of our HCM modules that we've launched. It will also provide us additional capabilities from an expense management perspective. So we had an expense management solution embedded in our suite. I would call that a more basic version. They have much more advanced capabilities. And so I think that represents an opportunity. That is priced generally on a PEPM basis. And the rest of the modules are really per employee per user.\nOperator: And one moment for our next question, which will be coming from Terry Tillman of Truist Securities.\nDominique Calampiano Manansala: This is Dominique Manansala on for Terry. So just looking at AI innovations, like the policy answering assistant that you all mentioned last quarter, are there any new AI-driven features or client adoption trends you want to call out in the quarter? And how does adoption rates or client feedback shaping your view on AI as a differentiator now as you're heading into fiscal year '26?\nSteven R. Beauchamp: That's a great question. We definitely see AI coming up in the conversation with prospects at an increased rate. At the same time, we are seeing our current customers take advantage of the embedded AI capabilities across various modules in the suite. And we've got certainly a long list of opportunities that we're working on to be able to continue to embed AI. I think we talked a little bit about, and you mentioned kind of the chatbot interactions, and how that sources data both from client data as well as our knowledge management and then our ability to add third-party data to be able to answer a wider variety of questions. We see that growing as we continue to grow the data set and the capabilities within that chat interaction. So we've been really happy with the innovation we've put into the platform so far from an AR perspective, and we're excited about what the road map looks like.\nOperator: And our next question will be coming from Brian Peterson of Raymond James.\nJohnathan M. McCary: This is Johnathan McCary on for Brian this evening. Just one for me here. So I wanted to ask on the thinking on M&A. Now that Airbase is in the early stages of being integrated and launched, I'm curious, how does that impact your appetite for M&A? And are there some strategic product areas you'd point us to that you find particularly interesting at the moment from here?\nToby J. Williams: Yes. Thanks, John. I mean I think we are, first of all, really, I think, happy with our ability to get the Airbase deal done, certainly an area of strategic interest for us. And to be able to get the integration accomplished with the success that we have and then the launch just recently of Paylocity for Finance and so I think overall, have been very happy with our ability over time, not just to do that deal, but to do a few others that have been strategic to us that have really added to the product set and helped drive our differentiation over time and drive more value to clients. So I think the strategy around M&A has been fairly consistent and will continue to be in terms of being open to areas where we can accelerate the road map through M&A. I think the focus from our teams generally is to be able to continue to build out products that drive more value for clients and that address key needs. And when we can augment that from an M&A standpoint in areas that will accelerate the product road map, I think those are the things that are interesting to us. But I think it's a fairly high bar from the standpoint of really being focused on the ability to take any acquired product and integrate it so tightly into the platform that a user can't tell whether you built it or bought it. And I think that's what we're doing with Airbase, which is one of the reasons I think we're so excited about the experience that we're creating from that integrated product set.\nOperator: Our next question will be coming from Jared Levine of TD Cowen.\nJared Marshall Levine: In terms of your AI investments for internal operations, what stage would you say you're at currently? And any sense on how long until you could potentially be in a net benefit position from AI?\nSteven R. Beauchamp: Well, I think one of the things that we've called out in the past is that there is a tremendous amount of opportunity from AI across the business. And so whether that's in our operation, whether that's in our product development team and building new features for our customers or really a lot of our teams that support individuals talking to clients or even in G&A. And so I think we're still in the relatively early innings. I also think this happens gradually over time. And so we look at this as an opportunity to continue to invest in that category. That becomes one of the ways that we can drive both a better client experience, but also margin enhancements over time. And so as we continue to identify use cases, make investments and realize the benefits from it, that becomes part of our long- term model and the way that we think about driving efficiency in the business.\nJared Marshall Levine: Got it. And then, Ryan, in terms of retention, directionally, can you give us some color on if that was up or down here for FY '25, including any differences on controllable versus uncontrollable churn?\nRyan Glenn: Yes. Nothing I'd particularly note. I think, as we said in the prepared remarks, at 92%-plus again in fiscal '25, so really pleased with those results. And I think when you look at the results we put up on recurring revenue in fiscal '25, obviously, strong execution from a sales standpoint, but really strong execution from an operational standpoint. And I think that goes both to our implementation teams as well as our service team. So really pleased with where we are from retention, always a key focal point for us. But outside of that, nothing I would call out that would have materially changed in '25.\nOperator: And our next question will be coming from Patrick Walraven of Citizens Bank.\nKincaid LaCorte: This is Kincaid on for Pat. I just had 2 questions about incentives. First off, if I'm a Paylocity sales rep, what am I making the most money selling? And number two, with the launch of Paylocity for finance, is there going to be a shift in those incentives?\nSteven R. Beauchamp: Yes. So I think our Paylocity sales reps are really focused on new business and new recurring revenue that get added to the platform. And so I don't think those incentives are changed at all. We also have a system where if they're going to refer an expert, they're going to be able to collect some part of that commission from that referral. So if I'm a sales rep, I see a great opportunity. I've created a relationship with the Head of HR as well as the CFO. I realize they could benefit from some of the Airbase modules. I can refer them over to an expert. We can do that all as part of one sales process. We could actually go back to them after they've already started or start them first from a finance perspective. And so the incentives are absolutely there. And as we mentioned earlier, it's fairly robust from an annual recurring revenue, which creates even a higher incentive for our field sales force of over 900 people to be able to refer our team of experts in.\nOperator: And our next question will be coming from Raimo Lenschow of Barclays.\nRaimo Lenschow: A quick question on the Paylocity for Finance as well. Obviously, now you can have like a joint offering. How does it change the competitive selling motion that you have there? And does it change your competitive field? Does it increase the win rate? What are the early experiences there?\nToby J. Williams: Yes. Thanks, Raimo. I mean I think we're still early for sure. But I think there's incremental value that we're delivering to clients from the ability to have a finance solution on the same platform. And that's a different strategy that I think you see with the vast majority of our competitors in the HCM space. So we definitely view it as a point of differentiation. And I think to Steve's earlier comments, yes, we're very early, but I think we're really pleased with what we've been able to do in terms of the integration of the Airbase products and solutions into a single platform that is real value, that is significant value prop for clients, both new clients coming onto our platform and back into the client base. So I think we're optimistic, early days, but optimistic with the traction we'll be able to get with that value prop.\nRaimo Lenschow: And does it kind of bring you into certain verticals because like finance is obviously not finance in every single vertical. Is there something that kind of then kind of gets you into some other verticals?\nToby J. Williams: Well, I mean, I think the offering being on one platform gives us the ability to go across verticals the same way that we do with the payroll and HCM parts of our suite. So I think part of the attraction was this was another horizontally interesting area that we think we can also take into different verticals the same way that we have Paylocity for Payroll and HDN. So I think it's a great fit for the platform. And I think going back to Steve's comments, early days, but I think the early traction that we're seeing is positive. I think we're pretty excited about it.\nOperator: Our next question will be coming from Siti Panigrahi of Mizuho.\nSitikantha Panigrahi: I just want to ask about the Airbase. It's been more than a year. Wondering what kind of feedback you have got from customers, at least those customers who are using Paylocity, customers using Airbase, what sort of revenue uplift you are seeing? And one clarification in terms of sales rep growth, 8%. Is this mostly the Paylocity sales or the combined one?\nToby J. Williams: Sure. On the first part, it's been 10 months since we made the acquisition. And we're just now in the last couple of weeks, launching Paylocity for Finance. And so we're really just now at a point where we have the Airbase products integrated into the Paylocity platform. And so I think we're really at the point now where we can be, I think, more focused and more aggressive from a sales team and from a go-to-market standpoint. Now that we really have, I think, a key part of the value prop, we're able to deliver again a key part of the value prop in terms of the whole set of solutions on a single platform, which is, I think, really important to clients and prospects. So we're in the early days, but I think the feedback so far from a just product perspective has been very strong. That was part of our attraction to the Airbase business was the strength of the product that has been well regarded in things like G2. So I think our view was we could take a really strong product, create significant integration on a single platform and bring that to market and that, that would be valuable to clients. And I think that's what we're seeing, albeit in the early days of launch.\nSteven R. Beauchamp: I think your question on headcount growth, that is total headcount growth across all of our sales forces, including Airbase, which, as you know, when we bought that was relatively small. We're excited about the opportunity in front of us, but the bulk of those additions are really in our HCM sales forces.\nOperator: And our next question will be coming from Alex Zukin of Wolfe Research.\nAleksandr J. Zukin: I guess maybe sticking with the theme of Airbase, any features that you're seeing drive the most kind of interest and intense cross- sell conversations? Is it headcount planning, expense management, corporate card? And maybe just comment on the gross margin tailwinds potentially around kind of as the mix evolves with those deals relative to the core? And then I've got a quick follow-up.\nSteven R. Beauchamp: Yes. So I think if you look at module adoption, expense management probably has the greatest adoption. And in some cases, that ends up being the entry product, although we absolutely see full suite purchases because once you have all your employees using that and making approvals, you can then really take advantage of that utilization on that single platform to drive spend management, more complex rules, all the reporting on the back end. And ultimately, if you use all of their products, we've got all the data that they spend both on people as well as on their business items. And so there's analytics on the back end that are valuable to the customers. But if I had to call one out, I think that's probably the expense management in terms of the most penetrated module they offer. Ryan, any comments?\nRyan Glenn: Yes. I guess, Alex, just to the other part of your question on gross margins. I wouldn't say that the Airbase product has materially different margin profile than the core Paylocity business. I think we will, going forward, as we did in '25, look to expand gross margin, both within Airbase as well as the core product set, and we have confidence that we'll be able to do so while still investing in the Airbase opportunity.\nAleksandr J. Zukin: Perfect. And then maybe just dimensionalize potential contribution for fiscal '26. I know in last time you guys talked about revenue contribution, it was on the order of maybe 1% for fiscal '25. Is it fair to assume something similar for fiscal '26? Or could it be a little bit above that?\nRyan Glenn: Yes. I mean I think you're still in that range. That business has grown faster than our core business. So that probably becomes a higher percentage over time, although it is still a very small portion. So I wouldn't sort of overstate that. But I think that business continues to grow at a healthy rate and will continue to increase in '26.\nOperator: And our next question will come from Jason Celino of KeyBanc Capital Markets.\nJason Vincent Celino: Just a couple of questions for Ryan, if that's okay. Looking at the recurring revenue guide for this year, I know Q1 still has some inorganic benefit, but how should we think about the shape of the rest of the decel heading into 2026?\nRyan Glenn: Sure. Yes. I think to your point, Q1 is the fourth quarter of the Airbase impact. And I think you see a little bit of that in the guide. And I think you also see the strong momentum we had to end fiscal '25. If you look at what's implied for Q2 to Q4, I think it's sort of 8% to roughly 8.5% recurring. And I think, as I said in the prepared remarks, guidance approach will likely be similar in fiscal '26, which is to say if we continue to see strong execution, we obviously have closer and better visibility into the near-term quarter, and that's typically where you see probably slightly higher revenue growth in guidance and then a level of prudence as you think about probably the back half of the year. But we feel good about the momentum, feel good about the Q1 and full year guide. And I think if we continue to execute well, hope to be able to take that number up as we go throughout '26, very similar to what we did in '25.\nJason Vincent Celino: Okay. Great. And then just following up with Dan's very first question on the OBBBA potential benefit. I know there's a difference between R&D expensing in the U.S. and international. But for you, the majority of your R&D operations are in the U.S., correct?\nRyan Glenn: The majority are, yes. We would have a small portion that would be foreign related, but the majority are going to be U.S. That's correct.\nOperator: And our next question will be coming from Jacob Roberge of William Blair.\nJacob Roberge: Congrats on the solid results. You referenced continued strength in the broker channel. I know it's still fairly early days, but have you started to see any incremental changes in that channel following just the recent M&A in the space? Or have things been fairly consistent with what you've seen in prior years?\nToby J. Williams: Yes. I mean I think to your question, Jake, we've been really happy with what we've seen in the broker channel and being able to continue to drive 25% plus of new business referred from that channel is, I think, a testament to the effort there and I think it's also a testament to the value prop that we've been able to provide to brokers over a long period of time. And I think that continued clearly through the course of '25. And I think what I'd say is our message, I think, has resonated in the market. I think it continues to. I think that continued through the course of '25 and into Q4. And so I think that continues to be strong for us. And I certainly think, to your question, our value prop that we have always stood behind, including not competing with brokers from a market standpoint, is a really important point that we've certainly leaned on and I think has continued to resonate. So I feel good about where we finished in '25 with respect to broker relationships in the broker channel. I think we're teed up for continued momentum there as we go into Q1.\nJacob Roberge: Okay. That's helpful. And then just wanted to follow up on the demand environment. I know last quarter, you called out a little bit of noise in the last week of April. Did that noise continue throughout the quarter? Or was it just a week or 2 blip? And then, Ryan, helpful commentary on your headcount and rate cut expectations in the guide, but just any sense of what you're assuming for the health of broader HR budgets when compared to prior years.\nToby J. Williams: Yes. I mean I think maybe going back to my earlier comments on the demand environment overall. I mean I think if you look back at fiscal '25 in its entirety, I think what we would say is that we saw a fairly steady and healthy demand environment. And I think that's what we continue to see in Q4. And I think that's what sits underneath our guide as we've come into Q4, developed the guide and as we look across '26, I think we're making a similar assumption relative to the demand environment. And I think our sales and go-to- market team did a great job of executing throughout the course of '25. And I think that is what allowed us to produce the results that we reported.\nRyan Glenn: Yes. I would just add, I think we feel really good about the initial guide. We took a similar approach as we did in fiscal '25. So comfortable with, I think, all assumptions across each of the variables, whether that is HR budgets, workforce levels, obviously, interest rate impact as well and feel good about where we are from a guidance standpoint. And then to Toby's point, I think we feel really good about the momentum we have exiting '25 into '26.\nOperator: And our next question will come from George Kurosawa of Citi.\nGeorge Michael Kurosawa: I'm on for Steve Enders. Just on that point about hiring activity, headcount hiring for FY '26 and maybe the flip side of that productivity, I understand FY '25, you guys are quite focused on go-to-market productivity. Maybe just talk about what seems to have been working there and how you're thinking about improving that metric into FY '26?\nToby J. Williams: Yes. I mean I think coming into fiscal '25, we increased our sales headcount by right around 8%. And the goal coming into '25 was to be able to continue to drive productivity. And I think that's what we saw throughout the course of the year, quarter-to-quarter and then looking back on the full fiscal year. I think we continue to have access to the best talent in the industry from a go-to-market, from a sales perspective. And that's always been the goal to be, I think, the destination in the industry for the best talent. I think that continues to be the case. And I think we're really fortunate we're able to come into fiscal '26 fully staffed again with right around 8% headcount growth again this year coming into '26. And I think looking out across the year, I think the goal and the focus will be exactly the same as it was in '25: to be able to take that 8% headcount lift and to be able to continue to drive productivity. And I think that's exactly what you saw us be able to do throughout the course of '25. So I think pretty happy overall with the setup that we think we have for '26.\nGeorge Michael Kurosawa: Okay. Great. And then just one on Paylocity for Finance. It sounds like you've alluded to it being a bit of a bigger purchase decision. Maybe if you could talk about what you've seen or what you expect in terms of trigger points for adoption. What causes someone to purchase?\nSteven R. Beauchamp: Well, I think it varies by organization. But I think the value prop, you've got people in our kind of mobile app every day using all of our products on the web. And so when we talk to a CFO and present the opportunity to be able to manage expenses, spend, cards, all in a single place with incremental rules that match the organization's policies, and then be able to -- you can lay all that data on the back end for a faster close, it's a pretty interesting value proposition that we find. Most customers are at least willing to entertain the conversation, and then it's about differentiating versus other competitive offerings that they can have. And so overall, I think it really starts with the integrated platform is the point I'm really trying to make and the value that it is from a service and implementation and how easy all that really is to use. And then we've got the finance capabilities that they're looking for with a very rich product in the Airbase capabilities. But as I said, it's probably not going to scale quite as fast as simply an HCM add-on because it's a higher price point. It's probably a bigger commitment from an organizational implementation. But early signs, we feel really good about that. We feel good about the referrals that we've gotten back to the client base as well as new prospects. And we were only a few weeks in, as Toby mentioned, into the launch. So we're going to keep making this better over time and take advantage of the opportunity.\nOperator: And our next question will be coming from Zachary Gunn of FT Partners.\nZachary G. Gunn:\nFinancial Technology Partners LP: Just one for me. As other companies have looked to build out their accounts payable products, there's always a lot of focus on the supplier side of the network as much as the customer side. And as companies like BILL have also pushed up market, they've stressed the need for building the supplier side of the network. So can you just talk a little bit about with Airbase and with the finance products, how you're addressing the kind of supplier and customer sides of the network?\nSteven R. Beauchamp: I think there's different parts of that supplier question that we do provide capabilities for. So certainly managing who the supplier is, there's a PO process that maybe a larger organization might have to be able to make sure that, that purchase is approved with that supplier, obviously, making those payments on the back end. I think the greater the payment volume that you've got, then the greater opportunity is to have that broad supplier network. And so we certainly will see that, I think, opportunity become more interesting as we scale this solution over time and we drive volume through the platform. If you look at the average customer size being roughly similar to ours around 150 employees, you probably, in general, are not necessarily highly sophisticated in terms of that supplier network. But it's an area that we're investing in and that we feel as we scale and drive volume to, will create incremental opportunity.\nOperator: And I show no further questions at this time. I would now like to turn the call back to management for closing remarks.\nToby J. Williams: Yes. I just want to thank everybody for joining. I appreciate your interest in Paylocity and I wanted to say a special thank you to all of our employees for a strong fiscal '25. Thanks, and have a good night.\nOperator: And this concludes today's conference call. Thank you for participating. You may now disconnect."
  }
]