[
  {
    "symbol": "PCTY",
    "period": "Q1",
    "year": 2025,
    "date": "2024-10-30",
    "content": "Operator: Good day, and thank you for standing by. Welcome to Paylocity Holding Corporation's First Quarter 2025 Fiscal Year Results Conference Call. At this time all participants are in a listen-only mode. [Operator Instructions] Please be advised, today's conference is being recorded. I would now like to hand the conference over to your speaker today, Ryan Glenn, Chief Financial Officer. Please go ahead.\nRyan Glenn: Good afternoon, and welcome to Paylocity's earnings results call for the first quarter of fiscal 2025, which ended on September 30, 2024. I'm Ryan Glenn, Chief Financial Officer. And joining me on the call today are Steve Beauchamp, Executive Chairman; and Toby Williams, President and CEO of Paylocity. Today, we will be discussing the results announced in our press release issued after the market closed. A webcast replay of this call will be available for the next 45 days on our website under the Investor Relations tab. Before beginning, we must caution you that today's remarks, including statements made during the question-and-answer session, contain forward-looking statements. These statements are subject to numerous important factors, risks and uncertainties, which could cause actual results to differ from the results implied by these or other forward-looking statements. Also, these statements are based solely on the present information and are subject to risks and uncertainties that can cause actual results to differ materially from those projected in the forward-looking statements. For additional information, please refer to our filings with the Securities and Exchange Commission for the risk factors contained therein and other disclosures. We do not undertake any duty to update any forward-looking statements. Also, during the course of today's call, we will refer to certain non-GAAP financial measures. We believe that non-GAAP measures are more representative of how we internally measure the business, and there is a reconciliation schedule detailing these results currently available in our press release, which is located on our website at paylocity.com under the Investor Relations tab and filed with the Securities and Exchange Commission. Please note that we're unable to reconcile any forward-looking non-GAAP financial measure to their directly comparable GAAP financial measure because the information which is needed to complete a reconciliation is unavailable at this time without unreasonable effort. In regard to our upcoming conference schedule, I will attend the Needham Virtual SaaS one-on-one conference on November 21, the Cowen Virtual Human Capital Management Summit on December 9, and the Barclays Global Technology Conference in San Francisco on December 12. And Toby will attend the Needham Growth Conference in New York on January 14. Please let me know if you'd like to schedule time with us at any of these events. With that, let me turn the call over to Steve.\nSteve Beauchamp: Thank you, Ryan, and thanks to all of you for joining us on our first quarter fiscal 2025 earnings call. We started off fiscal 2025 with strong financial results with recurring and other revenue growth of 14.2% as our differentiated value proposition of providing the most modern software in the industry continues to resonate in the marketplace. Total revenue was $363 million or 14.3% growth over Q1 of last year. Our growth continues to be fueled by our ongoing commitment to driving innovation and providing the most modern software platform in the industry, highlighted by our recent acquisition of Airbase, a modern finance and spend management software solution that combines bill pay, accounts payable automation, expense management, corporate cards and procurement capabilities. The integration of Airbase finance solutions within our existing HCM platform will allow our clients to manage all payroll and non-payroll spend through a single pane of glass, allowing for real-time visibility, faster financial close improved planning and stronger financial controls. Our innovation also continues to be recognized by third parties as Paylocity was recently named an overall leader in 10 HCM product categories in G2's Fall 2024 Grid Reports, marking 24 straight quarters of leading the HCM pack. I would now like to pass the call to Toby to provide further color on the quarter.\nToby Williams: Thanks, Steve. In October, we held our annual Elevate Client Conference, where we hosted several thousand business leaders representing HR, finance, IT, and operations across dozens of sessions over the course of two days. At Elevate, we continue to build upon our position as the HCM industry leader in incorporating AI and other emerging technologies into our platform with the launch of the new Paylocity AI Assistant, a powerful conversational AI-driven chatbot designed to streamline HR processes and elevate the employee experience. The Paylocity AI Assistant simplifies HR-related tasks by providing real-time contextual support across our entire platform, enabling our clients to more quickly complete their administrative tasks and answer employee questions, helping to make the Paylocity platform more efficient and improve the employee experience. For example, clients can leverage our AI Assistant to answer common questions such as how do I set blackout dates for PTO or how do I adjust my accrual rates. Additionally, our AI Assistant provides clients with AI-driven recommendations across the platform, including curated recommendations for new employees within LMS and identifying which employees are available and qualified to fill open shifts. System administrators can also leverage the AI Assistant to create, track and manage customer service tickets, reducing time spent on administrative tasks and freeing up more time to spend on strategic initiatives. We continue to see strong demand for our modern employee-focused solutions across our target market, and we're pleased with the momentum in our sales team through selling season. We're similarly happy with the consistency of our referral channel, which, once again, delivered more than 25% of our new business in Q1. The strong culture of Paylocity continues to be recognized externally as we were recently named to the Fortune's Best Workplaces in Technology in 2024. Echoing Steve's comments, I would like to thank all of our more than 6,000 employees for a strong start to fiscal 2025. I would now like to pass the call to Ryan to review the financial results in detail and provide updated fiscal 2025 guidance.\nRyan Glenn: Thanks, Toby. Total revenue for the first quarter was $363 million, an increase of 14.3% with recurring and other revenues up 14.2% from the same period last year. Our sales team had a solid start to the year, and we were pleased to come in $4.5 million above the top end of our revenue guidance with the majority of our revenue beat coming from recurring and other revenue, allowing us to raise our fiscal year guidance by more than our Q1 beat with a further increase in revenue guidance due to the impact of the Airbase acquisition. As a reminder, the Airbase acquisition closed on October 1 and did not impact our financial results in Q1. Our adjusted gross profit was 74% for Q1 versus 72.4% [ph] in Q1 of last year, representing 60 basis points of leverage as we continue to focus on scaling our operational costs while maintaining industry-leading service levels. We continue to make significant investments in research and development and to understand our overall investment in R&D, it is important to combine both what we expense and what we capitalize. On a dollar basis, our year-over-year investment in total R&D increased by 9.1% when compared to the first quarter of fiscal 2024, and we remain focused on making investments in R&D throughout fiscal 2025 as we continue to build out the Paylocity platform to serve the needs of the modern workforce. In regards to our go-to-market activities, on a non-GAAP basis, sales and marketing expenses were 21.6% of revenue in the first quarter and we remain focused on making investments in this area of the business in fiscal 2025 to drive continued growth. On a non-GAAP basis, G&A costs were 9.5% of revenue in the first quarter versus 10.3% in the same period last year, representing 80 basis points of leverage as we remain focused on consistently leveraging our G&A expenses on an annual basis. Our adjusted EBITDA for the first quarter was $129 million, or 35.5% margin, and exceeded the top end of our guidance by $8.5 million and represented 250 basis points of leverage versus Q1 of fiscal 2024. Excluding the impact of interest income on funds held for clients, adjusted EBITDA margin for Q1 was 29.8%, reflecting operating leverage of 270 basis points versus the same period last year. Briefly covering our GAAP results for Q1 gross profit was $248 million, operating income was $64.1 million, and net income was $49.6 million. In regard to the balance sheet, we ended the quarter with cash and cash equivalents of $778.5 million, which includes a $325 million we drew down on our revolving credit facility in late September to fund the acquisition of Airbase that closed on October 1. In regard to client-held funds and interest income, our average daily balance of client funds was approximately $2.6 billion in Q1. We are estimating the average daily balance will be approximately $2.65 billion in Q2 with an average annual yield of approximately 400 basis points, representing approximately $26.5 million of interest income in Q2. On a full year basis, we are estimating the average daily balance will be approximately $2.75 billion with an average yield of approximately 390 basis points, representing approximately $108 million of interest income. In regard to interest rates, our guidance reflects the recent 50 basis point rate cut in September with an additional rate cut of 25 basis points in each of November, December, March and May, for a total of 150 basis points of rate cuts included in guidance. Additionally, given the confidence we have in our business and our strong cash flows, we may continue to execute against the remaining $350 million authorized in our share repurchase program over the course of fiscal 2025. To date, we have repurchased $150 million or approximately 1.1 million shares of common stock, reducing diluted shares outstanding by approximately 600,000 shares or 1.1% as of September 30 versus the same period last year. Finally, I'd like to provide our financial guidance for Q2 and full fiscal year 2025. We are increasing our fiscal 2025 guidance based on two key factors: first, our strong results in Q1 and the momentum across our sales organization as we enter the heart of selling season; and second, the impact of Airbase, which is expected to represent approximately 1% of total revenue in fiscal 2025. Additionally, we are updating our adjusted EBITDA guidance based on two key factors. First is our strong results in Q1 and increased organic profitability expectations for fiscal 2025. And second, the dilutive impact of Airbase. While Airbase is expected to dilute adjusted EBITDA margin by approximately 100 basis points this fiscal year, we are realizing increased success in driving profitable growth across our business, helping to offset this impact. With that said, for the second quarter of fiscal 2025, recurring and other revenue is expected to be in the range of $337.5 million to $342.5 million or approximately 14% growth over second quarter fiscal 2024 recurring revenue. And total revenue is expected to be in the range of $364 million to $369 million or approximately 12.3% growth over second quarter fiscal 2024 total revenue. Adjusted EBITDA is expected to be in the range of $116 million to $120 million, and adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $89.5 million to $93.5 million. And for fiscal 2025, we are increasing recurring and other revenue guidance, which is now expected to be in the range of $1.427 billion to $1.442 billion or approximately 12% growth over fiscal 2024 recurring and other revenue. Total revenue guidance is also increasing and is expected to be in the range of $1.535 billion to $1.550 billion or approximately 10% growth over fiscal 2024. Adjusted EBITDA is expected to be in the range of $530 million to $540 million and adjusted EBITDA, excluding interest income on funds held for clients, is expected to be in the range of $422 million to $432 million. In conclusion, we are pleased with our Q1 results and the momentum we have across our sales and operations team as we enter the busiest time of the year. Operator, we are now ready for questions.\nOperator: Thank you. [Operator Instructions] Our first question is going to come from the line of Scott Berg with Needham & Company. Your line is open. Please go ahead.\nScott Berg: Hi everyone. Really nice quarter here. Thanks for taking my question. Toby, Steve, I wanted to start off with Airbase. You've had the asset for about 30 days now. Maybe any initial observations since you've had it? And then how do we think about specifically kind of your go-to-market motion around this product and enabling the sales force? How much of a different type of the sale will this be, and will you also really need a separate sales force to sell Airbase? Or can your existing sales force effectively sell this?\nSteve Beauchamp: Well, I think as you mentioned, Scott, it's been 30 days. And I think so far, we've spent a bunch of time with the team. We're really happy with the team that's kind of come over in the acquisition. We started very early stages integrating things like go-to-market motion, product strategy. So I don't think we have all the answers right now. I think we still feel very confident with the thesis, which is the ability to be able to sell back to our customers spend management solution where we leverage the employee data to really automate many of the workflows, much of the spend activity. And then on the back end of that being able to really leverage the data insights. I think our conversations with their teams and our teams together, we feel really confident that, that will offer a tremendous amount of value. I think if you look at historically how we've approached acquisitions, it typically has taken us somewhere in the 12 months to 18 months to have a fully integrated product to market. We'll do this in stages. This is obviously bigger and stand-alone. And so we won't wait that entire time to start gaining value from it. But we feel like we can leverage some of our internal go-to-market motion as we've sold back to the client base many other products and be able to do the same thing with the Airbase solution.\nScott Berg: Got it. Helpful. And then, Toby, you talked about a strong start to the selling season. You're pleased with what you've seen to date. I guess, as you look at the transactions in Q1 and how you're thinking about this busy selling season, is the composition of deals kind of different today versus a year ago? I didn't know if you're seeing maybe more net new customers in the pipeline versus some expansion activity or maybe that fits from that viewpoint.\nToby Williams: Yes. I would say, overall, we're definitely in the heart of selling season. And I think so far, we are pleased with the momentum we're seeing, feel good about how the team is executing. Obviously, a big part of our ability to beat in Q1 was relative to our performance from a sales and go-to-market perspective. So I think that feels good. The momentum of that carrying into selling season feels good. I think the demand environment feels good and stable to us. And then I think the execution of the team, both from a go-to-market perspective and then also relative to our channel performance also feels good. And I think we're seeing a consistent mix of both new business and back to base with what we would have seen last quarter and over the last few quarters. So I think all of that feels -- the momentum and all of that also feels good, feels strong.\nScott Berg: Great. Congrats on the good quarter. Thanks for taking my questions.\nOperator: Thank you. [Operator Instructions] Our next question is going to come from the line of Samad Samana with Jefferies. Your line open. Please go ahead.\nSamad Samana: Hey, good evening. And I'll echo Scott's comments. It's good to see the next quarter. Ryan, maybe one for you. Just as I think about the guidance increase, it's been uneven in terms of in the past few quarters of flowing through beats just as we digested what was going on in the macro environment? So flowing the full beat forward, can you maybe help us understand what gives you the confidence? Is it the start to the selling season? Are there other green shoots that you're seeing? Just maybe help me understand that, and then I have a follow-up.\nRyan Glenn: Sure. Yes. Thanks, Samad. So as you think about the guidance increase, particularly on the recurring side, we increased guidance by $22 million. I think of that as roughly two thirds of that are the impact of Airbase, as you quantified on the call, roughly 1% of revenue this year. And to your point, I think the balance of the guide is the entirety of the Q1 beat, plus some incremental upside. And I think that's really driven off of the momentum we're seeing in the sales force. I think we obviously are looking at activity levels, demand levels. And to Toby's point, I think each of those items have been -- continue to be strong. So as we look at where we are relative to pipeline and relative to execution required to hit our January numbers in the back half, we felt very confident that we were able to pass all of that beat in Q1 as well as something incrementally through.\nSamad Samana: Great. And then maybe this could be for Steve or for Toby. But when you think about it from a product perspective on Airbase and the integration there, can you walk through maybe what some of the efforts you have on the product side, how long we should think that, that part in particular should take? And how soon it'd take to make it look like it was one product or a single pane of glass for products on, for customers on both sides of the product?\nSteve Beauchamp: Yes, sure. So I think just our approach generally towards prior product acquisitions is we definitely want to take the time so that we can deliver the right level of user experience and truly deliver an integrated solution. You can see that with our head count, product launch, which clients can be starting on in January, which we feel really good about. I think this is a little bit different because they've got a little bit more of a substantial stand-alone client base. And so there is an opportunity for us to attack this a little bit more incrementally, maybe a little bit more how we attack something like Blue Marble. And so I would see this continuing to get more integrated and better. As time goes on, I think we believe that we'll make some improvements to that really certainly in the first year of having that acquisition, but you'll see even greater improvement come between 12 months and 24 months, and we'll continue to integrate those solutions. So you think of things like workflows and insights and reporting, that might take a little bit longer. But once you start delivering those, you really truly get the value of the integrated platform. So it's a big acquisition for us. It's important to us. We're focused on it, and we feel confident we're going to be able to deliver the right solution to our customers.\nSamad Samana: Great. Appreciate the time as always. Thanks.\nOperator: Thank you. [Operator Instructions] Our next question is going to come from the line of Mark Marcon with Robert W. Baird. Your line is open. Please go ahead.\nMark Marcon: Good evening and thanks for taking my questions and congratulations on the strong performance. Wondering with regards to Airbase, what's the initial reaction from your existing clients? What are you hearing from them? Any sort of feedback that you've gotten? I'm just wondering what you're hearing.\nSteve Beauchamp: Yes. I mean, I think at the end of the day, the existing clients don't have a lot of exposure to it. They probably see the press release and some of the news and don't necessarily have a good impression in terms of how that will impact them. I think the idea, though, that they understand is our ability to leverage the employee record and then be able to help other challenges that are disconnects in their organizations already. So communication between an HCM and a financial platform is a point of disconnect that we've heard from our customers. You see us addressing that with the head count planning solution, the concept of me able to manage spend data, where I can, as a manager, approve spend in the same spot that we're approving time off. It's pretty interesting to them. So I think they get it conceptually. We certainly are not at the point in time where we've rolled anything out to current clients. But we're excited about the concepts and the reaction that we're getting. I think the second thing I would say to you is, we do have a subset of mutual customers. It's not a huge number, but we have spent time talking to those mutual customers, and they are providing us feedback and are even more excited about the opportunity that they will have as we continue to integrate the platforms.\nMark Marcon: Great. And then with regards to the performance during the quarter, I mean, the margin improvement is really impressive. I'm wondering if you can just talk about -- a little bit more about the leverage areas that you would expect over the course of the year. You certainly saw leverage in terms of sales and marketing and G&A. G&A, we always expect. But how are we thinking about the sales and marketing and then the gross profit margin ex-float?\nRyan Glenn: Hey Mark, it's Ryan. So I think to your point, really pleased with the results in Q1, 270 basis points of adjusted EBITDA leverage ex-float. I'd add, too, on free cash flow as you look at over the last 12 months, free cash flow margin of about 23%. So that's up nicely over the same period over the prior year. Where I'd expect to see leverage is largely consistent with what we saw in Q1. So 60 basis points of gross margin leverage. I think that's an area that we continue to see opportunities to scale both through general efficiencies as well as automation. G&A, to your point, is one where we would expect to see leverage annually as well. And I think sales and marketing and R&D are not necessarily areas that we look to drive leverage. But I think as we approach $1.5 billion of revenue moving towards $2 billion, we're certainly thoughtful on customer acquisition costs and prioritizing investments because I think at that size and scale, expectation would be that you're mindful of each of those items. So I wouldn't put those at the forefront necessarily, but it wouldn't surprise me if we did see some efficiencies there as well.\nRyan Glenn: Terrific. Thank you.\nOperator: Our next question is going to come from the line of Daniel Jester with BMO Capital Markets. Your line is open. Please go ahead.\nDaniel Jester: Great. Thanks for taking my question. Maybe to stick with the Airbase theme and maybe attack it from a little bit different angle. So I think in the past, when you launch new products, I think you said the goal is to try to get it into 10% to 20% of the customer base in a few years of launching. As I think about Airbase, does that have the same characteristics of the ability to push at that same velocity? Or is there significant differences in terms of how we should think about cross-sell momentum in the future?\nSteve Beauchamp: Yes. So I think you stated it very accurately, we definitely like to target between 10% and 20% penetration over several years. I think Airbase is a more substantial company and has a stand-alone customer base. And so there's certainly an opportunity to continue to grow that. But we definitely believe the big opportunity is the nearly 40,000 customers that we can sell back to. And so if we were to fast forward several years from now, we saw that 10% plus penetration number, that would be a big success. And that - it might take a little longer than that several years, but we definitely think over time getting into that 10% or 20% target is certainly feasible and something that we're going to focus on.\nDaniel Jester: Okay. That's great. And then, Ryan, maybe just on the Airbase revenue. Maybe help us think about sort of the subscription component versus the transaction component, and maybe how they're growing. And how does that affect maybe your forecasting ability of the business going forward? Thank you.\nDaniel Jester: Sure. So I think part of the integration work that we're doing is obviously working closely with the FP&A team at Airbase and I think we have spent a lot of time with them over the last month. So feel very comfortable about how we're able to model and truly incorporate that business into all of our planning broadly, but certainly relative to guidance. So nothing I would point out there relative to concerns. I think as we talked about over the last, call it, 60 days or so. That business has grown nicely historically and continues to do so. So as we go further into the year, I think we'll be able to provide some incremental color but able to factor in the trajectory of the business to date, both into revenue and profitability guidance.\nSteve Beauchamp: I think the other thing to note is that business is largely software fee-based revenue versus other models that you might be familiar with in the industry, which I think makes Ryan's comments even more manageable.\nOperator: [Operator Instructions] Our next question is going to come from the line of Jared Levine with TD Cowen. Your line is open. Please go ahead.\nJared Levine: In terms of the Airbase, can you talk about how much incremental expansion of your existing 19.5 HCM billion TAM this drives?\nToby Williams: Yes. I mean, I think - so a couple of points. I mean one is - I think one of the keys, as we've talked about, was the twofold expansion of the TAM into the office of the CFO, which I think has been a - which has been an area that's been really attractive from a software category standpoint. And I think going back to some of Steve's comments, I think our ability to take the time now that we've closed on the transaction to integrate that product set into our platform will give us the ability to, as noted, both add new clients to the platform and then the bigger opportunity of going back into the customer base. I think one of the other things that we've talked about is we continue to believe we have the opportunity to expand PEPY as we have done from an HCM standpoint. But I also - the opportunity to expand the TAM is certainly a focus of going into the office of the CFO and a focus of the acquisition of Airbase and then building those products into the platform. The revenue model is slightly different from a PEPY perspective. And so I think one of the things that we'll be working through as we integrate the business is what does that pricing model look like and how to factor that in, in terms of how we're talking about the TAM that we're focused on both from an HCM standpoint and from a spend management or from a finance application standpoint. And I think that's part of the work that we'll -- that we are doing in the course of the integration effort.\nSteve Beauchamp: I think the only thing I would add is this is a meaningful product in terms of the revenue per customer opportunity, certainly more meaningful than any module addition that we've had in the past. So that is also part of what excites it to put the opportunity.\nJared Levine: Got it. And then your partner Marketplace was an area highlighted at the Elevate Conference. Can you discuss how material partner derive Marketplace revenue is currently? And how large do you think it can become over the medium term?\nToby Williams: Yes. I think it's important to us in a couple of different ways. I mean, one is I think we -- our approach from a platform integration perspective, I think, has been differentiated in the industry. I think that is -- it's a significant value add from a client standpoint, the ability to have an open platform where you can integrate third-party products, whether that's moving data between, for example, our platform and a carrier or another benefits related product is something that our clients see as really valuable. I think that's also really important for our channel partners. Again, more than 25% plus of our -- more than 25% of our new business is referred to us from channel partners, which is, in large part, brokers. And so I think there's a number of things that are really important to us from a strategy perspective in terms of how we've approached our marketplace and our integration efforts more broadly. And I think that's been a really impactful contributor to, not just our revenue growth, but to our client satisfaction and the differentiation that we've been able to drive from a competitive perspective.\nSteve Beauchamp: I would just add one other point. As you think about Marketplace, I think Toby highlighted a lot of client value points. There's times where we may monetize some of that via partner revenue streams. There's other times where clients are paying for functionality. And so it's certainly a mix of that, and we view that as really a core part of the solution that customers are selecting versus some sort of separate carve-out from a revenue stream perspective.\nJared Levine: Go it. Thank you.\nOperator: Thank you. And one moment as we move on to our next question. Our next question is going to come from the line of Brian Peterson with Raymond James. Your line is open. Please go ahead.\nBrian Peterson: Hi, thanks gentlemen and congrats on the strong quarter. I wanted to ask another way to look at Airbase. I'm curious what most of your customers are using or how to think about that greenfield opportunity as you look at the 40,000 customers you have today, any perspective on that?\nSteve Beauchamp: Yes, sure. I don't think we have perfect data, but we certainly understand the market as a whole before kind of entering that space. There still is a fair amount of I'm managing this via spreadsheet through manual processes and you think about maybe the core part of our marketplace and our average size customer. As you get to larger customer size, then they may be using different software solutions, either add-on to an ERP or some separate solution to be able to manage that. So it's definitely a bit of mix. We think there's a real opportunity to be able to provide differentiation when you really combine that with the HCM data. And so certainly, the that have not automated yet are obvious customers, but also those that might have a series of several solutions put together to try to get to the same objective and the idea of coming to a single platform, we think, can be attractive to them as well.\nBrian Peterson: That makes sense. And just a follow-up on AI. I'm curious how big of a swing factor the features or the road map really is at this point in terms of competitive dynamics. Is this becoming table stakes? Or is this still kind of viewed as maybe a nice to have element at this point?\nSteve Beauchamp: That's a great question. I think you have to really get down to the value that's being driven from the implementation of AI across your platform, and they get down to really practical examples for customers. So is it going to be easier for me to find reports across the system. Can I get the answers to the questions that I have super-fast and much easier than I have before. Are you providing me the embedded writing assistance that I might be able to really save time on. And so I think there's a lot of conversations broadly around how AI can snap your fingers and have a big giant change, but it's really an evolutionary change. So all of our product teams really try to think about ways that they could use platform capabilities and AI to really improve the client experience. And then when you start demonstrating those experience to customers and they start seeing the time savings, the incremental insights they can get from that, that's where the value derives versus having maybe just -- while I think their chatbot that does all of it, it's got to appear differently to the customer. So the way we think about it is embedding this across the platform and really trying to drive value back to the customers. And you see that with our most recent introduction of a chatbot. It's really going to allow them to get answers to their questions. Right at their fingertips. We don't want to take away the service component of our offering, but there's times where that's just convenient for a customer and that self-service capability is going to create better satisfaction. And so we just think that AI is not a product on its own, but an embedded part of our platform.\nBrian Peterson: Great color. Thanks, Steve.\nOperator: Thank you. And one moment for our next question. Our next question is going to come from the line of Terry Tillman with Truist Securities. Your line is open. Please go ahead.\nTerry Tillman: Yes. Gentlemen, thank you for taking my questions and congratulations on the quarter. I guess, the first question is, as you're all kind of looking into the selling season, you have a very large sales force, you've got a building pipeline. Is there anything that's different kind of in the selling season from a target customer persona in terms of maybe the average size of these deals in your pipeline versus the last couple of years? I think you crossed over like 150-plus employees in terms of average customer size. Is anything different in terms of kind of the makeup of the pipeline this year versus maybe prior years? And then a follow-up.\nToby Williams: Yes, I don't -- I mean, I don't think there's any fundamental difference, Terry. I mean, I think the one callout that we've made pretty consistently over the last, call it, two to three years is just the extent to which we've continued to see success and traction slightly upmarket from where we've been, which we talked a lot about. And I think that continues to be the case and continues to be true. And I think we're -- we've seen -- I think over the last number of quarters, we've seen -- we've continued to see traction and performance there. So that's less of a new this quarter call out and more of the trend that we've seen pretty consistently on a pretty even trajectory over the course of the last two to three years. And I don't think there's any different persona involved in that or anything. I think it's just -- that continues to be the case and is the trend over the last couple of years.\nTerry Tillman: Okay. Got it and thanks for that. And just a follow-up. Last year, I think it was really well balanced in terms of where the growth is coming from on the customer side and then the average revenue per customer. How are you thinking about this year? Is it a pretty even balance, 50-50 this year? And at the same time, when you're signing these new deals, do you assume a higher attach rate of other products at point of sale versus last year? Thank you.\nToby Williams: I think it's been -- we did see it fairly well balanced in last fiscal year. And I think that was essentially our stance coming into this fiscal year was the assumption that it would be relatively well balanced again. Obviously, that changes a little bit year-to-year and it also changes a little bit quarter-to-quarter. But I think on balance, we would see that trend continuing from last fiscal year.\nOperator: Thank you. [Operator Instructions] Our next question is going to come from the line of Raimo Lenschow with Barclays. Your line is open. Please go ahead.\nSheldon McMeans: Hi. This is Sheldon McMeans on for Raimo. Thanks for taking our question. I wanted to ask about the Elevate Conference. Can you speak to activity and engagement coming out of the event and perhaps how this compared to last year?\nToby Williams: Yes. I mean, I think first of all, just -- this is always a great event. I think it was again this year. I'm really pleased with the attendance, which was up from last year, and we had -- we're also really pleased with the breadth of attendance from a role perspective. We had attendance from HCM or HR, finance, operations teams really across the spectrum from our clients in terms of the roles that are represented. And it's always a great opportunity to both connect with our customers and give them a view of what we're doing that's new and different for the year, be able to connect on new products and overall, just drive a higher level of activity engagement with our clients, which I think was also a focus for this year. And overall, really pleased with how the conference turned out and appreciated all the attendance we had from our clients and all of the -- all the work went into it from an employee standpoint. So overall, really pleased with the success of it again this year.\nSheldon McMeans: Great. And I also wanted to ask about Airbase. Is there a sweet spot in terms of the target customer within Airbase, perhaps by size or industry? It did seem from your earlier comments that your whole customer base is addressable. But I was wondering, in particular, if Airbase could help you move up market. As I would imagine, some of your larger customers would be using a solution, perhaps.\nSteve Beauchamp: Sure. Yes. So I would tell you, one of the things we really liked about Airbase is the customer size overlap in terms of our average sized customer. So obviously, they don't have the number of customers we do, but they're -- when you look at their average size, it was very close our average size. And so that's where the need of our customers obviously lie. That is part of what gives us confidence that we can get to kind of those milestones in terms of 10% to 20% penetration over the next several years. And so that's good. I think the other thing I would say is, Airbase has also been on a very similar journey that you would see with any products that we've released, which is you start by going after that average [ph] size customer, you get customer feedback. And based off that customer feedback, you make those products even better. And they typically, as they get better, they get stronger as you move up market. We've seen that with pretty much every module we've released. I think Airbase has also been on that exact same journey. So I think the near-term opportunity is at the core of our marketplace. And then over time, if we execute the same playbook we have with other products, we'll be able to gradually move that size up over time as well.\nSheldon McMeans: Excellent. Thank you.\nOperator: Thank you. And one moment for our next question. Our next question is coming from the line of Siti Panigrahi with Mizuho. Your line is open. Please go ahead.\nUnidentified Analyst: Hey, this is Phil [ph] on for Siti. Just -- I'm genuinely so sorry if this was already asked, but how much of your growth is coming from new versus existing -- versus cross-selling to the existing base? And are there certain products that you're seeing more traction with when you're selling to the base? Thanks.\nToby Williams: Yes. I think we've seen -- I stated this a few minutes ago, but I think we've seen a pretty even balance through last year and coming into this year in terms of new clients and then increase in ARPU. So that's been fairly well balanced. And I think I would also say, just as it relates to the mix, I think we've seen solid contribution from both new business and back to the base as we came through last year, including through Q4. And I think that's remained fairly consistent through the course of Q1, and that's also our expectation as you look out into the remainder of fiscal 2025.\nSteve Beauchamp: Yes. I think I would add, if you look at the last cohort of products that we added over the last 18 months or so, I think we're pretty happy with the performance across the board of those products as they kind of ramp into the target zone penetration that we've had for them. So whether that's Scheduling Plus or Market Pay or Rewards & Recognition [ph] or Employee Voice, those have all really ramped really nicely for us.\nUnidentified Analyst: Thank you.\nOperator: Thank you. One moment for our next question. Our next question comes from the line of Jake Roberge with William Blair. Your line is open. Please go ahead.\nJake Roberge: Yes. Thanks for taking the questions. Just on the Airbase front, can you talk about some of the learnings you've had with your earlier products in the office of the CFO, and just your ability to address that type of buyer that influence the deal or that you may actually do differently as you enter the market this time around?\nSteve Beauchamp: Yes, sure. Obviously, the CFO is going to be a different persona than you would see you in HR. It's not a new persona for us. It's certainly somebody that is often the final person that might sign the deal. When it comes to HCM, they -- as you think of our core market, the 100 employees or 150 employees, they oftentimes are involved in those meetings and very much sit through the demonstration and our key decision makers. So it's not brand new for us. Obviously, that's not their maybe primary domain that they're running, although there are times that payroll reports into the office of the CFO. But you definitely see there's an element of ROI. There's an element of making sure that they're going to get adoption of the products to be able to drive the value. There's certainly an idea of managing costs and controlling expenses. And so we think all of those really key important things that a CFO is focused on are key elements of what Airbase is offering. So we think that as we integrate the products, it's going to tie pretty nicely into our process. We don't know whether how much of that is going to happen at the first time we bring on new customers and how much of that is going to be selling back to the client base. We've had great success in selling back to the client base, so we feel pretty confident that we can kind of figure that one out. But it isn't a brand-new persona for us. We feel pretty confident we can work pretty well with CFOs buying and decision-making process.\nJake Roberge: Okay, helpful. And then can you just talk about the early feedback you've gotten for your AI? Is it just the ROI that customers are seeing with that? And I know it's not being sold as a separate SKU today, but are you seeing any green shoots on the AI front that could be productized moving forward?\nSteve Beauchamp: Yes. The last part first. I don't think we've really focused on trying to develop a monetizable solution from an AI perspective. And I think the reason is we've seen so many opportunities to be able to embed AI capabilities across our entire suite and really add value and create differentiation in the marketplace. And so from a chatbot perspective, we see a couple of big opportunities. So first, it's the ability to answer questions really quickly for our customers. And sometimes, its questions that maybe they wouldn't normally call for, I just need a quick answer. I forgot how to do something. I'm doing something very much for the first time. Super-fast, super easy, very direct is the feedback we've gotten. And the beauty of AI, as all of you know, is we get feedback from the customer. So we get -- our answer rate continues to improve the more interactions you get with the customer and the more that we continue to add data to the model. So we're really excited about the early trajectory of that product. The second opportunity, as we think about longer term, you can also think about answering employees' questions. So HR departments get a lot of questions from employees. And so the more questions that you can offload from an HR perspective, we think the more value that you can add from a customer as well. So those are the two primary use cases we've gotten positive feedback from customers.\nOperator: Thank you. And one moment as we move on to our next question. Our next question comes from the line of George Kurosawa with Citi. Your line is open. Please go ahead.\nGeorge Kurosawa: Hi, thanks for taking the questions. I'm on for Steve Enders. I wanted to ask one of your mid-market players in the space called out elongated deal cycles earlier this morning. Are you guys seeing anything on that front? Maybe just any comments on how rep productivity is trending more generally?\nToby Williams: Yes, I think that's a topic that we've certainly talked about over the last, going back probably three or four quarters at this point. And I think our comments had been at the time that we had started to see some elongated sales cycles, particularly at the top end of the market. And I think as we came into Q4, our comment was that had -- we've seen stability there. And I think that would probably still be the comment today. I think we have seen that, but it's pretty stable at this point and not really any call out to make on a quarter-to-quarter basis versus where we would have been in Q4.\nGeorge Kurosawa: Okay. Great. And then on Airbase and just moving to the office of the CFO, I mean, you bought an asset that has pretty broad products set already. When you think about your long-term vision ambitions in this space, do you feel like this gets you most of the way there? Or should we think about this as kind of the first step in a bigger journey?\nSteve Beauchamp: Yes. I mean, it is a pretty broad platform that handles a number of pain points for customers in that category. I think first mission for us is integrating the platforms and driving value back to the customers and then obviously driving volume after that. And so I think we're pretty focused on that. We're open to new opportunities, though. I think if you think our client journey has always been client as a co-creator. So we're going to get feedback through that as we scale customers, we're going to find new opportunities. Those new opportunities will certainly be largely organically building on top of that and looking at new opportunities. But we're open and highly selective to look at external M&A opportunities if they present themselves. But I think right now, we're very much focused on this being an important first step. We also have our headcount planning solution module that launched in January. So that does give us another product in that category as well. So certainly, opportunities to expand. It is a big category, and it's one where we really want to focus on the HCM data providing leverage.\nGeorge Kurosawa: Got it. Thanks for taking the questions.\nOperator: Thank you. One moment for our next question. Our next question is coming from the line of Arvind Ramnani with Piper Sandler. Your line is open. Please go ahead.\nArvind Ramnani: Thanks for taking my question. I just want to ask about your -- kind of the full year raise. Was the full raise kind of largely incorporating Airbase and 1Q performance? Or have you been able to raise full year more than that?\nRyan Glenn: Hey Arvind, it's Ryan. Yes. I think as I mentioned earlier and noted in the prepared remarks as well, I think there was a couple of factors on the raise to the year. So one was certainly, the $5 million beat we saw on the recurring side in Q1. And then we took a further raise for the momentum we're seeing across the sales organization headed into the heart of selling season. And then the third piece would be Airbase. I think, to size those two-thirds of the raise so that the two-thirds of the 22 million we raised on recurring would be Airbase and the remaining one-third, roughly would be organic revenue that we raised to the year.\nArvind Ramnani: Right, right. And then you also kind of highlighted the demand environment feels good. Channel performance also is in good shape. Would that mean like if this kind of environment continues, then you could see further upside? Or I'm just trying to understand kind of in terms of your full year guide, what's assumed from an environment perspective, from a macro perspective?\nRyan Glenn: Sure. Yes. I think as we called out when we initially provided fiscal 2025 guidance in early August that our desire was to get back to a beat and raise cadence. And I think we obviously did that here in Q1 and feel good about the momentum across the business. So I think our view would be if we continue to see solid execution that we continue to be in a position where we'd be able to beat and raise guidance as we move throughout the year. I think from a macro standpoint, Q1 came in modestly better than expectations. As I mentioned earlier, the vast majority of the beat that we saw in Q1 was really driven off of sales momentum, but modestly better than expectations. So we factored that into guidance, although I think we continue to be in a spot where we're being pretty prudent and thoughtful relative to the macro. So have not gotten particularly aggressive there. So if we see continued trends as we saw in Q1, that may result in a bit of upside over the balance of the fiscal as well.\nArvind Ramnani: Perfect. And just last question, just on AI, really good updates here. As you look out over the next year, couple of years, would you anticipate like making a meaningful step-up in kind of investments with AI as you look to expand your offering to your clients? Or you feel pretty good that you'll be able to continue with the kind of similar spend level?\nSteve Beauchamp: Sure. Yes, I think we've had a pretty consistent spend level in R&D. It's not a place that we necessarily look for much leverage. We feel like we need to be able to continue to invest in product differentiation. We started the data science team that produces our AI offering almost five years ago. And so it's not a brand new investment for us, and it's one that we've obviously expanded as we've seen incremental use cases. And so I don't think that we foresee any reason to need some outsized sort of step-up expense. We think we can fit our AI investments into the existing forecast that we've provided and that we can continue to innovate at a pretty accelerated rate based off what we've already created and the capabilities that we have internally.\nArvind Ramnani: Perfect. That's all I had. Thank you very much.\nOperator: Thank you. One moment for our next question. And our next question comes from the line of Jason Celino with KeyBanc Capital Markets. Your line is open. Please go ahead.\nJason Celino: Great. Thanks for fitting me in. I don't think you've talked about it yet, but what did you see in terms of employment levels on the platform in the quarter? And then are you kind of accounting for a further degradation through the year? Just curious what you have there.\nRyan Glenn: Sure. Hey Jason, it's Ryan. I think we saw modest upside versus expectations in Q1. I think we've continued to see resiliency within the client base from a workforce level standpoint. So that provided a little bit of upside into the quarter. We have not really assumed any further acceleration over the balance of the year. So year-over-year, you'd likely see workforce levels up modestly, but I think we continue to take a fairly cautious and prudent approach and we'll obviously update guidance as we go throughout the year to the extent we get further evidence of stability. But so far, feel good about where that trended in Q1, and we'll obviously update you after the second quarter.\nJason Celino: Okay. Excellent. And then when you were answering Arvind's question, you talked about good sales execution. Curious if you've seen any changes in the competitive environment. Obviously, different companies are navigating these current conditions differently. So any changes to win rates or anything there?\nToby Williams: I mean, I think as we've said many times before, I mean, the environment has always been competitive and continues to be. But I will say again, I mean, really pleased with the execution that we've seen with our go-to-market teams across sales and marketing and then also with our channel initiatives continuing to drive more than 25% of new business coming from our channels. And so I think overall, as we're really at the heart of selling season right now, I feel really good about the execution that we saw in Q1. That's what provided the upside to the quarter. And I think we're encouraged by what we see in terms of the execution as we go into and through selling season. And I think that's really the core of our focus right now, as we sit here at the end of October.\nJason Celino: Okay, perfect. Good stuff. Thank you.\nOperator: Thank you. And I would like to hand the conference back over to management for any closing remarks.\nToby Williams: Just wanted to say a very happy Halloween to everyone, and thank you so much for your interest in Paylocity, and thanks again to all of our employees for helping deliver a strong quarter. Thank you very much.\nOperator: This concludes today's conference call. Thank you for participating. You may now disconnect."
  }
]